{"post_id": "b84td2", "created_utc": 1554136931, "title": "Meta: Do not touch the poop, dammit", "author": "maybesaydie", "self_text": "What, you may ask, does that mean? It means **do not go to source material and interact in any way with the original poster.** Don't comment. Don't link. **Don't be an asshole.**\n\nWe've had several instances of this behavior in the past few weeks. It results in a permanent ban every time. We will also report you to the reddit admins for harassment.\n\n\n**TL;dr:** Don't interact with source material. Don't help other users interact with source material. Bans will be issued.\n", "subreddit": "fatlogic"}
{"post_id": "b84vd3", "created_utc": 1554137191, "title": "How do you let go of society's beauty standards?", "author": "seriouspuppy", "self_text": "I've been feeling really bad lately. I've \"recovered\" from my ED and I'm at a healthy weight. I did that eating healthy and lifting weights. And I eat enough and I don't overexercise but I still feel like absolute garbage because this just doesn't make me happy. . I've gained some muscle, I guess I like the way my body looks but I'm not happy about it because I did it using ED behaviours. I have the discipline to build muscle and to eat healthy but I just really, really, really don't want to. I'm so scared of how my body is going to change, losing my identity as the \"fit girl\", probably not having the \"perfect body\" and all that. I just hate how diet culture acts like working out and eating healthy is the best thing in the world. At least you don't have to be stick thin anymore, but sometimes I feel like this \"strong not skinny\" thing is just as toxic. I don't want to be strong. I want to be free.", "subreddit": "BodyAcceptance"}
{"post_id": "b8aqp4", "created_utc": 1554159378, "title": "Does anyone know of any books with fat characters that don't end up losing weight?", "author": "Gleekguy", "self_text": "An odd request, I know, but I'm looking for a book with a fat main or recurrent character where they don't just find happiness via weight loss. \n\nYA preferred, but anything works. \nThanks! ", "subreddit": "BodyAcceptance"}
{"post_id": "b8cauu", "created_utc": 1554167015, "title": "having children scares me", "author": "biiiiiiiiii", "self_text": "i have really bad body issues since i was a young teenager and recently (in the last 2ish years) i’ve been really against having children. This is mainly because i’m really afraid what will happen to my body. I’ve been skinny all my life and right now i’m still on the lower end of average with my weight and whenever i think about pregnancy i feel so sick and anxious. i’m not sure if i actually don’t want kids or my body issues have just fucked me up.. ", "subreddit": "BodyAcceptance"}
{"post_id": "b8ds1f", "created_utc": 1554175252, "title": "I don’t feel “sexy”", "author": "crabcakes52", "self_text": "I’ve always been called “cute” or “cuddly” while girls I know were “hot” and “fuckable” by standards of men, which I know is ridiculous because everyone is different. “I have more to love” but I don’t want to be labeled that way. I avoid looking in mirrors because when I do, I hate what I see. I have thick thighs and an ass to match. I made a joke saying “if I ate this bacon it’ll go straight to my thighs” had a coworker then say to me “well how much bacon have you eaten?!” Jokingly? Idk. \nI have a loving boyfriend who accepts my body. But I can’t seem to do the same. I take pictures of myself and study them. Hoping I’ll snap out of it (only makes it worse, I know). How can I work past this? I compare myself to everyone I see. And my friends tell me I’m ridiculous, but I feel like they’re just saying that because their my friends. I’ve been on crazy diets and working out all the time. Can’t seem to change what I am. Or how I see myself. ", "subreddit": "BodyAcceptance"}
{"post_id": "b8hbkp", "created_utc": 1554200019, "title": "My SO has a Genetically Perfect Body and I Don't.", "author": "M_ithAvo", "self_text": "This feels like such a stupid thing to worry about, but I can't stop berating myself over it. My SO stores fat only in his perfect butt, while I store fat in my abdomen and chest.  I am fit and work out at least 5 times a week, while he works out twice a month max. He looks lean and defined, while I hate the way I look. I will never look like him, and I will never be happy with my body.  I don't want to accept my body, I want to change it. It's so easy for him to tell me not to worry about it. I wish it were easy. I don't know what to say except that I need help and don't know how to get it. Has anyone here experienced anything similar? ", "subreddit": "BodyAcceptance"}
{"post_id": "b8kgot", "created_utc": 1554217866, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b8t6g9", "created_utc": 1554263501, "title": "\"Unconventional\" Plus Size Body", "author": "foreverlullaby", "self_text": "I know that \"technically\" the body positivity movement is about accepting bodies of all shapes and sizes, but I feel like all I ever see is people with ~acceptable~ curves. Hourglass and pear is all I ever see, and I am definitely not either of those. \nMost of my weight is in my stomach, chest, and arms. I have very narrow hips and pretty muscular legs that don't match the rest of my body. Whenever I try to follow body positive accounts on Insta etc, they all seem to post people with curvy bodies. I just want to see someone out there who looks like me, who can find amazing clothes, be treated well by her peers, and is able to have a positive relationship with romantic experiences, rather than being filled to the core with insecurities. \nI know we all have our insecurities, and it definitely helps to hear about the experiences of others, regardless of how well their problems match yours, but sometimes I wish I could just find my problem twin so we could encourage the other and have a better chance of understanding whether the other is coming from. \nDo y'all have any suggestions? ", "subreddit": "BodyAcceptance"}
{"post_id": "b8y32h", "created_utc": 1554298807, "title": "Finally got matching lingerie", "author": "Black_Delphinium", "self_text": "I didn't really have any place else to share this with anyone, but I figured this community might be appropriate.\n\nI'm approaching 40 and I am not in the best shape and I've never really put any effort into buying cute under things, because they're very hard to find in my size and my husband never cared so why bother? But the other day I saw that there was a really good sale going on at Lane Bryant, so I finally ordered myself some really cute underwear and now, for the first time ever, I actually have matching bras and panties, and they're cute, and I'm really happy about it.", "subreddit": "BodyAcceptance"}
{"post_id": "b8ysbn", "created_utc": 1554302310, "title": "A note on some recent submissions", "author": "PrimeMinisterOwl", "self_text": "We've been inundated with post after post featuring the Shake your Beauty campaign featuring an overweight woman doing yoga.  Just.  Stop.\n\nIt's a single picture of a person with \"I may be big but that doesn't mean I'm unhealthy.\"  Or something like that.  \n\nIt's a picture of a person doing some physical activity, with at best two sentences.  We don't want to link to this series, or mock someone who may actually be getting some physical activity, so please give it a rest.\n\nAlso the tinder photo of the guy who doesn't know why he's fat?  Come on, how many times is that going to get submitted?\n\n-Grumpy Mod", "subreddit": "fatlogic"}
{"post_id": "b8z7c0", "created_utc": 1554304341, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "b95skh", "created_utc": 1554336852, "title": "How to feel “pretty” in a ponytail?", "author": "coffeealpha", "self_text": "I’m going to be starting dental school soon and I cannot wear my hair down like I normally do. (Safety hazard) \n\nI’m super self conscious of my nose and laugh lines and I feel like I look like an ugly man if I don’t wear mascara and leave my hair down. \n\nHow can I feel like a girl while wearing a pony tail? I always feel so ugly in one and I don’t know what to do for the rest of my life! I really want to be a dentist and help others, but if I’m obsessing over how ugly I think I look, how can I trust myself to focus on treating others? ", "subreddit": "BodyAcceptance"}
{"post_id": "b9dy0q", "created_utc": 1554390705, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "b9ohvd", "created_utc": 1554452126, "title": "I have really small feet and it really upsets me.", "author": "relaxinginthedark", "self_text": "I'm 18/M and all my life I've had really small feet. One girl even laughed about it. I was very skinny in my childhood so that probably did play a role. I'm really self conscious about it. If you wanna know my foot is 24cm in length. I'm scared that when it comes to dating girls would react with horror.", "subreddit": "BodyAcceptance"}
{"post_id": "b9q63x", "created_utc": 1554464758, "title": "Watching Game Of Thrones upsets me and my confidence", "author": "shot_in_the_head", "self_text": "This may sound stupid but when I’m watching a very vulgar show with my fiancé like Game of Thrones, and there’s SO many naked attractive women, all who have bigger tits than I do, I feel so insecure. I feel like he wishes I looked like them. He of course tells me otherwise. He tells me he loves me and my body and he wants no one else but my head tells me otherwise and he is so upset that I refuse to watch the show. And he’s upset that I don’t like it when he watches it. It’s like watching soft core porn, and no matter how good the plot is, I can’t get over that. Last night he wasn’t irritated but he was trying to make me feel better and trying to get me to give the show a chance but he just made it worse. He explained how the women on the show are objectively attracted and that doesn’t mean he wants them. But then he said that I have smaller boobs than most women in the world and I should get over seeing tits on the tv screen because he loves me the way I am. Honestly, that didn’t make me feel any better. All of that made me feel worse because all I heard was “the girls on the show are hot and have bigger boobs than you and so does everyone else”. Now, the next day, I’m feeling so insecure. I hate myself. I don’t want to look at myself in the mirror. I’m literally crying typing this. And it’s not his fault. He did nothing wrong. He’s perfect. It’s me. Why am I like this? What do I do? I don’t want to tell him how I feel because he will feel guilty and he shouldn’t. I’m just so hurt on the inside. I hate my body. ", "subreddit": "BodyAcceptance"}
{"post_id": "b9rdoo", "created_utc": 1554471845, "title": "[sanity] I guess she is one of he 5% diets work for", "author": "doctorake38", "self_text": " [https://www.cnn.com/2019/04/05/health/turning-points-helen-costa-giles-weight-loss-workout-mom/index.html](https://www.cnn.com/2019/04/05/health/turning-points-helen-costa-giles-weight-loss-workout-mom/index.html) \n\n&amp;#x200B;\n\nAmazing to see one person react to a wake up call with a lifestyle change.", "subreddit": "fatlogic"}
{"post_id": "b9seuf", "created_utc": 1554477212, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b9z659", "created_utc": 1554513291, "title": "What are some things that the /r/fatlogic hivemind says is fat logic, but actually isn't?", "author": "[deleted]", "self_text": "I'm a statistician and economist. I'm also a fellow mocker of fat logic. But sometimes my views conflict with this sub. As a statistician, I pay very close attention to correlation vs causation, and I have training in biostatistics. \n\n&amp;#x200B;\n\nRecently, I saw a post mocking those who say obesity doesn't **cause** type 2 diabetes. This is frankly, false. While the scientific community has strong evidence that obesity is very very very very VERY VERY correlated with diabetes, we **do not** have evidence that obesity **causes** diabetes. Maybe \"causes\" is used different between lay people and scientists, I don't know, but by any rigorous statistical metric, it is 100% **incorrect** to say that obesity **causes** diabetes. \n\n&amp;#x200B;\n\nNow, would I advice a fat person to not care about obesity? FUCK NO! Correlation isn't as good as causation, but correlation is better than nothing. Obesity is **correlated** with diabetes, so lacking any additional info, we should **make decisions AS IF** obesity is causally linked to diabetes. But the technical truth is that we have no evidence that obesity **causes** diabetes\n\n&amp;#x200B;\n\nHere ends my rant. Now my question to spur discussion: what are some other things that this sub considered fat logic, but which is actually technically true?", "subreddit": "fatlogic"}
{"post_id": "bad9ij", "created_utc": 1554615245, "title": "Need Advice in helping my Wife Find a Doctor who will not body shame her.", "author": "artisntsafe", "self_text": "I tried postinh this on r/AskWomenAdvice but I think it was flagged because their rules state to not post medical advice, and my questions aren't specifically medical, I just need some resources... Anyways ...\n\nI just had one of the biggest fights with my wife and it has left feeling frustrated, raw and empty, but I need to do something meaningful with these feelings, so I am turning to you folks. \n\nThe fight stems from my wife approaching me for the 40th time with weird welts/hives on her arms, chest and back. She has had a number of weird symptoms for years now and it just seems to be  getting worse every week. My frustrations comes from the fact that she will not even attempt to find a general practitioner that will figure out what's wrong with her.\n\nSome background: I have been with my wife since we were in high school and we're in our early 30s now with a toddler, our dream home and decent careers. We were already three years in to this relationship when she was diagnosed with Hypothyroidism/Hashimoto's disease.  She had gained 80+ pounds over the course of our teenage years and her energy level dropped. Her pediatrician, under her parent's insurance did a decent job, but as soon as she was off her parent's insurance, we really couldn't afford to keep going back to him. So as a result, years went by where she saw no doctors about her disease. Luckily, out of courtesy her pediatrician keep refilling her prescriptions, but did little to monitor her numbers. Her weight has fluctuated greatly over her 20s and 30s, never once has it affected how I feel about her, but it has made her feel self conscious, disgusted and ultimately depressed. I have watched her practically starve herself to be thin and work her ass off to shed the weight only to have be put back on. \n\n\nWhen she became pregnant a few years back we qualified for state insurance assistance, and we did get her thyroid numbers under control, but I feel like it was too little, too late. \n\n\nMy wife barely eats and she is fairly active. I on the other hand eat like shit, and I'm pretty overweight. (5’11” 250, big frame, muscular) but it's unfairly easy for me to lose weight. If I diet for a month and hit the gym three times a week I can drop 10 to 20lbs with little effort.  Also keep in mind that she has literally perfect blood pressure and near perfect cholesterol numbers. Her blood sugar is normal and she eats fairly healthy compared to me.\n\n\nAnyway, here's the thing; my wife's weight is a direct result of her Hashimoto's disease, and I feel that all these additional symptoms she is experiencing (memory/cognitive issues, weird allergic reactions, hives all over her body, hair loss, weight fluctuation, crazy migraines, sore joints, and constant exhaustion) are signs that things are getting way worse. \n\n\nThe fight came down to me losing it because of this cynicism she demonstrates. Think of my wife as like a curvy April Ludgate from Parks and Rec, it's hilarious at times but can suck when you're trying to deal with real stuff.  A few months back I got my dream job, which includes amazing health insurance for my wife, my son and I. I just assumed that my wife would be eager to find a doctor ASAP and I was wrong.\n\n\nMy wife claimed that most of the doctors she has seen in her life have pretty much have dismissed any of her symptoms and just tell her she just needs to lose weight and she'll feel better. She then went on and explained that many large women, regardless or health are met with the same issues. This obviously made it quite hard for her to want to find a doctor that understands the issues surrounding her disease, when she has had her weight, which again is a result of her disease, thrown in her face.\n\n\nI didn't believe her. \n\n\nAnd she got upset. And she was justified for being mad at me for this, because I honestly thought it was just her dumb teenage like cynicism. I thought she was just making excuses for not getting her health under control. I was wrong. \n\n\nThe fight ended as I was questioning the validity of her obstinance, and she just told me to “do some research about it, I'm going to bed.” \n\n\nSo I did just that, I found this VICE article, along with a ton of other first hand examples and research that explains the bias and discrimination against large women in the medical industry, it's even worse for large women of color. It completely opened my eyes to what my wife had been experiencing. I feel like a bag of shit for not understanding her experience. At some point in the fight I even said “I'm fat too, and I've never experienced this.” Which she replied, “you're a man, it's different.” and I ignore it, and I shouldn't have. \n\n\nSo with all that being said, how do I help my wife find a Doctor that isn't just going to see her as a fat person, but as a sick person in need?\n\n\nTLDR: My wife is chubby because of a disease and could be really sick, but she can't find a doctor who isn't a jerk about her weight. \n\n\n\n\n\n\n", "subreddit": "BodyAcceptance"}
{"post_id": "bag94b", "created_utc": 1554643883, "title": "In need of advice", "author": "420curvyluv", "self_text": "Hi everybody,\n\nI am on a journey to love myself, i've already come a long way in my opinion, but still alot to accomplish...\nI'm in a bodyconfusing period right now, I have a boyfriend for three years now and he adores my body and says it all the time, it really helped me love myself more but... since the beginning of our relationship he looks at tumblr and reddit, scrolling and looking at all the beautiful naked bodies and I never really struggled with it until a few weeks ago...I think i'm beginning to feel my worth and now don't understand it anymore why he has to look at all those perfect bodies, and I really don't have a body likes those girls so I feel extremely insecure about it, is my body not enough for him?\nI am just scared for my relationship, i'm working so hard on my selfimage..\nHe gives me the advice to fake it till I make it, what do you guys think?", "subreddit": "BodyAcceptance"}
{"post_id": "bak27g", "created_utc": 1554665319, "title": "I hate my body. Im the unluckiest boy ever", "author": "TurkceBiliyorMusun", "self_text": "I'm a 15.5 years old Turkish boy. My height is 5'8 (172cm) and i hate it. My cousin is 6'1 when he is 15 and 6'3 now. My grandfathers and my father is 6'2. My 13 y.o sister is 5'7. That means, i am a short guy in a tall family. My 13.5 years old Cousin is taller than me so it was the slightest probablity to be short. Nearly all my friends are taller than me too. I can't focus on my lessons by this reason. ", "subreddit": "BodyAcceptance"}
{"post_id": "bal46j", "created_utc": 1554671086, "title": "Similar Instagram Account to @fashioninflux", "author": "PotamilusAlatus", "self_text": "I follow an instagram account called @fashioninflux. If you arent familiar with it, the account consists of content that are mostly short videos of the ig model trying on clothes. \n\nI really like the content, its entertaining - But it's not great for my self image.\n\nDoes anyone know of any similar social media accounts with women with thicker/fuller bodies? \n\n", "subreddit": "BodyAcceptance"}
{"post_id": "baxats", "created_utc": 1554748162, "title": "Here are some thing you can do to earn yourself ban:", "author": "maybesaydie", "self_text": "&gt;\"kill yourself\" or any permutations thereof\n\n&gt;*landwhale, sow, fat pig, landbeast, hambeast, cow* and any other descriptive and insulting terms used to insult someone's appearance. **We expect civility.**\n\n&gt;Sexism in any form. Homophobia, transphobia, gendered slurs, racism, race bait. Political discussions.\n\n**Seeking out and interacting with people whose comments and posts are featured here is a bannable offense. Linking source material is a bannable offense.**\n\n\n&gt;I was just joking\n\n**Not an acceptable defense.**\n\n**If you are here to find inspiration to continue disordered eating behavior we will ask you to leave.**\n\n\n**We strongly suggest that you access the subreddit rules** from your app if you're not using the desktop site. Each app has a way to access the rules, usually from your list of subreddits. The complete set of rules is in the subreddit wiki. Or follow the rules in the sidebar and you should be fine.\n\n# **TL:dr: If you didn't read this and you catch a ban \"I didn't read  it\" won't be an acceptable defense. Read it.**", "subreddit": "fatlogic"}
{"post_id": "baxblo", "created_utc": 1554748278, "title": "Meta Monday - Sup?", "author": "GetOffMyLawn_", "self_text": "Your beloved mod team has nothing special to convey to you this week, but we know you need a sticky to chat about things. So open forum in here today. Ask questions, post pics, share what you want to share.", "subreddit": "fatlogic"}
{"post_id": "baxgex", "created_utc": 1554748967, "title": "I threw away my full length mirror...", "author": "Satan_Baby_666", "self_text": "... and I feel good about it. I always focus on my flaws when I see my full body reflection. For the past year, I have gotten rid of my full length mirror and just used the bathroom mirror to do my makeup/ make sure there's nothing in my teeth. If I'm not sure how an outfit looks on me I ask my BF, who usually says it's fine, or at most he'll tell me my tag is out. It was tough at first but I honestly feel like it's been a positive effect on my mental health. I certainly spend less time staring at the parts of me I wish I could change, but in reality are just fine. \nHas anyone else tried this?", "subreddit": "BodyAcceptance"}
{"post_id": "bb92tm", "created_utc": 1554822664, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bbebxa", "created_utc": 1554848947, "title": "I made someone cry", "author": "LauraBeth949", "self_text": "I needed to go bra shopping, but I've always been very uncomfortable with even going to those stores - especially when I'm suggested to try things on. I hate mirrors. \n\nAs this employee at Lane Bryant was talking to me, I was doing a lot of my nervous ticks pulling on my hair, not looking at her and she started crying. She said she knew what it felt like to have a bad body image. That people here, on Reddit were helping her. And that she suggested I come on here to maybe help. \n\nSo hi everyone. I guess I'm here on a recommendation. I have a lot of issues with myself. I can't even look at mirrors. I recently had a conversation that made this worse - apparently my parents think I'm going to die. So that resulted in a lot of crying, and lots of ice cream eating.", "subreddit": "BodyAcceptance"}
{"post_id": "bbfu35", "created_utc": 1554857697, "title": "Ongoing struggle with loving myself (21f)", "author": "Rhanji", "self_text": "Hi all, \n\nIve been struggling with body acceptance since age 15, im now 21. Ive been through major weight changes  before, (180 to 135), and i was convinced this would make me happy a few years ago but it didnt. I still felt as though my body wasnt enough, it wasnt curvy enough and i felt like a rectangle. Eventually, i started to gain weight back and i was okay with that at the time. Im at a point now where ive returned to a higher weight above the previous starting weight, and i still feel horribly about my body. I cant bring myself to try and jump through hoops for major weight changes again, because it didnt make me feel better the first time, why waste my time just to not feel better again? I wish that my body were more feminine, the only way i could look the way I would PREFER (curvier) is with plastic surgery, and dont want to nor can afford to go that route. Im stuck. I dont know what to do or what steps to take to be the best me i can. I would appreciate any words of advice or help as to what i could do, thanks. \n\nAlso, important information: \n1. Im getting a breast reduction in june which will hopefully help. My breasts have always been a huge source of insecurity for me\n2. Ive been in and out of therapy for three years or so, typically because of the therapist leaving the office. Currently out of therapy but waiting to be reassigned to a new therapist.", "subreddit": "BodyAcceptance"}
{"post_id": "bbn6i0", "created_utc": 1554909281, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bbyh4d", "created_utc": 1554980235, "title": "Last night a friend made me realize something important about my intense body image issues: I've never before had a self-image based on what FRIENDS value about me... Only awful people. (TW: suicidal thoughts)", "author": "0seagirl", "self_text": "NO WONDER I get caught up in this self-hatred.\n\nDue to my C-PTSD, it's taken me until my 30s to acquire a friendship group. I had this revelation yesterday when I was talking with a friend  to about my issues, that I have literally never, before this, seen myself positively reflected in the eyes of anyone who hasn't been a sexual partner, hasn't objectified me for sexual purposes. \n\nThis is the first time I've felt that my sexual value has no place, but to know that I'm still loved. That to my friends, **it actually seriously doesn't matter what I look like.**\n\nBefore now, my whole self-image was based on the opinions of porn-obsessed ex-boyfriends, and my anorexia nervosa-promoting mother. Not anymore.\n\nI went from such intense self-hatred and thinking suicidal thoughts, to feeling loved... I need to STOP seeing myself through the eyes of people who treated me less than I deserve. So when I say all of these hateful things to myself, it isn't even me saying those things, it's my exes, my mother, my father.. people from my past, cruel people who didn't truly love me or see my real value.\n\nThis feels huge to me and just wanted to share in case there's anyone else out there who has been through or is going through similar things.", "subreddit": "BodyAcceptance"}
{"post_id": "bc10g1", "created_utc": 1554995455, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bc1xjf", "created_utc": 1555000170, "title": "Getting my boobies removed", "author": "marforro", "self_text": "I want to have my breast implants of 15 years removed. I’m almost more embarrassed to admit I want them out than to admit I got them in the first place. The world is so judgy...\n\nAnybody have any experience having them removed or deflated? Did you have reconstructive surgery? If so, what was that like? Did you simply drain them and leave the implants? Did your breasts look saggy? How much did it cost?", "subreddit": "BodyImage"}
{"post_id": "bcep8x", "created_utc": 1555082016, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bcg51u", "created_utc": 1555089422, "title": "Tired of hating myself", "author": "Bottleup3", "self_text": "I just found this sub today. I made a post earlier this morning in r/BodyDysmorphia about how I've been hating my appearance for over 15 years now. Is there anyone here who wouldn’t mind sharing some advice on a more positive body image? All I see when I look at myself (which is almost never cuz I HATE mirrors) is acne craters and disfiguring surgery scars, and I've spent a lot of time in therapy with very little to show for it. I'm 31 and tired of feeling like the ugliest man everywhere I go...\n\nAny advice is appreciated. Thanks.", "subreddit": "BodyAcceptance"}
{"post_id": "bch00i", "created_utc": 1555093634, "title": "I'm almost 20 and I have always struggled with loving my body. PLEASE GIVE ADVICE!", "author": "LilithintheWoods", "self_text": "Hey, everyone. I am currently about 235lbs (the heaviest I have ever been) and am 5'7''. I am struggling so much, as I have my entire life, to love and accept my body. I mostly hate my stomach (lower and upper), the fat on my back, and my hips. I hate the way my thighs look. I honestly don't like a single thing about my body. Yes, I have people compliment me and I am pretty sure my boyfriend is not bothered by the way I look, but there are some days I look in the mirror and I just want to rip the fat off my body. Sometimes, I want to starve myself or I just wish that I wasn't in this body that I find disgusting.\n\n&amp;#x200B;\n\nI have no idea how to love myself and accept myself. Could someone PLEASE give me some tips? This is really hurting my self-esteem, depression, and anxiety.", "subreddit": "BodyAcceptance"}
{"post_id": "bcikfe", "created_utc": 1555101722, "title": "From My Little Sister", "author": "BiBitchXx", "self_text": "“ I like conky (chubby) things cuz you know they been looked after’ \n\nJust for anyone who needs that little boost, an eight year old thinks you’re cute &lt;3", "subreddit": "BodyAcceptance"}
{"post_id": "bcj9w9", "created_utc": 1555105601, "title": "how to deal with toxic comments?", "author": "avoocaadoo_toast", "self_text": "Especially from your family? The body standards in my country is unreal and ive been compared to my sister and cousins my whole life (im 21). The worst experience is when my grandmother asked my niece if she wants to be like me when she grows up (she was lecturing her on eating). “Do you want to look like her?” And she said no. That broke me. I am not actually that big... I hate taking body pics because ive always thought i looked hideous but the rare pictures i have from a year ago made me cry. Because I wasnt even fat. But ive been called fat since i was a kid.", "subreddit": "BodyAcceptance"}
{"post_id": "bclkfh", "created_utc": 1555119788, "title": "We are all beautiful", "author": "pmmeroadcones", "self_text": "I am and always have been self-conscious about my body. I am heavier than society has told me to be, I have freckled pale skin and insanely curly red hair. I have always seen myself as being ugly because I don’t look like the girls in school. \nBut I went out of my comfort zone today and went to the beach. I stressed about what to wear and was very nervous about going alone. But I went and who would’ve thought, I didn’t hate it. I soon realized that it didn’t matter what I looked like. I realized that we are all just being ourselves and that our differences make us beautiful. I don’t need to be shy or self-conscious because it doesn’t matter what a few shallow people think of me, I am who I am and that’s all that matters. We are all beautiful because of our differences. \nFor me, the beach was a really good reminder that you can look however you want and be proud of it. I want to thank all those heavier beautiful women out there today for reminding me that beauty is not just being a skinny blonde with golden skin. But rather beauty is whatever you make it. \nI know this takes time, but these small steps will lead to an amazing place for me where I can be happy and confident in my own skin.", "subreddit": "BodyAcceptance"}
{"post_id": "bcrg3p", "created_utc": 1555168173, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bd04q2", "created_utc": 1555224074, "title": "I wish I had smaller breasts", "author": "gorgeousmountaingirl", "self_text": "Now, don't get me wrong, I love being a little bit larger than the average woman. I'm not asking for itty bitty A cups, but maybe a 34DD or D. I'm a 36DDD, and, as you can imagine, it's not the best. Big boobs, small boobs, all are wonderful, but I don't want to have to buy granny bras everytime I go shopping. I want to be able to not shop in the Plus size department to find a shirt that fits. I saw a 34DD today and I was like \"woah, I WISH I could fit in that!\" My breasts awkwardly stick out, and not in a cute or sexy way. They're westies and are very far apart, and so far I haven't been able to find a nice bra that pushes them in and lifts. When I was still growing it was SO EASY to find a cute outfit. I spent the last year in baggy t shirts because I look so weird in normal clothes. I'm working out so I can hopefully drop a cup size, but MAN, I am not a fan of the massive mountains!", "subreddit": "BodyAcceptance"}
{"post_id": "bd71fl", "created_utc": 1555272956, "title": "Please stop posting pics of fat people. Especially that Shake My Beauty thing. TY.", "author": "GetOffMyLawn_", "self_text": "We've never allowed posting of fat people simply because they are fat. Recently we've restricted to not posting pics of fat people at all. We're not here to shame people's bodies or gawk at them. \n\nIf you do post a pic we will remove it. We have removed the lymphadema post at least half a dozen times now. Please don't post it again.", "subreddit": "fatlogic"}
{"post_id": "bd8kfn", "created_utc": 1555281198, "title": "Is having body hair a bad thing?", "author": "Dextez11", "self_text": "Discuss. Is this really a bad thing? Whether you're male or female, if your having sex,sex is sex right? Does that sort of thing really bother ppl? Or is it only a select handful of ppl? What's your opinion on the subject?\n\nAnd I mean pube hair, butt hair, armpits, etc.", "subreddit": "BodyAcceptance"}
{"post_id": "bdhjqm", "created_utc": 1555343377, "title": "I figured out that my IBS is screwing with my body image", "author": "protodro", "self_text": "Sometimes when I look at my belly I feel like it looks huge. Other times I feel like it's only a bit chubby, not enormous. I kept wondering what was causing it to change all the time: Was it the lighting, angle, posture? Was it really bad body dysmorphia on-and-off? Was it water weight/weight fluctuation?\n\nI don't understand why I didn't put two-and-two together sooner. My IBS makes my stomach swell. When I wake up I have almost no IBS symptoms because I've been fasting overnight. Then after a day of eating it sets off my IBS and my stomach fills up with gas, making it look about twice the size it actually is. Some days are much worse than others for my IBS and those are the days I feel worst about my body.\n\nI know it would be best to try to accept my belly even if it really is that big all the time, but understanding what's causing the seemingly drastic changes is really helpful and a good foundation for accepting my body all the time, not just when I've first woken up.\n\nI just thought I would share this here in case any other people with IBS find it helpful.", "subreddit": "BodyAcceptance"}
{"post_id": "bdrk3v", "created_utc": 1555404081, "title": "If You Can't Beat Him ...", "author": "HeartlessImaginings", "self_text": "It's probably because he's busy beating his on his own, without you. I guess it's time I join the rest of humanity in getting emotional and sexual needs fulfilled online rather than bothering my mate when he's busy. \n\nHe had a post on this group, but it was rejected. I saw it a couple weeks ago, but don't know what his write up was. I wish I did. I have a notion that understanding might help me cope, or change. However, I'm not much of a confidant either. \n\nNone of this is new to me. I have always been open to swinging. Hoping it could help me make meaningful friendships with women. Also hoping it would foster total honesty and transparency in all relationships.\n\nIt does neither. However, I refuse monogamy. It's a pathway to feeling unfulfilled, yet staying together out of obligation. \n\nIt never brings out the best in anyone. I love him, and I love to see him feeling his Swagger. He only shines that bright when there are fun friends with us. \n\nI've given him an open door to pursue side pussy, but he won't go without me. \n\n I know having his woman with him is cock blocking him. So many women I figure would gladly cheat with him, but they think it's weird that we wish to do things together. Even the hooker backed out of the discussed arrangement. \n\nMen who have spent time with us have totally tried getting me to sneak around, and I won't. Their attention doesn't satisfy anything for me. He is more jealous than I am. The men like to lie to us both. They are more trouble than I need.\n\nHe openly refuses to even get a massage without me, even though his need for attention from other women is such that it pains me to see him feeling rejected and low. We have had a difficult year.  I wish that I could create the golden feeling inside him, but I'm just too goddamn stable and boring. I'm what he needs, but as usual, I'm not what he wants.\n\nI've never been able to keep men interested for long unless I refused to be their woman. This was especially true if I refused to fuck them at all. My only power is to be their fox to hunt. Once caught, I am worth less and less. \n\nI'm not 16 though. I'm a grown woman who thinks the tendency men have to lose interest and need attention elsewhere is unfair. The more we connect, the greater my desire for him. But when I see him becoming distant, giving his thoughts and feelings to others while becoming cross with me, I fall behind and pull away myself.\n\nHe wants me to be the initiator, and has all but ceased to get things started, so our once very active and interesting sex life has become occasional.   He is often distant and distracted. I know he hides conversations from me. I don't know for certain that he's having interactive masterbation, but I see plenty of evidence that it's happening. He once adamantly denied such things. Now he gets snappy when I ask about his day.\n\nIf I come home hoping he's in a sex mood, he sometimes acts like, for him, the mood has passed.  He doesn't always join me when I masterbate. \n\nI am beginning to feel like I should give up on sex again. Give up on myself. There are too many things I'm naive and insecure about, and I'm too old to bother with. \n\nHe had nearly healed those thoughts from me. But facts are facts. Every man I've given love and time to has done this, most being much worse.  For some reason I'm the girl they want to live with, but not the girl who truly excites and fulfills them.\n\nSo, rather than giving in to hopelessness and destroying my last chance at being loved, maybe it's time I followed suit. Maybe I can learn to be less depressed, and not feel so left out. \n\nI can have secret sex friends too, right. Maybe I can find a friend who helps me feel less inhibited. Maybe I can even find a woman friend who is more dominant. \n\nMaybe she will teach me to be more dominant with him, and maybe that will help him be more fulfilled. \n\nOr maybe I'll just keep it all a fucking secret. Delete messages. Get snippy when asked about photos. Seem too grumpy for sex, but come back a few hours later with a spring in my step that he didn't put there.\n\nTalk about sex I plan for that afternoon, but then appear indifferent to the notion. While being indifferent, I'll be sure to talk about great sex in my past, and look at porn, but make no overture towards my mate. \n\nWho am I fooling? I'll do what I always do. Patiently wait for him to need me, wishing I was his whore instead of his wife. \n\nIt's the whores who get their best. The good woman is what he keeps, but the whore is what's on his mind. \n\nSo is the idea that I have to be his good woman, but someone else's whore, in order to fit in? I know it's just cybering. I've always regarded any deception as cheating, and taking attention away from my mate seems wrong. \n\nHis post on this Reddit tells me that this is normal and he shouldn't have any issue with it at all.", "subreddit": "BodyImage"}
{"post_id": "bdt24i", "created_utc": 1555415879, "title": "How can I learn to focus on health and accept having a curvy figure instead of societies expectations?", "author": "JustAnotherOneThen", "self_text": "Hi, long story short I'm F 20 and I've always had a slightly chubbier body than most girls my age. Previously I was obese and lost significant weight unhealthily which led to my body dysmorphia. My body type is a genuine hourglass figure which is probably the only thing I like about it. However, as I live on campus as uni and there are so many thin, athletic girls around me and not as many girls with my type of body I find it difficult to not compare myself to them.\n\nI'm at a healthy BMI weight but I still feel so inadequate. The problem is I KNOW that that isn't true, but I still feel it. I know that I don't view others on their body type but for who they are. I just want to learn how to accept the body that I am in so I stop trying to change it drastically and start trying to accommodate for it. I'm so tired of having this constant battle of wanting to look different and wanting to accept the way I am. I want to focus on my health but I don't know how to deal  with the constant battle in my head about the way I look.", "subreddit": "BodyAcceptance"}
{"post_id": "bdtxc3", "created_utc": 1555421156, "title": "I'm having trouble with body acceptance", "author": "MommysLilCinnamonBun", "self_text": "I'm a young dude, only 15, and I've been diagnosed with a liver problem called non alcoholic fatty liver disease. I was always a pudgy kid, over 10 pounds when I was born, but when I got that diagnosis I was told I had to lose weight and that I was basically just too large. Since then my BMI has went down, I work out daily, and my liver isn't of much concern anymore but I'm still pretty chubby. I make comments with friends about how I'm beautiful, I'm the sexiest man in town, things of that nature but I have trouble believing it. I have no problem looking someone in the eye and saying weight isn't a problem, fat isn't bad, and over all letting them know their weight is fine but I have trouble carrying it over to myself.... I'd appreciate any help or advice you can give, thank you.", "subreddit": "BodyAcceptance"}
{"post_id": "bdv1le", "created_utc": 1555427448, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bdzp8q", "created_utc": 1555451359, "title": "Felt GREAT about my body - and then this happened", "author": "psychoweeb", "self_text": "((Please note that I have an eating disorder, it is relevant to this story))\nI got a new article of clothing. One of those jumpsuit/playsuit things that I’ve always been afraid to wear since it shows my legs. I looked GREAT and I felt amazing and I was so happy. I decided to show my mom and she was so happy and said “you look so skinny! I can tell that you’ve lost weight on your stomach!”\n\nIt ruined basically everything, and she knows I have an eating disorder, but I saw that she looked so happy bc I looked skinny and now I don’t know how to feel or what to do.. I want to be skinnier, and make her happy. Ugh.", "subreddit": "BodyAcceptance"}
{"post_id": "be8yt9", "created_utc": 1555514049, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bee1h2", "created_utc": 1555540515, "title": "Many people from weight loss subs show symptoms of disordered eating", "author": "Frostedeyes", "self_text": "Signs and Symptoms of Disordered Eating\n\nSymptoms of disordered eating may include behavior commonly associated with eating disorders, such as food restriction, binge eating, purging (via self induced vomiting or excessive exercise, and use of diet pills and/ or laxatives).  However, disordered eating might also include:\n\nSelf worth or self esteem based highly or even exclusively on body shape and weight\nA disturbance in the way one experiences their body i.e. a person who falls in a healthy weight range, but continues to feel that they are overweight\nExcessive or rigid exercise routine\nObsessive calorie counting\nAnxiety about certain foods or food groups\nA rigid approach to eating, such as only eating certain foods, inflexible meal times, refusal to eat in restaurants or outside of one’s own home\n\nMany people think that preoccupation with one’s body is necessary or even crucial in order to achieve weight loss, but this can’t be further from the truth. Some people from forums that promote weight loss are already healthy and have no problems other than being unhappy or anxiety issues with a certain number on the scale. Some weigh themselves multiple times a day, encourage people to snack on “low cal” food as a way to ineffectively starve off hunger. They promote a disconnection with one’s body, and strive to be tiny. Anyone who thinks differently from them, doesn’t obsess over the scale, doesn’t calorie count, doesn’t meal prep, is going to end up “morbidly obese”. \n\nMy aim is to spread awareness on how even weight loss forums and subs can hinder you on your journey to body acceptance. Don’t fall for their shaming tactics, their “low cal” snacks, their aim to disconnect you from your body. In fact, within forums that promote weight loss, many of its people come back a few months, a few years later having had put all the weight back on. Isn’t it time to get away from the merry-go-round?", "subreddit": "BodyAcceptance"}
{"post_id": "befld9", "created_utc": 1555549845, "title": "I would give anything fo have a normal foot", "author": "maddiokii", "self_text": "Hey guys just needed some place to come and rant to... Everyday I feel the same emotions regarding my foot and body. Hate, regret, embarassment. I was born and grew up with two normal feet and a normal slim body but two years ago I had a really bad accident and shattered my left foot and fractured some other things. Well now my foot has healed and it's really big and deformed compared to my normal right one. Not just that but I experience pain daily in it and it'll never be like my normal right one. I also have a bent knee all the time when standing, one of my legs is longer than the other, and my belly is now fat. I'm just wondering if anyone else has developed a deformity or had an accident that changed their body? How did you learn to accept your new body or do you still not like it and will never learn to accept it? Its been such a battle for me to see my new body everyday in the mirror and realize it will always be this way and I can't do anything to change it...", "subreddit": "BodyAcceptance"}
{"post_id": "beiwpd", "created_utc": 1555574263, "title": "Do we have a meta tab? Or somewhere to post musings on fat-logicy behaviour?", "author": "Hookton", "self_text": "I have a minor (sometimes major) rant growing in my head about certain subsets of fat-logic culture and my reaction to them, but I don't think it's appropriate to post here as it's not a reaction to a specific post/image/comment but more a reaction to the whole hivemind movement.", "subreddit": "fatlogic"}
{"post_id": "belaxk", "created_utc": 1555592618, "title": "I hate my breasts", "author": "Deletedcamel", "self_text": "I hate my breasts. They are a D/E cup, but they are not perky at all. I lost a lot of weight due to an eating disorder, then gained a lot in a short period of time, and then lost some weight again. I am at a healthy weight right now, and am quite happy with the rest of my body. But because of this weight gain/loss my boobs are quite saggy. And I hate it so much. \nEvery girl my age (18) has these beautiful breasts, and what hurts me the most is that I could’ve had that too, but I fucked up BIG TIME. And now I just don’t see anyway to feel comfortable with my body. I feel so unattractive, and it bothers me so much during sex. \nI am considering plastic surgery, but I want to stay true to myself too. Which causes quite a complex problem for me. \nI feel like guys (including my boyfriend) would find them very unattractive. I just hate it so much. It takes away so much happiness. It makes me agressive, and makes me cry.", "subreddit": "BodyAcceptance"}
{"post_id": "bem4vg", "created_utc": 1555597356, "title": "im(25 f) insecure and beleive clothes only look good on thin girls", "author": "s4dqu6l", "self_text": "i really like fashion, and love to dress cute but also differently (i dunno people around me say i dress hipster ???) besides the point. i was out with a friend last night at a club and she was wearing a bralette and high rise jeans with a sheer shirt on top so you could see her figure. and i thought to myself, wow if i wore that id look like a whale.   \n\n\nso the entire night i just felt really gross and inseucre because im so much bigger than her. and i find that this mindset really ruins my days because ill dwell on my body for like 6 hours straight and be late to things because i feel like everything looks gross on me.   \n\n\ni feel like smaller frames that clothes can just drape off off, look nicer in clothes, and i have to try really hard to look good in anything. i have thic thighs and curves and i wish i had no shape basically.   \n\n\n&amp;amp;#x200B;", "subreddit": "BodyImage"}
{"post_id": "bempnx", "created_utc": 1555600402, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bemt00", "created_utc": 1555600868, "title": "Hello any tips on how to be ok with not having a thigh gap?", "author": "autumnsnowflake_", "self_text": "1. I hate the chaffing in summer because of which I rarely wear a skirt 2. I feel like I’m not thin enough although I’m at a healthy weight for my height. \nIt’s playing with my emotions :/ \nMaybe it’s a confidence issue as well cause I don’t feel beautiful overall..", "subreddit": "BodyAcceptance"}
{"post_id": "bevplh", "created_utc": 1555652777, "title": "Heavy married men, did insecurity about your body affect intimacy with you SO? If so, how’s that now?", "author": "[deleted]", "self_text": "So I’ve had a massive 88lbs increase in weight over the years. I have graduated from feeling secure and loving my body to now being very insecure and uncomfortable with it. So much so that it has affected intimacy bw my wife and I. \n\nI’m conscious when she touches my chest (manboobs) and gut area as well as other “areas” which have been detrimentally impacted due to the fat all around it. :/ \n\nShe repeatedly tells me that all of this doesn’t affect her attraction towards me in any manner and that it’s my barrier not hers. I know that on an intellectual level, but all of the above have reduced my drive to be intimate and if we are, then I’m super conscious and am always redirecting her to other comfortable areas (shoulder, etc.) \n\nHave any of you guys suffered shit like this? And if so I’d love to hear your story. Basically need someone to share this with.", "subreddit": "BodyAcceptance"}
{"post_id": "bex1rd", "created_utc": 1555664835, "title": "First step towards self acceptance.", "author": "ImDatingMyBed", "self_text": "Today is the day where I have decided that the mindset of hating my weight and waist size is just not a good one to have. So today is the day I start on my journey to accepting my body as it is.", "subreddit": "BodyAcceptance"}
{"post_id": "bf08sx", "created_utc": 1555686814, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bfd6j9", "created_utc": 1555773026, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bfgn2b", "created_utc": 1555791772, "title": "Teach your children to love themselves.", "author": "commaoxford", "self_text": "Two young kids, between 7-10 years old, behind me in line at Pielogy with their dad. The young boy points out how many calories are in the pizza he wants to order, the little girl says she doesn’t want to get fat and touches her stomach. The dad says it’s ok because they’re both only going to eat half. \n\nPlease, we need to be conscious of how we talk about our bodies around our children. We need to help them have a healthy relationship with food. I’m still so shocked and saddened to have overheard this conversation. Be kind to yourself, to your body, and teach your kids the same. Food is fuel.", "subreddit": "BodyAcceptance"}
{"post_id": "bfpn4d", "created_utc": 1555858630, "title": "Parents Insist I Lose Weight", "author": "MrsGohanSon", "self_text": "TL;DR: My parents are constantly on me about losing weight, but I just don't feel like its a priority in my life. How do I accept my body when I know how much my parents judge me for it? Am I wrong to so stubbornly refuse to prioritize weight loss? \n\nSo I'm 25F and currently living at home with my parents (my job is so close to home that it just made sense, and culturally its expected for women). They are always on me about my weight, especially now as they want me to get married soon. I'm overweight for sure (probably like 10lbs), but I eat alright and play sports competitively on a weekly basis. Practice 1-3 times a week.\n\nMy relationship with them is good *except* for when the topic of weight is brought up. They're always on me about losing 10lbs. When I do lose 10lbs, then it's \"keep going; you'd look so much better after another 10lbs\" etc. I struggled with an eating disorder in high school, but they always point to pictures of me at that time to say \"see you looked so good back then. You have the capability you just aren't motivated or disciplined like you used to be\". They do say I don't need to go as extreme as that (back then my mom would comment on how my chest would get too small if I kept dieting and exercising the way I was), but that I should try to bring some of that back.\n\nAfter my brother's wedding last year, my mom yelled at me the worst shes ever done on my birthday about how fat I looked in the pictures and how embarrassed she was when people commented on my back rolls (wore a sari which exposes the midriff). At the wedding I felt so beautiful as I had been working out regularly and was so excited at the occasion and outfits, but now I can't look at the pictures without feeling sick.\n\nAnyway, last night she and my dad were leaving to a party and right as they were she told me to make sure I exercised while they were out because they'd like me to lose 10lbs before their friends come in May. They're interested in my marrying the son of that family. I've never met him, but I like their family and would be open to the match. However, I told them that I'd rather they see and accept me as I am because I'd probably be at this weight after marriage even if I lose weight now. There was a quick back and forth about how I can't find a good match looking the way I do, etc. How they just want me to be my best so they can find the best guy for me. \n\nI guess I don't really know what I'm asking here. I just feel really sad and down. I want to love my body for what it is, but I hate that the people I love most in this world see me the way they do. I don't want to spend more of my free time exercising than I already do, and I really don't care to cut out any more foods. Losing 10-20lbs would probably help fix our family dynamic, but I just can't bring myself to prioritize that. I don't know what a good middle ground is. I don't know how to feel or if im justified in what I'm doing.", "subreddit": "BodyAcceptance"}
{"post_id": "bfw7xy", "created_utc": 1555896152, "title": "I've Come A Long Way from the Eating Disorder Days", "author": "fitgeek69", "self_text": "Today I looked in the mirror and realized how much muscle I've gained, and for the first time since I've started gaining, I don't mind it. What a liberating feeling, so liberating that it wasn't a big deal to me at all but I'm celebrating this as a win.\n\n&amp;#x200B;\n\nIt's been 2.5 months since I've started consistently working out for the first time in my life. I just wanted to be healthy and get to know my body for once. I didn't expect the order of which I gained and lost weight/fat/muscle. It was a pretty difficult adjustment for me.\n\n&amp;#x200B;\n\nI have struggled with an eating disorder for 5 years in the past. I would say I am 1-2 years recovered, it's hard to say when I \"fully recovered\" because I feel like recovery is a lifelong process but there was definitely a period where I felt my body heal significantly from my ED. I've always been naturally skinny but when I developed my ED to me I noticed I gained a bit of weight, about 10-15 pounds from water weight I'm assuming. I also was a competitive swimmer at the time and it was the first time I put on a lot of muscle. I looked \"healthier\" for the first time in my life my family said. Little did they know I was overexercising myself everyday and struggled to eat \"normally\". It's just been such a long journey with many low points that I have a hard time recalling because I've never healed my eating disorder with the help of a professional. My god did I have such shame talking about this with doctors, therapists, and nutritionists. I felt like nobody took me seriously because I \"looked\" fine.\n\n&amp;#x200B;\n\nI talked to my doctor on the phone today and he reminded me that I have gained 15 pounds since about a year ago. Yet, my clothes size has gotten quite tinier. I used to be a small-medium now I am an xxs to x-small. I've definitely struggled with body dysmorphia and not understanding my new body but the past 2 weeks it's felt good. I don't hate my thickness. I'm so accepting that my body is constantly changing. I might not like the way I look, but it doesn't emotionally leave me drained like it had before. I would like to change my body. I still wish to be skinnier, less muscular in some parts but I am okay with myself now. I don't calorie restrict anymore and eat a very balanced diet. I worry all the time if I am feeding myself enough/properly but I don't change anything about what I'm doing because when I think about how I'm living my life I'm doing just fine. I am so aggressively kind to myself now as opposed to how mean I used to be telling myself I didn't deserve to eat. I always just want the best for my health. If I am unhappy about the way I look, I want to change it in a healthy and sustainable manner but also most importantly accept whatever form healthy looks and feels like for ME. Yay to liberation and goodbye to restriction!", "subreddit": "BodyAcceptance"}
{"post_id": "bfxp9j", "created_utc": 1555905637, "title": "Pushed myself out of my comfort zone and won!", "author": "MadamPotpourri", "self_text": "Had a huge breakthrough today! Yesterday, I was concerned about going to an Easter party because I knew it might be triggery to be around a group of women that I found physically intimidating. My husband, who has been absolutely indispensable throughout my years-long battle to love myself, even offered to have us sit it out since he knew I was going through a bad patch. It was really generous because it was his friend having the event, and I knew they hadn’t seen each other in a while. \n\nI put on my big girl panties and declared to him (but most myself) that I wasn’t going to allow these feelings to make me into a hermit and rob me of potential fun. \n\nI’m so glad I went! Even though the women were as beautiful as I’d remembered, I had a great time, did not judge them or myself, and just.... lived.", "subreddit": "BodyAcceptance"}
{"post_id": "bfyu19", "created_utc": 1555914572, "title": "Need help dealing with experiences from Fat camps", "author": "CookingPapa23", "self_text": "Obvious Weight Loss Content warning here \n\n&amp;#x200B;\n\nThroughout my growing up I've been forced into  weight loss camps which has left me with PTSD, anxiety and disordered eating. Currently, my family is considering sending one of their kids to another camp to \"lose weight before it gets too far\". I'm doing my best to try and protect the child by stopping it from happening, however i find the whole conversation immensely triggering and frustrating.  It doesn't help that they all look at me like i'm the giant fat failure that they're trying to avoid with this child - we're all a big family, but i'm on the larger side. What are your experiences with fat camps and how do you cope?  How can i deal with this", "subreddit": "BodyAcceptance"}
{"post_id": "bg06jx", "created_utc": 1555926386, "title": "I like my stretch marks, but i get self conscious about touching them in front of lovers", "author": "bitprivate", "self_text": "I like touching my stretchmarks (on my inner thigh, somehow got away with not having them anywhere else) and when im in the buff and relaxed, thats where my hand usually is, just stroking the marks. They feel really cool, just smooth and bumpy.\n\nI used to call my mums stretchmarks tiger stripes, hoping if i ever have kids mine look as cool as hers did haha\n\nBut when im with someone i get self conscious that theyre going to see them and not like them.\n\nIve got pimples everywhere and i dont care if a guy sees them, but apparently the stretchmarks (which i like! I hate my pimples) are an issue.\n\nNobody has ever picked on them, i guess ive just seen more stuff about guys not liking stretchmarks than i have guys not liking spots haha\n\nAny advice how i can get over this?", "subreddit": "BodyAcceptance"}
{"post_id": "bg2twa", "created_utc": 1555943810, "title": "r/fatlogic selfie post!", "author": "maybesaydie", "self_text": "Today's the day to post your selfies and progress pictures. Please, no pictures of children.", "subreddit": "fatlogic"}
{"post_id": "bghhvu", "created_utc": 1556032222, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bgjxdh", "created_utc": 1556044457, "title": "Sometimes i need a reminder that disabled people are beautiful too, if you're reading this you're beautiful.", "author": "sadieandapollo", "self_text": "I'm 17 (f) with a genetic disorder called Ehlers-Danlos Syndrome and commorbid conditions aswell, because of these I've lost the body i used to have and have been struggling mentally. These conditions makes me experience joint hypermobilty, dislocations, fainting, chronic pain, fatuige, allergic reactions and vomiting on a daily basis. I use a wheelchair, mask and service dog because of this, I'm also getting a feeding tube and Port-a-cath relatively soon and I've been struggling so much with the idea of \"looking\" sick. I get alot of \"you're too pretty to be that sick/disabled\" and \"you're too young to be sick\" comments which i know are just abelism but at the same time it makes me feel awful about needing MORE medical equipment to survive because i want to be pretty/sexy/etc. Thanks to a couple instagrammers I've realised that medical equipment doesn't change how beautiful you are and you can be/still are just as gorgeous with it.  So incase anybody needs this; YOU are gorgeous no matter you're medical equipment, disabilities, etc.", "subreddit": "BodyAcceptance"}
{"post_id": "bgm5y3", "created_utc": 1556055859, "title": "Wide shoulders, small head, short neck. nothing looks good", "author": "SadElvenMermaid", "self_text": "wear your hair down to make a small head look bigger on wide shoulders, they say.    \n\n\nwear your hair up to make your neck look longer.    \n\n\nif i wear my hair down, my neck disappears.  if i wear my hair up, my head looks tiny and my shoulders huge.   I can't win.    \n\n\nand that's just the top of my body, it gets worse the rest of the way down.     \n\n\ni know some people eschew the \"wear this for this body type\" stuff because it promotes self-criticism, but i just dont feel comfortable with my body no matter what i do.  it just feels uncomfortable.  too lanky, too big, too etc.", "subreddit": "BodyAcceptance"}
{"post_id": "bgphdr", "created_utc": 1556074703, "title": "(TW: Possibly disordered eating behaviours) I am tired.", "author": "smoothies_slave", "self_text": "I have lost 12 kilograms in 5 weeks.\nMy intake is horrible, my exercise routine crazy, and my mind massively fucked up.\nI am overweight. And everyone is praising me for my weight loss.\nI tried to talk to my mother about how anxious I am over food, and she scolds me.\nI am tired.\n\nNo one really thinks that fat people couuld have restrictive behaviours.", "subreddit": "BodyAcceptance"}
{"post_id": "bgsop6", "created_utc": 1556099507, "title": "My head looks like it doesn’t belong on my body...(F15)", "author": "JaredIsNotOkay", "self_text": "So I wouldn’t say I’m overweight nor would I call myself skinny. I’m pretty average being 55kg and 5’4, however my chest and shoulders look enormous on me, making my head and bottom half noticeably smaller proportioned. \n\n(When I say chest I dont mean boobs, I mean the entire upper part of my body)\n  \nIt sucks because when I look facing the mirror I look huge and overweight since my build is so stocky and wide but when i turn to the side my waist and stomach is actually pretty small. Before I hit puberty I was tall and gangly and very skinny even though I ate shit tons of junk food, now however Im shorter than most of my peers and very stocky...I dont know how this happened. \n\nI eat really healthy, at least in my opinion, and go to the gym as often as possible and Ive lost so much weight in the past 2 years since I’d gained it but I still look stocky and fat even if I have more bone and muscle than fat. It also doesnt help that my neck is extremely short (and it used to be quite long...)\n\nIs there anything I can do to look more petite in size and taller in height??  Will my body continue to change or am I stuck like this?? I hate how puberty’s hit me, I look more masculine then feminine and It makes me incredibly self conscious. I know we should embrace ourselves but I at least want to feel good about my body and it wont happen with man shoulders and a wide set bone structure.", "subreddit": "BodyAcceptance"}
{"post_id": "bgvsal", "created_utc": 1556118704, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bh428t", "created_utc": 1556163751, "title": "Terrified of being fat and ugly", "author": "likerealizingthingss", "self_text": "I know that sounds so shallow and I also am aware there’s more than just outer beauty. It’s strange because I put zero effort into my appearance but I’m always worried if people think I’m pretty or not. I really pinpoint my breasts and my bum, I wish they were bigger. I used to hate my big ethnic nose but I’ve become used to it now. How can I love myself and get rid of this fear that my looks are the most important thing? I feel like as girls we have pressure to look perfect but not to my extreme. Sometimes these toxic thoughts can consume me. Is this normal?", "subreddit": "BodyImage"}
{"post_id": "bh4ga1", "created_utc": 1556166437, "title": "Objectively I'm skinny. But I'm so personally disgusted by the body under my clothes (tw ED history).", "author": "bexyrex", "self_text": "I have the misfortune of inheriting the body shape of the woman who abused me my whole childhood. I also own an oppressed queer and dark skinned body. Objectively I'm skinny which is supposedly \"desirable\". And I've never been over weight in my entire life. But I've struggled with my body image and eating disorders since age 13 (24 now). 13-19 was a horrid hell of severe anorexia and bulimia, 19-23 was three blissful ED free years with a plain \"ignore the body and it doesn't exist\" attitude.  And then a recent relapse that I managed to crawl out of with some hefty mental health support. \n\nAnd I'm trying so hard with my body. I really am. I have come to accept almost every part (seriously a lot of this body is actually pretty okay and useful and sometimes hella cute)  EXCEPT MY FUCKING STOMACH.\n\n I'm having a bad day today. I went for a good run after a delicious meal and I took my clothes off to shower and I was just so bloated and huge. My stomach expanded so many inches beyond my hips. Like the peak of a pregnant belly. And I know that I can't change how I carry my body weight but sometimes I look in the mirror and I just see a CREATURE. Spindly arms, cute ham thighs , weird half saggy half perky breasts and this grotesque belly hanging from thin ribs. I feel like a sausage with extra meat parts. \n\nI tried to use my \"bellies are for kissing and cuddling\" mantra today. But it's just not cutting it. My belly is a disgrace.\n\nToday I have great disgust for myself. And I guess that's just what it is sometimes. I can't let the ED wake up again, it basically lives to kill me and ruin my life lol. So I just gotta be COMFORTABLE with this discomfort (or so my therapist says). Thanks... I hate it.", "subreddit": "BodyAcceptance"}
{"post_id": "bh9rj8", "created_utc": 1556205063, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bhezug", "created_utc": 1556232391, "title": "Boxers with enclosed waistband for fat guys", "author": "zombiecmh", "self_text": "Long shot, but hopefully I can strike oil. I always used to wear fruit of the loom boxers with that fabric enclosed elastic band (keeps it from digging into my gut).   \nI can’t find anything in 4x. Does anyone have any suggestions? Brand isn’t as important as the waistband", "subreddit": "BodyAcceptance"}
{"post_id": "bhh0mo", "created_utc": 1556244883, "title": "Body Positivity instagrams to follow??", "author": "ecarver14", "self_text": "I’m looking for pages to follow that will fill my timeline with more inspirational, body acceptance messages instead of being bombarded by images that make me feel shitty about myself! Any suggestions??", "subreddit": "BodyAcceptance"}
{"post_id": "bhlvns", "created_utc": 1556282900, "title": "I like my brain, yet hate my body (possible TW)", "author": "SteamPoweredOwl", "self_text": "Late twenties female, 5ft 2in (157cm), 10st 5lb (147lb, 66.7 kg).\n\nI've been short and round for as long as I can remember, apart from one brief period where I dieted and got down to 8st 13lb (125lb, 56.7kg) but simply couldn't maintain it. Even then, I still had my stocky squishy build.\n\nWithout wishing to sound arrogant, I consider myself a fairly intelligent person. I'm university educated. I like history, literature, and cultural things in general. I believe I can have meaningful conversations... and I have a man who loves me. I also like long walks and generally fit in my 10,000 steps a day. \n\nAnd yet, I utterly hate myself because of how I look. Not really the height, just the weight. I want to be skinny with a nice flat tummy (I loathe my belly in particular)... even though I know logically, given my height, it would be dangerous to alter my diet to the extent needed to get this result, or else I'd have to exercise excessively, which would be equally bad. I'm also paranoid that others think I'm fat and ugly, my partner included.\n\nI'm desperate to break this cycle of self-hatred before I turn 30, but I just don't know how to do it. \n\n(Just to add, I also have a diagnosed anxiety disorder that is being medically treated, so it's odds on I'll always worry about something or other, but I feel cracking this tough nut would help me a lot.)", "subreddit": "BodyAcceptance"}
{"post_id": "bhnfht", "created_utc": 1556291641, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bhzznt", "created_utc": 1556377792, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bi63xy", "created_utc": 1556415040, "title": "I feel like I’m constantly thinking about my body and the way it looks", "author": "_fuck_u_2", "self_text": "I feel like I don’t like my body and I’m obsessing over how much I eat and what to eat and I’m always looking in the mirror to see if my stomach is bloated or big looking and I hate when I feel bloated I feel disgusting but I always love food and it’s exhausting ugh it’s hard to accept my own body :/", "subreddit": "BodyAcceptance"}
{"post_id": "bial9i", "created_utc": 1556453338, "title": "Want to insult me? ... Weight comments here we come!", "author": "unidentified_pancake", "self_text": "I go to a school where there is a VERY small population of people who are on the heavier side, I wouldn't call this a daily thing as of this school year, but over the summer between 10th and 11th grade all people seem to notice as soon as they see me is that I have a bit of a gut. Without the input of others telling me that I am this \"morbidly obese/fat/overweight beast\" I would consider myself  a bit heavier than average perhaps a bit chubby looking (70kg,165cm) , despite losing about 10kg and my school uniform being visibly baggy , the go to insult is \"You're fat/ overweight/ eat too much\". Yes I try to eat well and exercise for health (to keep sugar, cholesterol and vitamins in check) rather than looks, and I do tend to gain muscle easily contributing to my weight/bulk.\n\nA few of the more recent instances being:\n\nI had a \"friend\" whose go to comment was \"no she's ugly/fat\" (Kicked that one out of my life ASAP)\n\n\\-A random man at a coffee shop looking at me and telling me \"You should lose weight\"\n\n\\-I was unhappy about an activity that required movement around the class:\n\nMe: Ughh, tired today, I don't really feel like taking all my stuff to different stations maybe I could just---- (gets cut off, I wanted say that  I was bringing less stuff)\n\nKid in my class: Whats the matter? Don't want to lose weight\n\n\\- This one guy on multiple occasions \"She's like a sumo wrestler\"\n\n\\- And just today:\n\nGuy (He's known for being rude anyway) : I bet I can find a flaw with everyone here \\*Points to me\\* YOU'RE OVERWEIGHT, SHES STUPID ETC.... (-\\_- no idea why we even let him near us)\n\nThen... He proceeds to ask me to go to the movies with him...? I cannot like this guy in the slightest, he discriminates against everyone for one reason or another, and touches both boys and girls inappropriately.\n\n&amp;#x200B;\n\nTLDR: Stop noticing my weight and using it as a tired old insult, Yes I get offended but I'm working on my attitude towards that.\n\nThanks for coming to my TED talk.", "subreddit": "BodyAcceptance"}
{"post_id": "bihlkp", "created_utc": 1556494712, "title": "A social media friend's status update - \"Bones are for dogs\"", "author": "breathingcorpse91", "self_text": "\"I'm perfect not just inside but outside too. Maybe for you no, but my husband likes meat - bones are for dogs\"\n\n\nFirst, all I can think when you say your \"husband likes meat\" is that he rather be blowing a dude than be grinding you.\n\n\nSecond, how old are you? Pushing 30, right? When are you going to drop that high school mindset?\n\n\nThird, and this goes to every single body-shaming person, everyone has insecurities, everyone. Just because you're overweight/underweight, it does not give you any excuse to put someone else down for their body weight. You can shout as loud as you want claiming to be perfect, but if you're following it with some backhand comment about someone of a higher or smaller build, it just radiates your insecurities. I promise you, there's a LED lit banner above your head saying \"hey! Look at me, I'm an insecure piece of crap and I just want to spread my shit views onto all of you!\"\n\n\n\nLastly, it's time to grow up and start learning to love yourself, because you can't get love if you don't have it to give. You are worth loving, but it'll be a struggle if all you do is dish out hate and negativity.", "subreddit": "BodyAcceptance"}
{"post_id": "bim2n3", "created_utc": 1556517557, "title": "confused/jealous", "author": "belugaawhale", "self_text": "Hey so I think I just need some input from strangers. I have always heard how important self love is, how my own opinion matters more than others, etc. but it feels difficult and almost impossible to do, when my friends always talk about this one friend in my group, who is \"very pretty\",etc. They're always praising her appearance, in front of her and even when she's not there. Not only does this make me feel inferior to her, but it's overall a really negative hit to my self esteem. It sucks because she's one of my closest friends...but I often find myself jealous of her, or randomly angry just because I feel like she doesn't understand what it's like to feel ugly and to actually be ugly. I don't know what to do.", "subreddit": "BodyAcceptance"}
{"post_id": "bipfyr", "created_utc": 1556544253, "title": "I feel uncomfortable in my own skin", "author": "thetalldoctor", "self_text": "I have a history of an eating disorder and I told people I \"had it under control\" and was \"working on it\" for years... only recently did I finally get back to a weight that I hadn't been at in 6 years. I feel like I'm not myself - I was so used to getting comments on how thin I was, I felt proud I had such self control over how much I ate every day, people were jealous of my body, etc. Now I am really really self conscious and slightly paranoid everyone is noticing and talking about my recent gains. It has been preoccupying me when I have MUCH bigger things to worry about. I am a huge advocate for body positivity and am open about my past, and I feel like a hypocrite since I am so distressed by this. I don't know what to do and I feel stuck.", "subreddit": "BodyAcceptance"}
{"post_id": "biqf72", "created_utc": 1556549861, "title": "Meta Monday", "author": "maybesaydie", "self_text": "Good Morning on this last Monday of April. Some subreddit business to attend to:\n\n* The Fat Sex Therapist story has been posted and then reposted many times. We are no longer accepting that submission in any form.\n\n* Endgame spoilers will be removed unless tagged with reddit's spoiler feature.\n\n\n* The next Selfie post will be on Monday, May 27.\n\n\n\nIf you have questions about any subreddit business please ask below.", "subreddit": "fatlogic"}
{"post_id": "bir7sy", "created_utc": 1556553925, "title": "Summer Expectations - TW: weight loss &amp; diet culture talk", "author": "jameislame", "self_text": "Hello all! I've been working through my own personal body acceptance and body positivity overall. I have tried my best to cut out all diet culture in my life and pursue in intuitive eating, honoring my body and it's hunger signals. As summer is coming up, I have a lot of summer expectations as in being outside more often and becoming active. I want to become more active just because I want to move my body in enjoyable ways, my intent is not weight loss.\n\nHowever, just the thought of being more active I think; what if I did lose weight and when I think about losing weight, I feel happy and unfortunately, I low-key still want to lose weight.  It's so bizarre because I truly want to go outside and take walks and be active and again, the intent isn't to lose weight. The intent is pure enjoyment. I know this is solely because diet culture has been in my life for the past 20 years and a part of my mind still is hooked onto diet culture and it's honestly disappointing. \n\nHas anyone else experienced conflicting feelings similar to this?", "subreddit": "BodyAcceptance"}
{"post_id": "biy28y", "created_utc": 1556591208, "title": "So I went to this workshop....", "author": "AuntEtiquette", "self_text": "All about empowering women, silencing our inner critic, fighting the media’s representation of beauty. Supposedly feel fine with my look at any size, it’s all good. Got the group picture. HATE how I look, obviously not absorbing the message, and cried. I guess it’s a practice or a process.", "subreddit": "BodyAcceptance"}
{"post_id": "bj4fy0", "created_utc": 1556637115, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
