{"post_id": "ckipiy", "created_utc": 1564628943, "title": "Anyone skinny fat with a belly?", "author": "Kupcake_123", "self_text": "Hi guys recently I’ve gained some weight which has mainly gone to my waist area. I’m a skinny petite girl with small breasts that have gotten a little bigger. My main insecurity is my stomach now.  It had a little fat but has gotten bigger. \n\nI wish I could gain weight in other parts but if I wanted to I’d have a huge belly. Is there anyone with this same body type? I feel like most people think petite equals a flat stomach. I want to exercise and eat healthy but I don’t want to lose some of the fat as it kind of suits me except my stomach.", "subreddit": "BodyAcceptance"}
{"post_id": "ckjthy", "created_utc": 1564635653, "title": "What are your favourite body acceptance instagrammers?", "author": "rdrbangel", "self_text": "I personally love following people who inspire me to accept my body as it is and looking to see if you have any recommendations?\n\nMy favourites are:\n\n@lo.visa\n\n@mangedebauch\n\n@ashleighchubbybunny\n\n@dadcomplex\n\n@naomishimada\n\n@kelleemoran", "subreddit": "BodyAcceptance"}
{"post_id": "ckpph6", "created_utc": 1564672619, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "ckquii", "created_utc": 1564677793, "title": "My friend(15F) is getting a nose job soon", "author": "AnAnnoyingcoconut", "self_text": "Ok so I have a close friend that was constantly bullied and judged for her nose her entire life. Recently she told me she'll be getting a nose job next year. I was extremely shocked considering her age. I was even more shocked when she told me her mom suggested it.( She said that she had a breakdown and her mom asked her what's the problem and she said she hated the way she looked specifically her nose and her mom was just like that's fine you can get a nose job) Don't get me wrong I think everyone should be able to do what they want with their bodies, but I feel like my friend never got the chance to love herself since she's so young. She already visited the surgeon and saw how her nose would look and everything is pretty much planned. I know her and I know she is doing it to please others rather than myself. I don't know what to do honestly.", "subreddit": "BodyAcceptance"}
{"post_id": "ckyfzx", "created_utc": 1564714930, "title": "Wearing a bikini..", "author": "BirdieRex", "self_text": "I'm 5'2 and weigh 191lbs so I'm on the chunky side. I'm going to the beach tomorrow and I really want to wear a bikini. I feel so confident when I think of the idea but when I try it on and look in the mirror I get so unsure. I try not to compare myself but it's so hard. I want to say fuck it and just wear it!! But I'm scared that I'll get stared at. I just need that extra boost to wear it .", "subreddit": "BodyAcceptance"}
{"post_id": "ckzj6n", "created_utc": 1564721531, "title": "Trying to accept size due to medical condition.", "author": "captainraccoonotr", "self_text": "So I hope I’m not breaking any rules. I apologize for the novel. \n\nI’m genuinely trying to learn that I need to learn how to see the good physically in me, because it’s becoming really unhealthy if I don’t. \n\nI was never super skinny, but I’ve always been in a healthy BMI range and I’m naturally a more active person with a light diet from my love of running and hiking for photography, and being raised on a Korean diet with a Korean mother. \n\nBut I have developed 2 autoimmune disorders and 1 of them requires intravenous steroids with my medication every 3 weeks. I’ve gone from about 125lb / ~ 57kg to ~250lb / ~114kg \n\nIt’s double my size now. And I can’t necessarily stop it all. Steroids both make me eat more (and when I don’t eat a larger amount I physically shake and get faint) and just also puffs me up. I still run daily, and I keep what has turned obsessive notes on my diet and exercise. My immunologist and rheumatologist have both told me my blood pressure is low but good, and I’m in good physical shape so I need to slow down. They’ve referred me to a nutritionist who’s trying to encourage me but all medical and health professionals are saying the weight will likely stay on, and it’s okay as long as I’m exercising daily, not stuffing myself with cake and fast food, and I’m sleeping and hydrating properly. \n\nI have a partner who keeps swearing I’m super cute, I look great, I have a girlfriend who tries to help me find clothes that might flatter my size more and make me feel confident. \n\nBut I can’t. I just can’t. I’m trying therapy, I am now doing kickboxing three times a week, yoga every morning (mindfulness yoga as a part of therapy), and I still run. I don’t like to go outside at all anymore again and I was agoraphobic for years, I cry when I wash my face to put on makeup for work, just wondering what inspires people to be positive big or small if they’re really working on their health. \n\nLots of love.", "subreddit": "BodyAcceptance"}
{"post_id": "cl5fo8", "created_utc": 1564758965, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cl7efk", "created_utc": 1564768028, "title": "Old photos are haunting me with disruptive thoughts", "author": "maria_honeytea", "self_text": "I grew up with a mom that made me feel fat and unaccepted for a long time because I wasn’t built skinny like her, I got my dad’s family’s genes of thick muscles and curves. She has seen the error of her parenting and we have a much better relationship now. But, she sent an old photo from 10 years ago of my family at Disneyland in our family group chat reminiscing about our fun vacation. I was 17 at the time and hated myself and my body. I am 5’2” and was 140-145 lbs at the time. Looking at it now I’m like “damn, I was absolutely gorgeous”... I’m now 185 lbs and this one photo has completely disrupted my day. I can’t focus at work because I feel the agony of “why did I waste all my time hating myself when I was fine.” I just wish I could accept my body as it is but it’s hard when I’m comparing it to myself at 17.  I want to talk to somebody about it but my body issues have been a long time problem and I don’t want to bother anyone with this but I feel alone and emotionally overwhelmed. I guess I’m grieving all the years lost of not loving my body. Feeling so undeserving of love and yet I don’t know who I can talk to about this. Sorry if this is too long I just can’t stop thinking about this photo and feeling like the ugliest (and most unappreciative) thing alive right now. Does anyone else experience this and how do you deal?", "subreddit": "BodyAcceptance"}
{"post_id": "cl99i6", "created_utc": 1564776757, "title": "How can I stop comparing my body to the bodies of other women ?", "author": "yeepiyay", "self_text": "Hi people, first time posting here !\n\nMy problem is I've become obsessed with the way my body looks to the point where I can't help but compare other women to myself: I see good looking women and can't help but think do they have better curves, a flatter tummy or bigger breasts, etc.\n\nI know it sounds awful but I'm working on this, it's just become hard not to literally analyze other women. There are times when I simply don't think about this but then it comes back and idk I just feel like a terrible human for doing that...\n\nDoes anyone have some tips or advice on how to stop thinking about others ? I don't expect life-changing advice but any positive response would feel good ❤", "subreddit": "BodyAcceptance"}
{"post_id": "clenpk", "created_utc": 1564806612, "title": "How do you stop thinking about hurtful comments people have made about your appearance?", "author": "elizabitch0", "self_text": "I’m so glad this community exists and it’s been really helpful to read the reaffirming things that people post here. That being said, does anyone have specific tricks for how to stop thinking about/reframe hurtful things people have said about you looks? The one I’ve been fixating on lately is I remember several years ago I was looking through my graduation pictures with my family and my mother said, in front of everyone, “do you want me to delete the ones where you look 9 months pregnant?” This felt really degrading and I haven’t been able to get it out of my head the last couple days. Usually I’m pretty good about being confident but occasionally I’ll get stuck in a cycle where I’ll remember something like this and hate myself and my body for a couple of days. Any advice on how to avoid these occasional spells?", "subreddit": "BodyAcceptance"}
{"post_id": "cljlfm", "created_utc": 1564844000, "title": "Sonetimes I love having a soft, squishy tummy and other times I feel unconfortable with it", "author": "FlexibleCommunist", "self_text": "How do I stop feeling bad about my belly? On one hand, I absolutely enjoy a nice tummy rub from someone but other times having a belly makes me feel weird. What do I do to make myself no longer feel uncomfortable with having a round tummy?", "subreddit": "BodyAcceptance"}
{"post_id": "cljsh0", "created_utc": 1564845072, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "clurw0", "created_utc": 1564913284, "title": "Comparing myself to others has never been harsher...", "author": "signficantlyconfused", "self_text": "I've always had a habit of comparing myself to other girls physically, but I've actually managed to keep that fairly under wraps for the past few weeks. This was until I saw pictures of objectively far more attractive girls who are partners of this guy I casually sext with. I have never been in a real relationship, so this time it was the realest hurt I've experienced. I actually could not think about why the hell he would still sext with me if I look the way I do and they look the way they do. I'm talking about drop-dead gorgeous, bombshell girls, with big beautiful breasts and tiny waists. And here I am with my flat chest, weird looking face, big nose, pimples and a bunch of other things, but hearing someone loathe themselves isn't that much fun.\n\nI guess I'm just going to be that girl who people find mainly attractive for her personality and not her looks. And that will be very hard to deal with at times, because there will always always be part of me that badly wishes I was a pretty girl. It's just, I feel like it's this prerequisite you need to really be noticed by others, then things like your personality come on top of that.\n\nI just wanted to vent. Advice or thoughts are welcome. Thank you guys and thank you so much for this sub.", "subreddit": "BodyAcceptance"}
{"post_id": "clwncz", "created_utc": 1564927471, "title": "I didn't think I'd ever be comfortable in my skin. I've come a long way.", "author": "that-weird-dude", "self_text": "I'm trans. I had really bad dysphoria pre-transition and early into my transition. It was so bad that I was constantly suicidal and it's still kind of weird to be here because I never expected or planned to live this long but here I am. I hated my body. It wasn't me. It was something I was trapped in. And my body has been through a lot. I was sexually abused. I used to self harm. I've struggled with eating disorders. I've gotten so much better though. I've been able to transition. I've been on testosterone since September 2014, had top surgery in June 2016, and had a hysterectomy in April 2017. And I'm finally okay. And it's not upsetting anymore. I can look in the mirror and shower and get dressed and take selfies without crying or having panic attacks. I can just do things. It's weird but also amazing because I didn't think I'd get here. And now the dysphoria is almost like a distant memory. Like sometimes I think about how bad it was and I didn't think it would get better. But I'm ok now. And it's just surreal to remember how things used to be. I am the way I should be now. And I've just recently started more feeling confident. Like now I actually love my body and I thought that would never happen.", "subreddit": "BodyAcceptance"}
{"post_id": "cm594y", "created_utc": 1564972970, "title": "It’s not about my body.", "author": "gingerdemontor", "self_text": "It’s about the fact that I’ve pushed it to the limits in the gym and still look like a big girl despite being 5’6 and 126 lbs (no joke) next to my petite, pear-shaped friends because what little fat I do have migrates to the most visible parts. \n\nI probably eat less than 1200 calories per day, eat way less, but it’s not about that. It’s that I have no appetite to eat more, because I can’t enjoy food without thinking about it’s natural chemical consequence. Sometimes I wonder what it’s like to feel guilty about indulging in food, because to me it’s not an indulgence anymore, just a cause for more pain in the future. \n\nIt’s that people only treat me human when I am so skinny my hip bones jut out and I hover close to underweight. But it’s not about how unfair it is to maintain it, it’s about the fact that I don’t even notice the difficulty anymore. This is what you must do to earn a residence on earth, after all. Why should I complain? \n\nI shouldn’t complain that sometimes people are cold to me, avoid me, after meeting me. It hurts the most when it’s teachers, or employers, or coworkers- people who you *need* to get along with professionally who you hope knew better, hoped would treat you for what’s on the inside as if that’s somehow separate from the outside. \n\nI shouldn’t complain because sometimes I do the same when I’m surprised by someone’s appearance. And then I feel bad. Then I feel worse because I should know better. \nThen there’s fiberglass in my lungs because crap- *I* make people cycle through this guilt and discomfort, too. Do they feel I’m a human? It’s hard to see someone as human when you’re ashamed for your reaction to them. \n\nNo, really, it doesn’t matter in the grand life and death scheme of things. But sometimes I happen to see a picture, or a reaction flash across someone’s face, and I remember. It’s not unfair because we’d pick on something else if everyone was beautiful but I am selfish and, if I had the chance to swap into a more neutral body, I would in a heartbeat.", "subreddit": "BodyAcceptance"}
{"post_id": "cm85aj", "created_utc": 1564992236, "title": "Have learned to accept my body but i still find it hard sometimes due to the people around me", "author": "kkirino", "self_text": "Starting as a teenager i started to become more and more self-conscious about my body, especially due to my parents who had a constant worry about my weight gain and overall appearance. \n\nNow that I'm an adult, I've somehow come to terms with my body and don't hate myself over it like I used to. I've stopped comparing myself to other people and have learned to love it a little more, but it's just instances with my parents (mainly my mum) who just keep pushing me down. \n\nShe's compared to me to my cousin's (who are all very skinny) and has said 'if I was your age I would look sexy, but you're not even trying to do anything' -- referring to my weight. She's told me to not eat certain things or else I'll get even more fat, she just constantly references my body and how I'm not 'sexy' and i won't get a guy because of the way i look. She's even gone and compared her body to mine and said \"I'm skinnier than you and I'm 50\" \n\nIt's started to affect me again to be completely honest. Sometimes i just sit in my room and cry, and start spewing out negative thoughts in my head. \n\nI get into a really depressive state, and i'm currently in this cycle again. I thought i knew how to love myself but when i hear about these things i start to think about how ugly i am. \n\nIf anyone's experienced this, how have you been able to go forth with it? I don't feel the very best right now and have hid all my mirrors, too ashamed to look at my body right now. :(", "subreddit": "BodyAcceptance"}
{"post_id": "cm9u4l", "created_utc": 1565004857, "title": "Inescapable comparison", "author": "malpalval", "self_text": "Social media makes it nearly impossible to avoid comparing myself. \n\nI deleted instagram to break the habit of mindlessly scrolling through thousands of pictures that only made me feel like garbage. This has helped tremendously, but it's impossible to avoid entirely. \n\nTwitter isn't even as enjoyable anymore because my feed is still constantly flooded with perfect women. \nI know there will always be attractive people in the world, but social media just makes you so much more aware of it. \n\nAnd I'm so tired. I even find myself stumbling into my insecurities on here, which sucks because it's been the most helpful outlet. \n\nMaybe I need a break from everything.", "subreddit": "BodyAcceptance"}
{"post_id": "cmatft", "created_utc": 1565010803, "title": "I'm fat and I hate it", "author": "clarenceappendix", "self_text": "I've been overweight since I was young... so all through middle school, high school, and even college, I was overweight. I've been trying off and on but it's obviously harder than it looks, especially when you're trying to manage school, and especially while you're trying to manage school and an internship.\n\nBut I still feel embarrassed and ashamed of my body... It's almost like being naked in public all the time. \n\nI've barely hung out with people, had friends, or communicated in general... I've shut myself off from everyone because of how I felt about myself.\n\nLike I get it I need to lose weight I'm fat but I'm not doing something horribly wrong to anyone. I don't want to feel ashamed all the time!", "subreddit": "BodyImage"}
{"post_id": "cmc9r3", "created_utc": 1565018285, "title": "Meta Monday Casual Conversation", "author": "maybesaydie", "self_text": "Talk about weight, food, fatlogic and fitness.  Please no rants.\n\n\nSelfie post is scheduled for September 1st so get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "cmr44t", "created_utc": 1565100865, "title": "Why do you do this? It’s not a compliment.", "author": "cocapple", "self_text": "Why is it still acceptable to call healthy people “skinny”. The next time someone lets me know how skinny I am, I am going to call them fat. Just another American double standard.", "subreddit": "BodyImage"}
{"post_id": "cmrt22", "created_utc": 1565104257, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cmtsbt", "created_utc": 1565113480, "title": "The weird relationship between love and hate inside every plus person.", "author": "jayharr9", "self_text": "Hello, beautiful people of r/BodyAcceptanceToday,\n\n I read a very interesting piece regarding a fellow big guy who found confidence doing sumo wrestling and while reading his words I felt connected because distant memories of past experiences came to mind.  Looking back at my life I've always had self-image issues not because of how I see myself but how others make me feel.  Constantly people very close to me and even friends have always had something negative about my body shape.  Always with good \"intentions\".  Throughout my life, I distinctly remember the infinite times my dad compared me to others or asked me why wouldn't I just \"lost weight\" like Miguel Cotto (Puerto Rican boxer) who some say he was chubby and one day decided to pick the gloves and go from there.  I had overcome so much in all my years; from a very traumatic childhood and bullying to depression. To be honest I wish I could say that it got better with time and that now my life is the best.  But no,  being gay you constantly see in media examples of body standards that are unattainable by most but often we are compared by those same standards when meeting someone or dating in general.  Don't get me wrong I don't have any problem with someone's preferences that's their life.  What rubs me in the wrong way is the constant rejection and just plain asshole behavior of some, to the point where they've treated me or tried to make me feel like garbage.\n\n&amp;#x200B;\n\nAt the moment and with 28 years roaming through this Earth I can say that the only thing that has improved is my self-confidence and how I see myself in the mirror.   No matter how much love handles I have, how red or big are my stretch marks even how my manboobs are the butt of a joke by a few.  When I look in the mirror I see a survivor but more than that I see someone deserving of love, decency, and a good life. Whenever I feel down I repeat to myself all the bad things I been through always repeating one of Tess Holiday's quotes: No matter how big your waist is, everyone deserves respect.\n\nSorry for my grammatical and/or syntax errors.  English is not my first language.   If you made it to this point thank you for reading and have a great day.", "subreddit": "BodyAcceptance"}
{"post_id": "cmujqv", "created_utc": 1565116962, "title": "I feel like I am making progress on liking my body", "author": "eukarythotic", "self_text": "Today I saw my body in the mirror and didn’t feel disgusted, I just felt recognition that yes, that’s my body. It exists. And that really was it. I feel like I’m starting to get a bit more neutral about it, and I want to continue ahead in this way.", "subreddit": "BodyAcceptance"}
{"post_id": "cmv917", "created_utc": 1565120321, "title": "body dysmorphia has taken over my life", "author": "Scarlet1992", "self_text": "I'm sorry if this seems like a pity party rant - I just need to get this out.\n\nAlso, this might be triggering to some...\n\nI've had body dysmorphia (BD) for most of my life, and while I have never been happy with my body, it hasn't quite been \"this\" bad in a long time.\n\nIt literally feels like BD is taking over my life. Whenever people ask me what is going on in my life, weight is the first thing that comes up. Or the fact that I need to buy more make up or change my hair again. Or the fact that my chin is looking too flabby and my waist isn't small enough. My siblings, boyfriend, and mom have all told me in one way or another that my body is the only thing that I talk about, and I hate it so much.\n\nEvery time I look at myself, I just get more and more depressed. It feels like there is no \"happy ending\" for my body and there never will be. There doesn't seem like a way out anymore and I don't know what to do.\n\nIt feels like the only time I can forget about my body is if I'm drinking, but then I just start worrying about calories and about how I'm just gonna end up with a \"beer gut\".\n\nI've ben trying to change things myself; I know that I'm fat, so I've been dieting and working out, and I've lost 30lbs already. But, when I look in the mirror, I don't see a difference. If anything, I feel like I've gotten fatter.\n\nI feel like I'm losing my absolute mind and I can't keep doing this. Can someone please help me?", "subreddit": "BodyImage"}
{"post_id": "cn45h8", "created_utc": 1565174358, "title": "Any men here struggling with their bodies?", "author": "StrivingToBeMyself", "self_text": "Hi, I'm new here 👋🏻\n\nI'm not the tallest guy (5'8\" / 1,72m), pretty thin and I don't have a beard. I also have a slightly asymmetrical face.\n\nFrom what people tend to tell me I would be considered fairly attractive, but most of the time I don't feel like it at all. I'm 33 and I still look like I'm in my early 20s. That's also a problem sometimes.\n\nAnyone has similar body issues or any good advice for me? I usually don't talk about these things, so I'm hoping that having a conversation about will help 🙂", "subreddit": "BodyAcceptance"}
{"post_id": "cn71jf", "created_utc": 1565190801, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cn813o", "created_utc": 1565195404, "title": "Getting demotivated at the gym because I keep comparing myself to other women [semi-rant]", "author": "Separate_Definition", "self_text": "I've been going to the gym regularly for about a year so far, and physically I know it's good for me because I've been getting stronger and lifting heavier, but mentally I feel like it's not been very good for me. \n\nI keep comparing myself to other women at the gym, and am getting really down because of it. As someone who is built like a '12 year old boy,' with basically no curves, I have always wanted a curvy, feminine body that I know I'll never have. I have to work SO hard just to gain an extra cm on my butt, and no one notices because I'm already slim. \n\nThen I'll see women at the gym who looks absolutely amazing - big boobs, curvy butt, and a waist the same size as mine and I start comparing myself to her. Basically what gets me feeling the worst is that they almost always barely do any work in the gym (light cardio for 30 mins then leave), while I'm busting my ass for changes only I notice!\n\nImmediately after seeing them, I start thinking 'well why do I even try? I'll never have that sort of body even if I work out 7 days a week.' It gets really depressing, and I don't know if there are any strategies I can try to stop myself getting into this cycle.", "subreddit": "BodyAcceptance"}
{"post_id": "cn8auz", "created_utc": 1565196688, "title": "Happy Birthday MaybeSaydie!", "author": "GetOffMyLawn_", "self_text": "Please join me in wishing our favorite mod Happy Birthday!", "subreddit": "fatlogic"}
{"post_id": "cng3fn", "created_utc": 1565235496, "title": "Just got married. Feeling insecure...", "author": "oddoneinside", "self_text": "I've had body image issues most of my life. I was a chubby kid and got made fun of a lot. I eventually lost a lot of weight and kept it off for years. I was very fit and that was the happiest time of my life. I decided to go to nursing school and the stress caused me to gain a ton of weight. I now consider myself chubby. My husband has always been supportive and compliments me all the time. I got married recently and I feel insecure tonight. It seems like every girl I know is smaller than me. How did I let go of myself like this? I haven't been called any names, but I've had a few people say \"You look/got bigger\" I talked to my husband about this and he says I'm beautiful. He's never done anything to make me feel insecure. It's me. I compare myself to other women all the time. I know this is all psychological and I should learn to love myself, but I really don't think I'll be truly happy unless I go back to being fit.\n\nI never thought I'd get married. I used to think I wasn't pretty enough. Now I'm married to the man of my dreams who is drop dead handsome. But somehow I feel hideous.", "subreddit": "BodyAcceptance"}
{"post_id": "cngxse", "created_utc": 1565240427, "title": "Can't stop comparing myself to my ex's tall, thin new girlfriend", "author": "coffeescone", "self_text": "I was in a really toxic relationship for about a year, then broke it off, then did that stupid thing where you're \"best friends\" that occasionally hook up. Then he started dating this new woman and ghosted me COMPLETELY, like, I helped him move one weekend, everything was normal, then the next thing I know he's stopped responding to my texts and months have gone by.\n\nI am a healthy weight, but self conscious about my stomach and under-chin fat... and she is textbook model-esque attractive. Tall, super thin, long blonde hair, clear skin, basically Kate Moss with big boobs. This caused a huge blow to my self-confidence, and I know I shouldn't compare myself to others, but I feel like I have no control over it. And every time I think about her and him, it motivates me to exercise....which can't be healthy. At the same time though, I feel like any reason to exercise is a good one, and I don't take it to extremes (pilates/swimming 3-5 times a week for 30 minutes or so, plus yoga/stretching in the morning most days). Any advice?", "subreddit": "BodyAcceptance"}
{"post_id": "cnjea9", "created_utc": 1565257177, "title": "Tips for overcoming insecurity?", "author": "party_hoagie", "self_text": "This is my first ever post to Reddit so I apologise abt any mistakes w/ format (posting via mobile), or if this isn't the correct subreddit for this. \n\nI'm extremely insecure about my body.(18F) I've never been able to like my body for longer than a few hours before going to complete indifference or disgust with my appearance. It used to be based around weight, at the beginning of my senior year of high school I was 218lbs and I've dropped down to 193lbs due to new medication and having to ride my bike to and from school, but in my mind I still look gross. My breasts are noticeably uneven and even after losing weight it's still the same, I've been thinking about getting them done but I'm afraid of surgery doing more harm than good. I get anxious about things and talk myself out of it easily because change is scary to me. I have some problems about not feeling feminine enough and it's gotten to the point that I feel sick when I think about putting makeup on or wearing different clothes because it feels like I'm a kid playing dress up. \n\nI'm worried it's affecting my relationship with my girlfriend. She's supportive of me and has made it clear that she loves me for who I am and any changes I make regarding appearance wouldn't bother her as long as it makes me happy. Despite that I feel awful when she let's me be little spoon or things in that nature because in my mind I'm too big to be it. Too clunky and wrong or something like that. My gf and my sister have both mentioned I could have body dysmorphic disorder but I've never gotten anything from a doctor confirming that or even have asked my therapist about it. My insecurities are deep rooted and have been around for a long time and it feels like they won't ever go away, and I know they probably won't ever fully be gone, I just need something to help alleviate it somehow because it feels like it's killing me metaphorically. \n\nIf anyone has any tips on overcoming this or how to not hate my body as much it would be appreciated. I apologise if this post is all over the place, I have trouble organizing my thoughts and it's harder to form something coherent when I'm a bit upset/frazzled I guess.", "subreddit": "BodyAcceptance"}
{"post_id": "cnn2z2", "created_utc": 1565277092, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cnn7rv", "created_utc": 1565277728, "title": "My wonderful friend's new book on Body Acceptance", "author": "13Stories", "self_text": "https://i.redd.it/9b4lvzjrs8f31.jpg\n\nHi all,\n\nA couple of years ago, I was at an event in London called Sunday Assembly (a secular Sunday community gathering with songs, talks, volunteer projects and comedy; like a secular church). I was there with my walkaround performance project ([theinsecurityguards.com](https://theinsecurityguards.com)) and the event that month was focused on Body Acceptance, featuring talks from Megyn Crabbe and my now-friend Harri Rose.\n\nI was so impressed by Harri; she was witty, self-effacing but not self-critical, warm and insightful. She was also honest about her own struggle with eating disorders, diet culture and self-acceptance. We got talking at the event and she's become one of my best friends. I love her to bits.\n\nSo, I hope it's okay but I'd like to tell you all about my amazing friend Harri's brand new book that came out yesterday: You Are Enough. It's small (pocket-sized if you have fairly big pockets), beautifully designed and illustrated (by @ashlukadraws), and full of genuinely really insightful, original and helpful advice and information about defying capitalist constructs of self-criticism and insecurity in order to accept and celebrate yourself, whatever you look like.\n\nYou can find Harri on Insta @harri\\_rose\\_ and her website is [harrirose.com](https://harrirose.com). You Are Enough is available at Waterstones in the UK and on Amazon.\n\nThanks!", "subreddit": "BodyAcceptance"}
{"post_id": "cnt3yg", "created_utc": 1565303137, "title": "Moving, mindset, comparing.", "author": "lost_things90", "self_text": "I moved to Colorado and I think I am in culture shock so to speak. There are so many thin people here. So many.  I have met very few that are my size.  I am starting to compare myself which is absolutely toxic.  \n\nBut I can't help it.  My partners all think I am gorgeous. (I am polyamorous) But I am just so down on myself.  I can't find any plus size groups here.  Nothing supportive. Nothing to keep me from this space. I used to walk a run way for a lingerie show before I moved. I used to do some body acceptance modeling before I moved. Now I am having a problem getting back into that. I see all these beautiful people and I don't feel I belong.  It is hard being here.  The lack of diversity actually scares me too. I am just...  I am on the outside looking in.  I am unsure how to battle this mindset. I logically know that I am gorgeous and that my weight has nothing to do with my beauty. These thoughts are irrational.  I accept that.  I just don't know how to get out of this spiral.", "subreddit": "BodyAcceptance"}
{"post_id": "cnugl9", "created_utc": 1565309760, "title": "Ren fest is tearing me up, a little post partum rant", "author": "Eowyn-where", "self_text": "None of my prior year costumes fit my after baby body. I hate how big my stomach still is from muscle distention(sp?) and my breasts are up to an f. I hate how the only thing I'd be somewhat acceptable in is a wench or a barmaid. I made midsummer costumes for my whole family, I was supposed to be the queen of the fairies. I am no fairy. \n\nI just want my tiny fit body back but I know it isn't possible because, my body is different now.", "subreddit": "BodyAcceptance"}
{"post_id": "co3qgz", "created_utc": 1565363701, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "co9plj", "created_utc": 1565390298, "title": "\"Going out\" wear and body acceptance", "author": "creaturecomforts13", "self_text": "I was wondering if anyone here had any tips for accepting and enjoying your appearance when in \"going out\" clothes that are maybe shorter, tighter or more revealing than what you would wear every day?\n\nI (22F) am going out clubbing with some friends for one of their birthdays soon, and while so far I have gotten away with very casual club clothes (student bars, amiright?), the friends I am going out with are quite new friends and seem to dress up more than I am used to. However, I am very insecure and self-conscious about my body! Sometimes I think I look really good, but sometimes I just focus on the negatives and self-perceived \"flaws\" in how I look. Has anyone thought of a way to discourage these thoughts? Or, if not, should I go more modest with what I wear or brazen it out in a short dress? I honestly have no idea what to do! Thanks in advance", "subreddit": "BodyAcceptance"}
{"post_id": "coelyh", "created_utc": 1565418822, "title": "No Body Shame What is you take?", "author": "socal_makeupjunkie", "self_text": "I am watching all these reality dating shows and other reality shows, why is it that we never see a plus size person on the Bachelorette or the Bachelor ? Are they trying to give it across that only skinny people are allowed to  be on the show.. I do see thicker people on the Food Network shows and that is sterotypical network for people that are a bit larger.. what is your take?", "subreddit": "BodyAcceptance"}
{"post_id": "coj77a", "created_utc": 1565449826, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "comvp7", "created_utc": 1565467404, "title": "After having the worst day ever, I think I finally understand why negative voices don't matter.", "author": "ilikepineapples15", "self_text": "Today, what was supposed to be a fun evening with my friends was ruined when my mom decided to express a few of her \"opinions\" about my weight while I was getting ready and doing my makeup.\nShe said I put on some weight and I looked ugly and awful, and I used to look a lot prettier in the past. I have body image issues I'm trying hard to overcome, and she reminded me of every negative voice in my head I was trying to forget. \nI burst into tears and asked her to leave my room, spent 2 hours in an endless cycle fixing my foundation and crying and ruining it all over again, and was late to meet my friends. Even when I was with them, I was trying hard not to cry thinking about what my mother said. \nWhen I came back home I told her what she said was mean and way out of line and i would appreciate it if she didn't day it in the future, and she responded with \"Only a true friend would tell you something like this. It's the same as when someone says a dress doesn't suit you, it's a friend being honest so you end up looking nicer\". I ended up crying again, right up till right now, 1 a.m.\nI went to the bathroom to wash my tears away for the 3rd time tonight, looked in the mirror, and stood there staring in....horror?\nI didn't recognise myself. I looked really sad. My eyes were all red and puffy, my cheeks were stained with tears, I looked like a mess.\nThat's when it hit me - it doesn't matter how ugly other people said I looked, I felt the ugliest when I looked at myself in my bathroom mirror and saw a sorrowful, gloomy stranger staring back.\nI've now made a decision to be happy for ME in the future, and try to block outside \"noise\" as much as possible. It's not going to be easy, learning to accept myself, but I'm going to work hard until I do.\nI might look my ugliest when I cry, but I feel my prettiest when I wear a beaming smile and feel happy inside, and at the end of the day, that's what should matter the most.\nHere's to learning to love ourselves. ❤️", "subreddit": "BodyAcceptance"}
{"post_id": "cos8pp", "created_utc": 1565496489, "title": "A shorter and smalller boyfriend", "author": "CherryChann", "self_text": "Hi! I am a 19 yr old curvy/chubby? Tall girl. My boyfriend is quite short and he suffers from an eating disorder (in recovery!). My boyfriend loves me for who i am and how i look, even though I look HUGE next to him. I got a lot of comments that I look way more like the \"guy\" in our relationship and it hurts. I also get this comment that most girls want a taller bf and that this is \"cute\" or \"new\" for people to see. To be honest it ruined my self convidence. I feel terrible when i stand next to a small and petite girl. Sorry this was just a rant. Xo", "subreddit": "BodyAcceptance"}
{"post_id": "cp291v", "created_utc": 1565556981, "title": "Tired of the balance between confidence and protecting myself.", "author": "forksandfawkes", "self_text": "This is my first time posting on this subreddit and the thing that led me to (rant) here was an incident earlier this week.\n\n&amp;#x200B;\n\nThis past Monday, I was on my way home from the train station and absentmindedly saw a young man listening to music and walking pretty fast. I was holding a lunch bag in my right hand and my phone in the other, I stopped to look at phone and was about to start walking again when I look up to see the man LEANED TOWARDS ME AND KISSED ME. I managed to duck so he only got my ear but the interaction got me shaking for hours afterwards. I have been catcalled before and the worst got as far as someone following me until I pretended to make a phone call. I told a few people about what happened and the vast minority were sympathetic but most of them didn't really know what to say to me. And I still feel shitty about it now.\n\nI care about aesthetics but it is not a performative act, it's a part of my ~~consumerism~~ personality. I only dress for myself and I follow a professional dress code at work. In fact, I was not even wearing anything revealing!!  I had on a cardigan and a sleeveless tank where I guess you can see a square inch of my shoulders on each side if I stretch (wow scandalous). I had wide legged black pants that couldn't even be any less sexy. I don't work in a field that focuses on exterior beauty but I have a lot of interest in makeup and fashion and I like taking the time to pamper myself. I sometimes feel like I'm supposed to be punished for wanting to enjoy makeup, picking out a nice outfit and going outside with God forbid some joy and confidence. \n\nI want to be safe (and my outfit was \"safe\") but I don't want to be harassed or assaulted! I don't even go out often and never go out at night time. I always tell someone where I am going and I take extra caution in crowded areas. Yet it felt like nothing can guarantee my safety and it's terrifying. It took me years, decades even to get my self-esteem here and I'm damn proud of myself. I just want to enjoy who I am without feeling threatened. I know I can't control other people's actions and that's what really sucks. I'm SICK of feeling scared of going outside and evaluating whether or not my outfits are \"too flattering\" or I look \"too pretty\" and slouching to hide my boobs!!! I feel like I've been made to feel bad for complaining about these types of encounters because women just need to \"working\" on something about their appearance all the time so this is just normal! I know I will myself go to self blaming thoughts and I really shouldn't do that anymore but it's hard sometimes.\n\n&amp;#x200B;\n\nIf you got this far, thank you for reading and listening to me yell!! On a different note, I really enjoy the posts in this community and all the encouragement you give each other. Even though some things are not directed at me, I feel comforted by reading some of the other posts.", "subreddit": "BodyAcceptance"}
{"post_id": "cp355t", "created_utc": 1565561134, "title": "How do you actually accept yourself when everyone is obsessed with body image?", "author": "booksarelife99", "self_text": "I'm sorry, I'm not sure if I'm posting in the right place. \n\nI'm a 19 year old female and lately I have realised how down society's obsession with makeup and body image gets me. I only wear minimal eye makeup, nothing else, because I have eczema so any other makeup really irritates my skin.\n\nBut I feel like everywhere I go - social media, university, shopping in town, to see friends, most girls are caked in makeup, and I always think they look so much better than me! For example, my best friend at uni gets up hours earlier to do her hair and makeup, while I usually wake up 20 mins before I have to leave the house, shove some food down me and go. And for some reason, when I get to uni I feel like a potato sitting next to her. All of these influences make me feel like I 'should' be making more effort, and when I go out in public without makeup (about half the time) Jesus I feel unattractive.\n\nNot to mention the constant bombardment of makeup - I've unsubscribed to random makeup emails I always seem to receive, yet in shops (like Boots, which is a pharmacy that also sells lots of makeup, or Debenhams) you tend to have to walk through all the makeup and perfume to get to the medical section, or furniture section whatever.\n\nI know I have to work on my self esteem, that's a given. But I really don't know **how** when all these influences are constantly in my face making me feel bad about myself.\n\nSorry this post is a bit of a moan, I really just had to get all this off my chest! Thank you for reading.", "subreddit": "BodyAcceptance"}
{"post_id": "cpd2ea", "created_utc": 1565619893, "title": "'your body is just an extension of your brain'", "author": "pastelchannl", "self_text": "I was talking about my insecurities for the milionth time with my BF, this time complaining me looking so different in pictures than what I see myself as (and compairing myself with my (in my eyes) prettier friend).\n\n&amp;#x200B;\n\nthe thing that really stuck with me was him saying that the body is just an extension of your brain. as long as you're doing what you like best and live life to the fullest, it doesn't really matter what you look like.", "subreddit": "BodyAcceptance"}
{"post_id": "cpft72", "created_utc": 1565631936, "title": "Beautycon not Inclusive", "author": "eeevilmigraines", "self_text": "Not sure if this is the right sub for this. Apologies for formatting I am on mobile but I really need to rant. I spent a long time working over issues, loving myself for who I am and how I look.\n\nWhen I see one of my favourite Youtubers being treated like garbage at Beatycon because she's not a standard size riles me up. I wanted to cry for her. She looked absolutely stunning and all I could think was if she isn't accepted there I sure wouldn't be. I can't believe in 2019 we still have ignorant jerks who think you have to be a certain size to be beautiful. \n\nI'm going to have to put on a fab outfit and rock it to get rid of that negativity.", "subreddit": "BodyAcceptance"}
{"post_id": "cphkk8", "created_utc": 1565639443, "title": "Mini Confidence Boost", "author": "death-by-chainsaw", "self_text": "I've been struggling with a lot of body image issues lately due to stress, and today was a particularly bad day. There was a loooot of stress eating and subsequent self hatred. \n\nBut on my way out of work, a random stranger stopped me in the street and asked to take my picture?? She was a photographer doing some sightseeing around the city, and I guess she thought I looked nice? I normally shy away from pictures, which are a huge trigger for me. I've never considered myself picture worthy before, so I didn't really know how to respond. Not to mention I was sweaty and gross after an 8 hour food service shift. \n\nI posed for the picture anyway. And it actually gave me a weird confidence boost, something that I haven't had in a while. It's a nice little reminder that we all see each other much differently than we see ourselves. \n\nTo each and every beautiful person reading this: you're all totally picture worthy and ily ❤", "subreddit": "BodyAcceptance"}
{"post_id": "cpoqzv", "created_utc": 1565674778, "title": "Hate myself", "author": "YakaAka", "self_text": "13 yr old male, wanting to be very small and feminine. More of the opposite. I'm 5' 3\", when I want to be like 4' 9\", I have body hair all over me, and I can't get rid of it because my parents will kill me if I even remotely ask. can't buy any razors or anything else because they will most definitely find out. on the bright side, I'm not ugly and my face looks fine :)", "subreddit": "BodyAcceptance"}
{"post_id": "cpsjce", "created_utc": 1565699770, "title": "Recognised my dysmorphia's effects today", "author": "peepocho", "self_text": "I was checking myself in the mirror so I could point out one or two good things about how I look as an exercise to build confidence. I noticed today that when I place my arms down my hips look narrower than when they don't. Like, they literally morph when I bring my arms down and then back up again. Like I loose my ability to recognise shape. I think my broad shoulders contribute to this. So strange.", "subreddit": "BodyAcceptance"}
{"post_id": "cpugzl", "created_utc": 1565709090, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cpweez", "created_utc": 1565717429, "title": "My boobs make me fat", "author": "moregutsthanglory", "self_text": "Hi I’m a basic bitch living life and I feel like since my boobs got bigger I feel fatter. I’m 5’10 , 180lbs but my boobs make me look soooooo wide and idk. How to think more positively.", "subreddit": "BodyAcceptance"}
{"post_id": "cq39il", "created_utc": 1565748922, "title": "What would be the worst thing that could happen if I just accepted my body for how it is?", "author": "staticpopcorn", "self_text": "I had a sort of epiphany today.\n\nI was doing my usual spiral of self-hatred, looking at pictures of “perfect” women and wondering why I don’t look like them. \n\nThen, almost as if it were something other than my own consciousness, a small voice in my head asked me, “what is the worst thing that could happen from just letting yourself be how you are and accepting your body for how it is?”\n\nI’m not saying I’m cured of my body image issues. It’s probably going to take a lot more than a single moment to undo years of negative self esteem and body comparisons.\n\nBut it really made me think about it. What do I have to gain from hating the way I look? Absolutely no one is benefiting from my misery, especially not myself. Beating myself up for my soft spots and rolls is not going to “fix” them, not that they even need fixing in the first place. \n\nWorst case? Maybe I get a little bit sunburnt from exposing my legs in the sun. Maybe I decide to spend money on the clothes I WANT to wear instead of spending money on the clothes I think I should wear. Maybe I let myself indulge in that piece of cake that I’ve been obsessing over for the past week and get a little bloated because, damn, sugar really sets my digestive system off.\n\nBut I can live with those things. I can’t live with nitpicking myself and my self-labeled flaws. I can’t live in fear of letting my future boyfriends/sexual partners see me nude (and if, God forbid, I hear a negative comment, I guess they aren’t getting laid 🤷🏻‍♀️). I can’t live with the constant “ugh, if only I looked like this I could wear those shorts”.  I can’t live with crying almost daily over things I literally cannot change short of drastic and wholly unnecessary surgery. \n\nSo maybe, next time when you’re feeling low about yourself, ask yourself what would actually happen if you accepted your body for how it is. You probably won’t be able to come up with any truly negative scenarios.", "subreddit": "BodyAcceptance"}
{"post_id": "cqb0ff", "created_utc": 1565795551, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cqmtrc", "created_utc": 1565855535, "title": "i’m having trouble celebrating my fitness accomplishments bc of my bdd.", "author": "insomniopath", "self_text": "this is just a rant bc sometimes putting it into words makes me understand it better. Anyway, 4 months ago i was the fittest i’ve been since high school... but this summer, i didn’t have access to a gym bc my student membership expired, and i couldn’t afford a new membership. I became pretty depressed all summer due to starting a new job (from home, so i never left my house) and not having a gym. i also worked late, so i never really saw the daylight. i kind of developed a binge eating disorder and becoming obsessed with my weight, causing me to starve myself every few days... at the beginning of august i moved back to my hometown. i now have access to my parents gym and have been going frequently for the past two weeks. it’s helped my kind of eating disorder to the point where i really don’t do it at all, and i’ve been having happier days.... however, i still hate my body and looking back at photos from 4 months ago. i keep trying to tell myself that if i’m able to get that strong 4 months ago, i can do that again. But i also look at myself in the mirror, wondering if my weight gain is just a part of getting older, or that i have an underlying medical problem where i’ll keep gaining weight (like i know it’s probably not and it’s from taking terrible care of myself this summer). Anyway, tonight after my workout, i felt disgusting and hopeless. i felt like my workout was for nothing. physically, i worked hard but mentally, i felt like i didn’t work hard enough. \n\nit’s just hard to celebrate my healthy habits when what i see affects how i feel.", "subreddit": "BodyAcceptance"}
{"post_id": "cqpurx", "created_utc": 1565875842, "title": "Having Anxiety Even Though It's Stupid", "author": "X0X000", "self_text": "BACKGROUND:\nHow I view my weight has always been an issue. As a kid I was always the tallest and fattest. I used to get bullied a lot, both emotionally and physically. I've had switch schools and classes because other kids (both guys and girls) punched me, broke my glasses, threw food at me... All kinds of stuff.\n\nI went from 200lbs when I was 13 to 125lbs by the time I was 18. I'm now 23.\n\nPRESENT:\nI stepped on the scale yesturday and I was 148, this morning I'm 150. It made me really sad and it gave me anxiety. The first thing I thought was, I shouldn't have eaten that snack after I got home from work last night lol. WHICH I know is super unhealthy mindset. \n\nI know its probably water fluxuation or I just need to go to the bathroom or whatever, bcuz there's no way I can gain 2lbs over night because of 1 extra snack the day before.\n\nANYWAYS, how do I over come this foolishness?", "subreddit": "BodyImage"}
{"post_id": "cqqnjs", "created_utc": 1565879732, "title": "Fatness attraction and dating.", "author": "jayharr9", "self_text": "Hello, beautiful people of r/BodyAcceptance,\n\nI came back because I found this subreddit very inspiring and you guys made me feel creative. I found an old series that I watched back in 2017/18 called Dietland it only has one season and I connected with it because is about what we as bigger people go through.  From being bigger kids to full-figured adults people still, find ways to make us feel bad for our weight and just project their own insecurities onto us and not only that,  society has deemed us ugly and undesirable. We are portrayed like the butt of a joke over and over again in mainstream media.  When was the last time you saw someone bigger doing a serious role in a movie?  When have you someone doing a dramatic scene or acting their asses off on screen with a plus figure? Almost never, that has always rubbed me the wrong way. Feels like you have to have a flat stomach in order to evoke emotion to an audience and don't get the wrong idea there's are people like Kevin James, my favorite comedian Gabriel Iglesias, and Melissa McCarthy who have done it but they all had to start in comedy and build up from there.  Even John Goodman, one of the greatest actors of our days had to get stupid roles in his career before even got considered for more serious roles or action roles.\n\nFat people are constantly treated like the emotional punching bags or the comedic relief of the world at least in modern days we have  the body positivity movement  and at least they  are leveling the playing field by doing important work and creating a market for people who's waist  like mine is not a 32, that is beautiful. There's a lot of work to do.  Kids out there that are still victims of bullying for being fat,  also being shamed and mistreated for not having the 'ideal body'.  I remember at 14 I was doing caplets for weight loss you know how dangerous that is at such a young age,  I did exercises, I walked, I ran every sunset and jumped rope in the morning just to please the eye of someone or in my mind I thought that I needed to burn fat in order to be treated like other men or even being deserving of love and respect.  We do so many things for society.  The same society that treats us so badly and corners us constantly.  A society that has kept our character hostage for so long.   We are so addicted to beauty standards that we evaluate someone by how they look before we even listen to a word that person says.  Even in the dating world as a fat person, you are forced to do poses and angles just so people think you are slimmer than you actually are. I read somewhere that women's first fear is a blind date is that their date is a rapist and men's first fear in a blind date is that their date is fat.  Being gay is no cake either, unattractiveness is viewed as an illness for the gays; some even say that being gay is only fun if you are physically beautiful.\n\nOver and over we repeat the same lies to ourselves.  Lies got stuck in our head like the latest pop song on the radio.  It's time to break the cycle.  Some of what we say is not even our own thoughts,  some of it is just insecurities of other people projected onto us.  We use it as a weapon against ourselves because in some fucked up way the worst we can do is actually love ourselves and be positive about our body.  The most offensive thing that we can do is actually in the eyes of society is actually liking what we see in the mirror and flaunting it so people can see that we are not an emotional punching bag, comedic relief or ultimately the butt of a joke. Maybe it's time we bring out the worst in us, maybe it is time that we show society that their worst is our best.  That even if they get offended, angry or disrespectful we are going to still wear what we like, we are gonna get out are we are gonna still kill the game. Because being bigger is just part of us not what we are.", "subreddit": "BodyAcceptance"}
{"post_id": "cqr4ul", "created_utc": 1565881881, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cqreyx", "created_utc": 1565883144, "title": "Is this fatlogic? Or do I have a point?", "author": "Amiller1776", "self_text": "I'm fat. 5'10\" male. 270 lbs. Lots of muscle because I like to lift and I have a job the requires a lot ot heavy lifting, but still like 30% body fat. I've lost weight a few times, but it keeps coming back. I know its not genetics, its pizza and monster. I go through phases of discipline followed by phases of total relapse.\n\nI also know about the health risks, like heart disease, diabetes, cancer, etc...\n\nI have a chronic cough that occures every fall and winter, then goes away in the warmer months. I  have cold and exercise enduced asthma that can be treated with an inhaler so I can run. (Did a 5k 2 years ago during one of those \"discipline phases\", that really helped my asthma actually. Kinda want to call bullshit on it being \"exercise enduced\" but thats what they told me)\n\nThe asthma predates my weight gain, but the cough does not.\n\nMy Doctor tells me the cough is being caused by my weight. I'm calling bullshit because my weight isn't seasonal, but the cough is. I did keto last winter and dropped down to like 240lbs, and I STILL had a cough. Skip ahead to this summer and 270lbs... no cough.\n\nSo am I right in assuming this doctor is full of shit, and that I should see another one? Like yeah, I get it. Being fat probably doesn't help the cough at all. But it sounds more like a seasonal alergy he could be helping with, instead of blaming it all on one thing that the evidence doesnt point to.", "subreddit": "fatlogic"}
{"post_id": "cqv41n", "created_utc": 1565899206, "title": "Does coffee make you lose weight?", "author": "junegum12", "self_text": "Im a skinny person i just wanna lose weight on my belly. Dont tell me to go to the gym because i have tried and i am still going from time to time. I want faster results. Is there any tips or tricks on what foods to eat because ive read up online tea and coffee makes you lose weight in general?", "subreddit": "fatlogic"}
{"post_id": "cqxr5q", "created_utc": 1565911020, "title": "I wish I looked older", "author": "turboshot49cents", "self_text": "I am 24 but look like I’m 14. Everywhere I go I get carded. Usually I take it in stride but sometimes it really gets to me. I just want to be beautiful in a more sophisticated way than just “cute” and “adorable.” What sane person my age is going to look at me and think I’m attractive? I’m about to start a job at a high school and I know I’m going to get mistaken for a student. How am I ever going to be taken seriously when I look like this? Not to mention, creepy men talk to me a lot, so how can I stay safe on the streets when I look so vulnerable?", "subreddit": "BodyAcceptance"}
{"post_id": "cr047a", "created_utc": 1565923008, "title": "am i being complacent if I’m alright with being chubby?", "author": "guy1234567892", "self_text": "Ive always had this problem with needing to be the prettiest I could be and for me part of that is being thin (my face looks better with less weight on it, but don’t get me wrong this isn’t a universal truth tons of ppl can be hot and not thin, 100%). but anyways I think it’s bc i have high standards for guys and i feel like i should be perfect so I’m worthy and I’m aware that’s shit but yeah. and now that I’ve recently felt better about myself it’s translated partially to being okay with being a little chubby but I feel like I’m being complacent or lazy if I’m good with myself like this? I dunno. I’m sorry if this is offensive I just want people to tell me what they think if it’s being lazy or if it’s alright I don’t know", "subreddit": "BodyImage"}
{"post_id": "cr25mi", "created_utc": 1565934792, "title": "How to get a good mindset before a trip home", "author": "Heather722", "self_text": "Hi! Newcomer here....this seems like such an awesome community...I'm heading out for a trip where I'll see people who haven't seen me since I gained weight.\n\nI was doing better with self love then put on 20lb pounds in new places... after already gaining 30. \n\nAlll I can think about is how they'll see me and I barely have enough clothes to fit. I'll try to go shopping....\n\nI'm trying to focus on empowerment but this has got me so down I'm worried about being distracted and anxious the whole time...\n\nHelp! Always plus size but never this size...", "subreddit": "BodyAcceptance"}
{"post_id": "cr3wgg", "created_utc": 1565947097, "title": "M16 My head looks like a burger", "author": "SpiceMercator", "self_text": "My head is wide but so short, my friends told me the only way to make it look bigger is to reveal my forehead by either brushing my hair up or cutting it shorter, I love long hair and I can't bear with the fact I can never have long hair going over my forehead like everyone else, people with big heads are lucky because a big head is common and can be ignored, but small heads are rare and are very noticeable and off-putting", "subreddit": "BodyAcceptance"}
{"post_id": "cr7q3v", "created_utc": 1565968444, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "crh1nm", "created_utc": 1566013260, "title": "Why", "author": "lili1223", "self_text": "Why don’t people see that the only reason I think someone is attracted to me is if it’s for a fetish? \n‘Normal’ sized people don’t have to deal with people liking ‘big girls’ at THATS why they’re comfortable putting their dick in you. \n\nI just wish someone was attracted to me and didn’t have to see my body. I already hate myself so much. I already am disgusted with myself. I already want to change myself. But people still can only be attracted to me if they’re a ‘chubby chaser’ \n\nI know everyone has their insecurities but fuck it’s like I’m wearing a sign that says ‘I already hate this part of me, pls only people who will take that part of me that I value least and take advantage.’\n\nSorry if this is any part rude or offensive I just had to deal with a guy say he just wants to see if he’s into girls my size and I felt gross", "subreddit": "BodyImage"}
{"post_id": "crnbo5", "created_utc": 1566054610, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cro0yz", "created_utc": 1566057810, "title": "[M22] I have a tiny head and it makes me really sad!", "author": "adalios", "self_text": "Hello everyone!\n\nI am 22 years old and I find my head very small, disproportionate to my body.\n\nI started repairing this about two years ago by simply looking myself in the mirror after I had my hair cut. I my hair longso whenever I shave it I feel extremely insecure and the thing that makes the situation even worse is the fact that I am getting bald.\n\nI'd like to know if someone shares the same feeling about their head size and how to deal with insecurity.\n\nthx!\n\n&amp;#x200B;\n\nPS: Another issue is that I am never knew someone with the same feeling about their own head, it really makes me feel an alien and more alone.", "subreddit": "BodyAcceptance"}
{"post_id": "crrxc8", "created_utc": 1566075848, "title": "Why are all dancers so skinny??", "author": "sojyonnie", "self_text": "This is just a random thought that popped into my head but that has actually been bothering me a lot the past weeks.\nJust why when you watch dance practices on YouTube the clear majority of dancers are super skinny, if not bony already. And I get that when you are dancing and maybe even do it professionally, your body grows leaner and you are fitter, but does that necessarily also mean not having much weight?\nI love dancing very much personally, even though I just do it as a hobby I take it seriously as it is almost the only sport i really enjoy. But seeing all these seemingly perfect society-approved dancer bodies is harshly discouraging... I even don't like to watch dance practices &amp; videos anymore bc of all the toxicity to my brain. \nI've tried searching up body positive dancers on Google, Pinterest &amp; YouTube, but I only found 2. 2! \nIt's not like your body type (mine's slim thick and small, btw) hinders you at doing what you love. But it just really suggests that the dancing community doesn't accept such principles and often sexualises the dancers even more than the Beauty Industry (!!). \nI just needed to get this off of my mind and of course I would appreciate if you shared your thoughts and experiences with me here.\nThough I am proud to call myself a dancer I have to say that these circumstances make me a whole lot insecure about myself and my body especially when dancing &amp; I am NOT proud, to call myself a part of the main dancing community as I would always feel at a disadvantage.", "subreddit": "BodyAcceptance"}
{"post_id": "crui7x", "created_utc": 1566089070, "title": "Books &amp; stories about eating disorders", "author": "Sue_a_cider", "self_text": "What do you guys recommend?\n[my experience is anorexia but I’m not adverse]\n\nI’ve been reading books more often because having a voice that’s not mine in my head but has similar thought patterns makes me feel less alone.\n\nEdit: Forgot to add\n\nI’ve also been reading people telling their stories on eating disorder forums for support organizations but they tend to be a lot shorter for obvious reasons - are there any other forums you frequent?", "subreddit": "BodyAcceptance"}
{"post_id": "cs0v45", "created_utc": 1566133057, "title": "Guy in a wheelchair", "author": "teammav41", "self_text": "Hi I'm 26 and am completely normal except I'm in a wheelchair. I do literally everything myself. I'm honestly tired of being treated badly by women because of my wheelchair. Can anyone talk to me", "subreddit": "BodyAcceptance"}
{"post_id": "cs7fan", "created_utc": 1566163907, "title": "I am just going to live the way I want to live", "author": "prudekaed", "self_text": "Through my whole life, I have struggled with my body. I was very big when I was pre teen and then I became anorexic through high school. After high school I gained about 200 pounds in 3 years, and then lost back to a healthy weight. I then had a one night stand and got pregnant and I gained 60 pounds while I was pregnant. Then after I gave birth, I shot back up the scales to 350 pounds as of last July. I then decided to lose weight again but it didn't work so know j have decided that I will eat how I feel like eating and I will weigh what I weigh and I will love my new self.", "subreddit": "BodyAcceptance"}
{"post_id": "csc3lq", "created_utc": 1566188705, "title": "[academic] [participants] INSTAGRAM AND YOUNG WOMEN'S BODY IMAGE EXPERIMENT (WOMEN 16-35 years of age)", "author": "rachelsummerfield", "self_text": "Hi Everyone   \nI am seeking participants for my fourth-year research project which is comparing how Instagram influencers makes women feel about their body. This project is supervised by Dr. Danielle Wagstaff. **I am recruiting women between the ages of 16 and 35 to participate in my experiment via email correspondence over a two-week period. You will be required to complete a short survey, interact with some email correspondence over a two-week period, then complete another short survey.** The total participation time over two weeks will be approximately 45 minutes. This research has been approved by the Human Research Ethics Committee at Federation University Australia. If you are interested in volunteering to take part in our study, please click the link below.\n\n[https://federationpsych.syd1.qualtrics.com/jfe/form/SV\\_0pMqVwVP6j0N3nv](https://federationpsych.syd1.qualtrics.com/jfe/form/SV_0pMqVwVP6j0N3nv)", "subreddit": "BodyImage"}
{"post_id": "cscnuc", "created_utc": 1566192256, "title": "help a gal out &lt;3", "author": "butterflybitch13", "self_text": "hey everyone :)\n\ni'm doing a speech (very angry slam poetry style) on body image for my english class and i'd really love it if anyone could drop a comment talking about their struggles for body image that i can use in my presentation. you'll be completely anonymous (aside from on reddit ofc) and it'd really help x\n\nthank you so much,\n\n\\-e", "subreddit": "BodyImage"}
{"post_id": "csgit2", "created_utc": 1566218336, "title": "Don't always believe people. Some of them are just mean.", "author": "Infinitexpo-end", "self_text": "Just yesterday a guy that I don't know  (we actually  took a class together from a year ago and I never noticed him) told me that he likes from  a year and he told me thar he found but me so beautiful and sweet but as he said he couldn't come and ask me out because he was jobless and kind of broke,  and now as he started working he feels more competent to be in a relationship, that guy was so sweet and we are having a date soon!  And also yesterday I over heard my cousin speak with my aunt as I left the room telling her how ugly I am and that I am disgusting.  \nMe being myself , self conscious and with low self esteem hearing my cousin's words broke my heart like why would you say that about me. Disgusting? \n\nObjectively speaking I'm not disgusting I'm sure... \n\nSo sometimes we should just not listen to some people.\nSome people are just mean and their negative remarks come from how bad they are.", "subreddit": "BodyAcceptance"}
{"post_id": "csgzbu", "created_utc": 1566220775, "title": "Advice for Body Dysmorphia?", "author": "abblepabble", "self_text": "Hello wonderful people of r/BodyAcceptance,\n\nI’m a 20 year old female that has an average build (5’6-5’7 at around 140) and I struggle so much with dysmorphia. I go away to school and tend to perceive myself as being much slimmer because I’m walking more, doing more, and eating less (due to time constraints and stress). When I got home from the semester for summer, I felt as though I gained weight. All my clothes fit the same, but I can’t knock that feeling when I look in the mirror of “your hips are massive, your stomach is massive, your thighs are too big.” Everyone around me (parents, boyfriend, best friends) reassures me that I have in fact not gained weight and that I look exactly the same. Not sure if this is the right place to get advice on body dysmorphia, but anything would help.", "subreddit": "BodyAcceptance"}
{"post_id": "cshemk", "created_utc": 1566222910, "title": "Meta Monday", "author": "GetOffMyLawn_", "self_text": "Selfie Sunday will be on Monday, September 2nd, that's Labor Day for us Americans, which is a holiday here. We will have a sticky for it then. \n\nWhat's on your mind?", "subreddit": "fatlogic"}
{"post_id": "csl5jo", "created_utc": 1566239262, "title": "Afraid to check my weight", "author": "moodydonut", "self_text": "Today I saw my weight for the first time in 3 years. I was horrified. Absolutely horrified. I’ve always been so scared of checking my weight. I thought that If I didn’t check, I could ignore it, pretend it’s still the same as it was 3 years ago. Am I the only one? Ive been working out everyday for the past 7 weeks. I was struggling to control my diet. Today, after I saw my weight Im so determined to starve myself. But I know that starving myself will only make me miserable. I hate how I look... I want to be able to wear sleeveless clothes without obsessing over my underarm fat... I wanna wear crop tops... But above all I wanna get rid of this idea that I look disgusting... help :(", "subreddit": "BodyImage"}
{"post_id": "csoeif", "created_utc": 1566253200, "title": "Puberty: How do I learn to accept my new curves?", "author": "ariii456", "self_text": "I’ve been very thin my entire life. I’ve also had a lot of issues with my body growing up because of this, which took a toll on my self-esteem and encouraged disordered eating habits. I eventually decided to accept being skinny and flat-chested, and worked my look around my body type as well as live a healthier lifestyle.\n\nNow I’m almost 21 and noticed that my bras weren’t looking right under my clothes, so I went to get fitted—note that I haven’t been fitted since I was 16 (my fault) but have gone braless or worn size S bralettes since then, so I felt fine, my bras were just turning raggedy and losing shape. Turns out that I’m no longer the 34A that I used to be, but a 32C! \n\nMy new bras fit perfectly and I definitely see the difference in my clothes. I’m still surprised that this is my size, because I look better (no more uniboob, I look more proportional), but different (boobs!). On one hand it’s cool, but I don’t know to adapt to my changing body—although I’ve had this issue for a while, getting my new bras today has really signified that for me. \n\nI feel like I just figured out how to embrace my twigginess when now I feel like I have to embrace my new (curvier) figure, and it’s scary—now that I’ve accepted the new bra size, I’m made to accept my wider hips, that I’m an hourglass and not a ruler/pear, as well as other changes.\n\n I’ve also experienced sexual assault and catcalling back when I was thinner, and although I kind of like my “new look” for myself, the new attention that I may get scares me (I’ve basically been smushing my boobs in sports bras and bralettes for a while-a bad look, I know).\n\nSo how do I cope? How do I go through yet another cycle of body acceptance?", "subreddit": "BodyAcceptance"}
{"post_id": "csortp", "created_utc": 1566254851, "title": "No more thrift store posts please", "author": "SomethingIWontRegret", "self_text": "We're getting several submissions a day for the same thrift store post.  It's been posted enough times, and the theme has been well mined out in the past.  Thanks for your cooperation.", "subreddit": "fatlogic"}
{"post_id": "cssdr2", "created_utc": 1566272722, "title": "tuberous breast deformity", "author": "barfinmyhair666", "self_text": "so. i am nearly seventeen and my breasts have been the same for basically 5 years. after doing research on tuberous breasts it seems that.. that’s what i have. they look very odd, i literally look like i have the chest of a girl who just started puberty. the rest of my body looks mature but.. my breasts look like they are frozen in time. i literally cry thinking about it. i don’t know how i can ever show my body. once i turn 18 i am old enough for surgery but. what would i pay with? i wonder if i should even talk to my mom about this. i hate my chest so fucking much", "subreddit": "BodyAcceptance"}
{"post_id": "ct0gdj", "created_utc": 1566313943, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ct1u3e", "created_utc": 1566319089, "title": "Intimacy / body image struggles", "author": "SimpleKale1", "self_text": "Hi, this will be my very first Reddit post but I'm super glad I found this subreddit (and other useful resources). A bit about myself, I (F, 28) am in recovery from EDs and while I got my eating fully under control, enjoy exercising and the feeling of being strong, refound my love for food and cooking, and see a therapist and a dietician, I still very much struggle with my body image. How do you handle being intimate with someone when you i) have zero sex drive and ii) you don't like what you see in the mirror?\n\nEDIT: I should have clarified that I live with my S.O. who has an active sex drive. Not being able to reciprocate in some way makes me feel sad and honestly angry about myself (i.e. \"why can't I just be normal?\").", "subreddit": "BodyAcceptance"}
{"post_id": "ctajrp", "created_utc": 1566354979, "title": "I have a problem... with loving myself...", "author": "mrs-sweetiepie", "self_text": "I love everyone. I love how everyone looks, whether they’re skinny, curvy, tall, short, busty, etc. I think everyone wears themselves perfectly. Everyone... except me. I want to love myself. Some days I do and some days, like today, I don’t. It’s always the day before I have somewhere important to be that I struggle with my looks. I sit there and I look up pictures of my really skinny friends, the ones my mom says I need to look like. I love curvy girls. Always have and always will, but my mom ingrained it in my head that other girls can be thick but I can’t. So, here I am looking up pictures of what to wear to a concert. I know that no matter what I wear though, I will not like what I see in the pictures. Me looking ugly next to all of my friends. And I love them, don’t get me wrong. I just wish I loved myself as much as I love them.", "subreddit": "BodyAcceptance"}
{"post_id": "cthdzx", "created_utc": 1566396565, "title": "Why?", "author": "lili1223", "self_text": "I have been overweight my entire life. I’m currently 20 and 5’  coming in at around 200 pounds. I’m trying to eat much healthier so I can lose weight but since I have hypothyroidism it has been a big struggle for me bc even on my medication I continued to gain weight. \n\nI have never liked my body. But more recently I’ve come to accept that people don’t like it either. As shallow as it is I know people judge based on looks and I know that people steer away from me because of my weight. People would like me more if I lost the weight. \n\nIt just sucks. I’m going to therapy on Friday so it should help. I just wish people saw how much I dislike myself so they could look past my body.", "subreddit": "BodyImage"}
{"post_id": "cti7rl", "created_utc": 1566400356, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "ctkxae", "created_utc": 1566412289, "title": "The perfect outfit", "author": "mrs-sweetiepie", "self_text": "Today I went shopping because I’m going to a concert tonight. I needed an outfit, or more like a confidence boost. I struggle with finding clothes so very very much, but have you ever found that one shirt on the rack and thought it was the most beautiful thing. Except you feel deep down that you don’t even want to try it on because you already think you know how it will look on you. Well, that happened to me today. Except I forced myself to try on the shirt, and it fit perfectly. It’s been forever since I had that happiness in a fitting room.", "subreddit": "BodyAcceptance"}
{"post_id": "ctyrwb", "created_utc": 1566486703, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cu7e6x", "created_utc": 1566526108, "title": "You have only one body. Why would you wate your time hating it?", "author": "jayharr9", "self_text": "Hello, my beautiful people,I came back with a thought that I had for a while and in the past days I was listening to Gettin Better with Ron Funches which was a delight and in the last episode he invited my favorite person in the world, Nicole Byer and they chatted about their experiences in terms of being bigger in the world and one of my favorite parts of the whole episode was when they've said that they love to be fat they workout on the regular but they love to be fat.  To be honest I feel the same way I love my body.  I love Every part of my body and of course, there are parts that I am not that happy but I accept them because that is who I am. Throughout my life, I've been through terrible shit my life has been a constant struggle.  From sexual violence, to losing all my belongings to a hurricane twice in my life my body has always been there and it is the only thing that I got and is the vessel for my soul why would I hate it?  Why would I go into the mirror and strip and say negative stuff about myself?  The other day I wore a shirt which I truly liked and the shirt made my nipples look hard as hell and being a guy with man boobs you always are self-conscious of that but in the same second I thought to myself I am no longer in high school, there are no bullies here.\n\nI bought this shirt with my honest and hard work why don't I wore it with pride? At that moment I knew I came so far from being a tiny fucking person to the man that I am now.  A man who's not afraid to occupy space anymore.  A man who loves himself not because of what's on the outside but for what's on the inside.  I think that is what they meant when they said:  It gets better.  With time you stop giving a fuck on how people see you or perceive you and you start enjoying life because this is a one chance thing only and no one should waste there time hating themselves.  Wear those jeans, use that shirt, buy that swimsuit and feel like the most beautiful person in the world why? Because society will make you feel like the garbage they will try to make you feel like you are undeserving of love and respect and that is not true.  Everyone deserve love and respect in this world no matter the size of the belt they use.  Stop believing the lies that has been told to you in media that the only reason that people aren't giving a fuck about you is because you're fat I've seen bigger people constantly falling in love and being truly happy because they know how to carry themselves and because they know that being fat is their asset, not their liability (for my accounting people out there)  If you are struggling with any type of dysmorphia or body issues disorder just know that you are not alone.  You are valued and you are loved. Reach out and look for like-minded people who are more than willing to help you it's not an easy battle but is a battle that with the right knowledge and work you can win.", "subreddit": "BodyAcceptance"}
{"post_id": "cubi6e", "created_utc": 1566552689, "title": "My SO hates her body and the way she looks, how can I help her?", "author": "azkaelleon", "self_text": "I don't know if this is the right sub or not, of not I'll remove the post and keep looking.\n\nAnyway, my girlfriend is really hard on herself about the say she looks and her body in general. I try to tell her almost daily that she is beautiful and that she shouldn't be so hard on herself but she mostly just scoffs att my compliments and tell me I'm weird for thinking so it just flat out disagrees with me. It's really making me sad aswell because I see how she struggles with it all.\n\nDoes anyone have any advice on what I can do to help her love herself more? \n\nI tried to get her to tell me 3 things she liked about herself every day, just anything at all really. She doubted that she could do it though and we agreed that she would try to tell me 1 thing every day instead. I figured that if maybe she would start to find the things she liked instead of just seeking what she dislikes everytime it would gradually be better, but I don't know.", "subreddit": "BodyAcceptance"}
{"post_id": "cuf95c", "created_utc": 1566573354, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cuj1zp", "created_utc": 1566590393, "title": "Help? I guess?..", "author": "shaharh41", "self_text": "M 18 I'm 178 cm and around 56 kg I work out 6 days a week (around 45 mins) and eat healthy. I'm like 10 percent body fat (according to the internet ¯\\_(ツ)_/¯ )\nEveryone tells me that I'm skinny and look good and some people talked about my abs but I hate how I look. More than that I obsess over it, I put my hand on my belly and check if it's flat with my pelvic region, I grab my belly from the side, I flex and try to grab belly fat and tit fat or try and feel the muscles below, I lift my shirt to check if I'm fat at every mirror all the time and I dislike what I see most of the time. There are times where I like what I see and even high five myself in the mirror and smile, I do like my body sometimes and it feels so awesome when I do. \nBut most of the time I don't, and I hate obsessing about it.\n\nAny tips?\n\nBTW some of this may be caused by my OCD or the fact I used to be fat (like maybe 75?)", "subreddit": "BodyAcceptance"}
{"post_id": "cukwvs", "created_utc": 1566598952, "title": "REQUEST: Websites, accounts, or literature for accepting your appearance that have nothing (or little) to do with weight.", "author": "moistarticle", "self_text": "I hope this doesn't count as weight talk thats against the rules, but it's relevant information. I've almost always been slightly underweight due to health issues. Most of my insecurities have nothing to do with weight at all, or sometimes I'll be upset about being thinner than I'd like. I struggle to accept my facial features, my scoliosis and matching warped ribcage, my permanently disfigured collarbone, a weird hemangioma I was born with, the overall shape of my body, etc. \n\nI feel like a mutant most days. I don't relate to talk about how to stop dieting, which is most of what I can find online. It actually makes me feel lonelier when I try to find resources or support networks.", "subreddit": "BodyAcceptance"}
{"post_id": "cumzuz", "created_utc": 1566609566, "title": "Know your value.", "author": "jayharr9", "self_text": "Hello readers if this beautiful subreddit \n\nI hope that everyone here had an amazing day mine was a bit boring.  I stayed in bed and basically just catch up on all the podcast I was missing.  But anyways I came back because I love writing and more than that I like to write to you guys because you are actually supportive and really nice.  Now to the point because I got kinda sidetracked.  This is going to be a short one.  Know you value people.  You are amazing and beautiful why won't you show that to the world.  People are needing a light like yours to shine in their lives.  If you are good at something share it.  If you love something, chase it.  There's not a set of rules and there's no limit on what you can do.  There's no limit on what you can achieve and there's no ceiling that can stop you.   Keep being positive I know that is hard and life might not be fair but I'm so proud of you you came a long way and you crushed a whole week.  A whole new week.  Keep being you, keep lovin yourself and keep dreaming.", "subreddit": "BodyAcceptance"}
{"post_id": "cup302", "created_utc": 1566621860, "title": "Im trying to move on, but sometimes my insecurities will hit back.", "author": "TurningBlueArrows", "self_text": "I (M20) have for a long time been quite insecure and somewhat hate my body and my genitals. I posted pictures of my body on r/normalnudes to get people's opinion and stuff, and i have received a ton of support and positive messages. From then on, i kept telling myself to stay positive and just accept myself, but sometimes the negativity just keeps coming back. I keep thinking \"I'm too skinny for anyone to like me, im not tall enough, or my penis is not big enough.\" The body part that im most insecure about is my penis. For a long time, i keep telling myself my penis is average (5.5 ish inches.) and that i would be able to please my future partner, but the truth is im afraid. I've never dated anyone before, but i have had sex like maybe only twice. (Both times were paid) I'm afraid that my penis is not good enough to pleasure my future partner or she might make fun of it by calling it small or whatever. I'm afraid that one day when i do date a woman and we have sex, i'm not as good as the previous guys she slept with. I have all these fear, uncertainty, and doubt going on in my head and although i try my best to forget about it and stay positive, it still finds a way to haunt me. I dont want to have these thoughts anymore, but it keeps coming back and i'm really tired of this whole emotional rollercoaster.", "subreddit": "BodyAcceptance"}
{"post_id": "cuujkq", "created_utc": 1566659454, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cuy18w", "created_utc": 1566675561, "title": "Cellulite", "author": "lovenpizzza", "self_text": "How do I get rid of cellulite, they make me feel so self conscious 😩", "subreddit": "BodyImage"}
{"post_id": "cuzdoz", "created_utc": 1566682177, "title": "Strech marks", "author": "Tip_Mou", "self_text": "What do yall think about strech marks?", "subreddit": "BodyImage"}
{"post_id": "cv89e6", "created_utc": 1566738344, "title": "Recently I’ve been feeling bad about myself", "author": "EmiTandborste", "self_text": "I’ve always been thin which is good I guess, but after puberty I grew to 5’7 which is tall for my age (16F). So basically, I turned into this lanky, too thin, and too tall teenager. When my friends tease me about it I laugh and I think it’s funny because they understand me and their jokes are clever. When strangers comment on how thin/tall I am, I get really annoyed and self conscious though, like ‘I know, you don’t have to comment on it.’ I just wish I looked sort of normal/like all the other girls my age.", "subreddit": "BodyImage"}
{"post_id": "cvihdu", "created_utc": 1566789082, "title": "I dont know how to feel good about myself", "author": "HiddenMaruchan", "self_text": "Hi, new to this sub, Idk if this goes here, but here i go.\n\nIm 22, a rather skinny guy (1.70m -75 kg ish) but almost every time i feel my body is downright ugly, i have kind of a belly going on, my arms and back are too skinny and that makes me feel less masculine in general, also my physical condition is absolute garbage.  I have a very unhealthy livestyle, i spend nearly 70% of the day sitting and my only real exercise is walking around whenever i go out or for work. \n\nI KNOW i have to begin exercising, the thing is i only exercise when im feeling good with my body (which is aroun one or two times in 3 months) the rest of the time i feel like i dont deserve to look good, and be healthy. I see jacked guys on social media and want to be that, i want abs, and a broad back and biseps, but i feel, again, like i dont deserve that, and lack the willpower to overcome that.\n\nThis also makes me EXTREMELY insecure, i have a girlfriend, we ve been together for the past 3 and a half years, she likes highly muscular guys and i feel like she just does not like my body at all, and is constantly comenting on their friends bodies look \"nice\" and never makes me compliments or anithing like that. \n\nIdk if all of that is normal, or is a product of my insecurities, but i want to have a body that she could like, and i couls like, but cant bring myself to accually doing it. Some people told me to first accept myself before start doing exercise because if its something psycological ill never stop feeling like that even if I improve my looks.\n\nWhat should i do? what could i do? I dont expect to found the holy grail of self love in here, but i think i just want to feel a little understood.\n\n&amp;#x200B;\n\nBtw, sorry for my bad english, hope its readable...", "subreddit": "BodyAcceptance"}
{"post_id": "cvimaz", "created_utc": 1566789932, "title": "I'm not ok with my body, but I reserve the right to set my own goals.", "author": "AoifeSilentwing", "self_text": "Tell me something. Why do people's feelings about other's bodies have to be made known? Its valid to have those feelings, to express them even. But why get upset when the subject of those feelings doesn't change their body to assuage your feelings? My significant other keeps making comments about how my goals aren't ambitious enough.", "subreddit": "BodyAcceptance"}
{"post_id": "cvjui8", "created_utc": 1566797765, "title": "Can’t find confidence as a girl with broad shoulders/no curves", "author": "rottenpaints", "self_text": "I’ve been struggling a lot with my confidence lately and honestly feel very stuck. I’m 17 years old and around 5’9, and have very broad shoulders and a square body. The average shoulder width for women is 14 inches while mine are about 20. My friends all know me as a super masculine chick because I look better in men’s clothes so that’s what i wear, but i want to look feminine. However, every time i put on a dress or a skirt or other “feminine” clothes, i feel stupid because of how my body is shaped. Even though I’m chubby (190) i have no curves, just an unfortunate protruding belly, and nothing i wear makes me feel pretty or delicate, just like a linebacker in a tutu. I hope this doesnt offend anybody but i just feel like i dont have a very feminine body and i know its not a big deal but its hard to cope with. Everybody tells me to just forget about it, just love myself but that feels sorta dumb to force myself to love something i hate.", "subreddit": "BodyAcceptance"}
{"post_id": "cvp41n", "created_utc": 1566831167, "title": "MetaMonday No Stupid Questions", "author": "maybesaydie", "self_text": "Ask the community about weight loss, maintenance, calorie counting tips or anything at all to do with fatlogic. Please, no rants or medical advice.\n\n\nSelfie post is next weekend! Get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "cvr0e5", "created_utc": 1566839717, "title": "Body image 31 F- Tired of comparing myself to other girls and feeling not enough", "author": "PiscesJoy", "self_text": "Does anyone ever get all done up to go out and feel really good about yourself looking in the mirror before you leave and then when you get there you start comparing yourself to other people and suddenly feel extremely ugly and ashamed and like you want to just go home and your whole mood changes? I went to a concert last night (I live in LA, so going anywhere here is like going to an Instagram influencer/model convention) and all these perfectly tanned girls with perfect bodies and long thick flowing hair wearing short shorts and cowboy boots and I’m looking around and feeling like an old maid all of the sudden. I’m 31 and probably comparing myself to 20 year olds but in the moment not taking into account they’re a decade younger than me and even if they’re not, why can’t I just focus on myself and having a good time at the concert. My anxiety all of the sudden runs rampant looking around at everyone and feeling not enough. I start thinking “ugh I need a tan, should I get a nose job? I need to grow out my hair, why did I wear these jeans, I should have worn shorts, but my legs wouldn’t look as good as these girls in shorts, I need to work out more, how do they have such smooth skin? Why is my skin not that perfect? Etc etc etc” ’m so tired of this way of thinking and having these petty insecurities get in the way of me living my best life and enjoying fun activities. Just wondering who out there relates and if anyone has any advice on how to stop comparing and still feel beautiful on my own (the way I did before I left the house) no matter what anyone around me looks like.", "subreddit": "BodyImage"}
{"post_id": "cvruaf", "created_utc": 1566843419, "title": "Do you avoid mirrors?", "author": "sirinkale", "self_text": "Hi everyone\n[Posted with mod permission.]\nI'm writing an article for the Guardian newspaper which is about people who avoid looking in mirrors - whether for body image issues, or because of anxiety.\nI'd really love to chat with UK based case studies who could chat about why they prefer to avoid mirrors - I'd be looking for a phone interview, cannot do interviews via Reddit.\nIf you'd be up for chatting with me my email is sirin.kale.writer@gmail.com or you can message me on here. Happy to answer any qs you may have and also to provide evidence of my press credentials .\nThanks\nSirin", "subreddit": "BodyAcceptance"}
{"post_id": "cvtwku", "created_utc": 1566852565, "title": "35 male with gastric bypass wants to post pics for feed back", "author": "pureconfussion", "self_text": "When I was 19 I weighed 375 pounds and in my early 20s I lost about 175 pounds. I’m 6’3” and about 200lbs  I’ve struggled with my self image since losing the weight. I now go to the gym every day and trying to build muscle but it weirds me out that I am far more attractive to the human race than I give myself any credit for or believe. It has been a never ending battle to deal with Waymore attraction from the opposite sex the I know how to handle so I’m thinking maybe to try to address this and gain some sort of perspective I thought I could post some pictures of myself in swim trunks on a roast me sub or body image sub to get some sort of feedback both super negative and positive to try to get a grip on my beliefs of how I look. Does any one have any sub recommendations where I could post a picture in the appropriate sub and get feedback?", "subreddit": "BodyImage"}
{"post_id": "cw5s4k", "created_utc": 1566918645, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cw7eiv", "created_utc": 1566925881, "title": "I can never find stuff in my size", "author": "TheOceansHaveOrgans", "self_text": "I’m a size zero and when thrifting and shopping at regular stores I feel awkward and child-like for not being able to fill out tops and jeans. Advice?", "subreddit": "BodyAcceptance"}
{"post_id": "cw9nut", "created_utc": 1566935941, "title": "Brown eye positivity doesn't help me at all, think about blue eyes on a daily basis", "author": "throwawayidsh9", "self_text": "I even had my eye*lashes* appreciated, but not eyes. I had several people say that my eyelashes are beautiful, which to me means that my eyes are sufficiently ugly to deflect attention to eyelashes. And for the reference I didn't do makeup.\n\nI spent several months looking up brown eye positivity and finding beautiful associations with brown color, but it doesn't help. Something just doesn't feel right about me having brown eyes. I even tried calling it \"honey\" or \"caramel\" or \"dark orange\" or even some hexadecimal code or making up some fancy labeling instead of brown, but I still can't be content.", "subreddit": "BodyAcceptance"}
{"post_id": "cwdqdu", "created_utc": 1566954948, "title": "Do we deserve love? (The stigma of dating in plus sizes)", "author": "jayharr9", "self_text": "The other day at my job and let's say I do customer services.  I was helping a client get through a transaction and when I've finished helping him one of my bosses who's puerto rican like me and we are a very sharing group of people so she told me you were checking him out,  I corrected her and said that he was attracted to skinnier men and I am attracted to bigger bodies to which she replied with a laugh and she couldn't believe the fact that I liked bigger men.  Which was literally the first time that someone had a negative reaction to my taste in men and it doesn't bother me says a lot about her. Don't get me wrong is not a fetish and is not definitely a feeding thing I just find bigger men beautiful. \n\nDating bigger people is somehow shameful in the eyes of few.  We are instilled violently with the image that the only way to be attractive is to be skinny, tall and white and everything outside that is wrong and ugly.  On the contrary in porn searches BBW and BBM rank on the top so there's an audience for big bodies. What is the hold up?  Why dating people that score a bit more in the scale have to be a taboo.  \n\nIn conclusion I always remember the words of a friend of mine when he said:  Gays fucked the chubbies but marry the hunkies.  This is kind of a rant kind of a rambling. I tried to make it as shorter as I could. Thank you guys for your compliments and your kind words they make my day go much happier.", "subreddit": "BodyAcceptance"}
{"post_id": "cwehaj", "created_utc": 1566958649, "title": "Cried in front of my doctor when he brought up my BMI and told me “just set a goal and consume less calories”", "author": "Corinvincible", "self_text": "I had an appointment today that I have been waiting for for 3 months while dealing with pulsatile tinnitus (whooshing sound in my ear). My new ENT specialist and I spent an hour going through all kinds of tests and questions. At the end he off-handedly said, “what is your BMI?” and then figured it out for me while I said, “I know it’s high...it’s in the obesity range...” and then he started telling me that even if I lost 20 or 30 lbs. I would be in the overweight category. He then said that I should set my goal and not focus on exercise but, eat less than I expend, it’s a simple math equation, etc. I play tennis very aggressively three times a week and walk 30 mins a day to work and back. I broke down crying in front of him because, I have felt bad about my body since I was 13 and in the last five years I have felt pretty good with my curves. I’m 38 and it sucks to melt down in front of a stranger because, I feel so broken by the constant conversation in my own mind everyday about my body coming back in under a minute today. The rule = health isn’t body image on this sub, so not discussing that aspect of a health professional’s job here -- just sharing and knowing that others might have felt this way is why I’m posting. How do you get back out of the shame pit when you fall back in?", "subreddit": "BodyAcceptance"}
{"post_id": "cwm4ry", "created_utc": 1567005113, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cwsnec", "created_utc": 1567034691, "title": "how do i love myself", "author": "haleeyxx", "self_text": "hi,\nso for years now i have never been happy with my self. i am very unhappy with my appearance and even sometimes unhappy with just the person i am. i am very self critical and very insecure. i compare myself to other women constantly. i have been in a relationship for awhile now and sometimes i feel like it gets in between us. he has some gal friends that’s he’s very close with and i’m okay with it but every time they come up i can’t help but think of how much better or prettier they are than me. and then i always ask myself why he’d rather be with me. and just start to worry and over think. i just always am so unhappy with myself. i never feel pretty or good enough. and i compare myself to literally every other woman out there. i’ve struggles with this for so long. i just want to be able to love myself, be confident, and not worry so much when it comes to other women and constantly over think my relationship just because i’m insecure. \n\nplease help, i need advice. i’ve done so much research and talked to people and i’ve done everything and nothing seems to help.", "subreddit": "BodyAcceptance"}
{"post_id": "cwy22w", "created_utc": 1567067595, "title": "Never happy with my weight", "author": "throwawayxxx42069", "self_text": "For starters, I’m a young woman who is 5’7” and at my skinniest weighed 140, and my heaviest is 180+. Right now, I am sitting at about 170-175 and am completely miserable. When I was at my thinnest I was ALSO miserable (my large boobs had deflated and I had a distorted view of myself, diagnosed body dysmorphia). Maybe I’m still suffering with BD but it actually feels impossible to be happy with myself. It’s annoying because I know none of my problems will be solved my losing weight but I still feel this incessant need to be thin. Ugh. Sorry, it’s 1:30 am here and it’s been a shitty night. Can someone give me pointers for how to deal with weight gain and body positivity?", "subreddit": "BodyAcceptance"}
{"post_id": "cx144z", "created_utc": 1567086221, "title": "I have a high sex drive but I am too ashamed to be naked in front of my partner.", "author": "mismatchmittens", "self_text": "I feel so frustrated and confused. There are times when my (25M) partner initiates sex and I feel too awful about my body to go through with it. We have been together for almost 7 years and we live together, and so it's not like he hasn't seen me naked before.\n\n\nMy weight has fluctuated up and down since the beginning of our relationship and I sure am not as thin as I was before. Ive struggled with disordered eating in the past and am certain I have some form of body dysmorphia. On top of this, I have a very boyish-shaped body. I am very short, broad shoulders with no hips, butt, waist or boobs. I have some muscle but I'm certainly not shredded. My quads and calves are large for no reason (blaming genetics) and I struggle to find pants that fit properly. I try to take care of my body so I work out and do some cardio but I still absolutely can't stand the way I look. I end up wearing a lot of baggy clothes to cover myself up because I am so embarrassed, also because it's easier to wear oversized things than to find clothing that really fits. I recognize the body types and women he thinks are hot or beautiful and I am nothing like them.\n\n\nMy partner initiates sex often and there are times where I have to say no because I am feeling particularly ugly, ashamed, and uncomfortable in my body. He counteracts with comments like, \"I love you the way you are\" or \"I still think you are pretty\" and reassures me that he finds me attractive and comments on my legs. By this point, I am very conflicted and feel like I'm being lied to just to get in the sack. I know I have a high sex drive (especially with the current medication I am taking right now) but a lot of the time I need to say no because I am embarrassed and ashamed of my body. If I go through with it, you best bet I won't be having a good time because all I would think about is how ugly, fat, and unflattering my body looks from his point of view.\nI am very very frustrated and torn.\n\n\nHas anyone ever felt this way? What can I do to feel less like this? \n\n\n\n\nTLDR: I am too insecure about my body to have sex with my long term partner who has seen me naked many times before.", "subreddit": "BodyAcceptance"}
{"post_id": "cx27wr", "created_utc": 1567091500, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cx52zs", "created_utc": 1567104520, "title": "One for my fellow girls here regarding cellulite.", "author": "uKaty", "self_text": "Okay so I’ve gained 2 1/2 - 3 stone since leaving school (6 years ago) so I’ve obviously gained a lot of cellulite on my legs. I don’t ever dare wear outfits that reveal anything above my knees, I don’t by any means think I’m severely overweight (I’m a UK 10-12 in clothes) however the cellulite on my legs prevent me from wearing pretty dresses/shorts or whatever. \n\nSo on a serious note I’m just wanting to know how to get my confidence back and how people have learned to deal with it. Do we think I’d go outside with a dress on and people would even take notice of it and think ‘ew, cellulite sally’ 😂 or am I just being very paranoid about something people don’t care about? \nThankyou ❣️", "subreddit": "BodyAcceptance"}
{"post_id": "cx79id", "created_utc": 1567114306, "title": "Always remember to cleanse yourself from toxic people in your life.", "author": "jayharr9", "self_text": "Very often we find ourselves being put down by someone or made fun of by that \"friend\".  We all have that person in our life it can be even a relative that just cannot wait to make that snarky comment that will spike your anxiety or that remark that when you hear it triggers sadness.  Get those people out of your life.  Take an active role in your life and let them know about their bullshit behavior.   Don't let absolutely no one dictate your value and treat you less than what you deserve.", "subreddit": "BodyAcceptance"}
{"post_id": "cxhob1", "created_utc": 1567175243, "title": "I was body shamed by my hand surgeon", "author": "singamelody1987", "self_text": "Yesterday I saw a hand surgeon for a cyst on my finger. We spent a small amount of time talking about the cyst(which ended up in us scheduling a surgery to remove it) and the majority of my time there was spent listening to the surgeon harp on about my weight. Sorry if this is kind of rambling, I'm still really upset at how the appointment went.\n\nWhen the nurse was taking my blood pressure she went to her desk and got a bigger arm cuff and said \"I call this my curvy cuff.\" I have never EVER required a bigger blood pressure arm cuff, the regular ones fit me fine. She had to wrap this bigger one around my arm like twice because it was too big for me. \n\nAfter that I was brought into the examining room. The doctor spent maybe 5 minutes looking at my cyst and asking if I wanted it removed. After we agreed on a surgery date, she began by asking if anyone has ever talked to me about my weight. When I said no she then began to give me diet tips, telling me I should start eating more veggies and stop drinking soda/eating fast food. Little did she know, I go to my local farmer's market every weekend and load up on fresh veggies, I don't drink soda, and my husband and I eat fast food MAYBE once a month...which I ended up telling her. She then asked how I sleep at night and I said on my stomach....to which she replied \"oh wow, you're able to sleep on your stomach?\" She then said she would be right back and left the room. I sat there wondering what the hell any of that had to do with getting a cyst removed on my hand. She came back with an iPad in her hand....she looked up weight loss tips and how to deal with my GERD(which I've had since high school when I was 120 pounds.) She told me that it was entirely possible to lose 5-10 pounds before my surgery(in less than 2 weeks) so that I would be more comfortable laying down during the procedure.\n\nThey also repeatedly told me that they would have to do the procedure in their office under a local anesthetic instead of at the hospital where they can put me under because \"the hospital probably won't put you under because your BMI is too high.\" This was a weird statement to me because from what I've heard, these types of procedures are done in office without putting people under anyway. To me it was kind of a way for them to say \"see how difficult your weight makes things?\"\n\nTo top it all off, before I left the nurse told me I shouldn't get my nails done anymore because it's not good for me. Silly me, I thought I was going there to get a cyst looked at. Nope, turns out I went to get unsolicited life and health advice that had nothing to do with the issue at hand.\n\nTLDR; Went to a hand surgeon, scheduled surgery to remove a cyst from my hand, majority of the time was spent by the doctor telling me I'm overweight, making false assumptions about my diet and giving me diet tips, and then the nurse told me getting my nails done is bad for me.", "subreddit": "BodyAcceptance"}
{"post_id": "cxiaah", "created_utc": 1567178049, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cxjqwb", "created_utc": 1567184608, "title": "Too hairy", "author": "throwzawayz37", "self_text": "No other guys appear to be as hairy as me. I can't stand it, but I've had to come to terms with it. I started this throwaway exactly to throw myself out of it and talk about it. \n\nI hate how it's increasing as I get older, and that's just the start of my lack of acceptance and the start of the issues. Save for getting laser removal I'm stuck with it and even the odd waxing every few years just makes my skin red and sore and spotty and then the hair is back two days later anyway. \n\nAny other hairy as fuck dudes out there? Any hairy as fuck ladies? Anyone wanna go back to caveman times so we can be the pick of the bunch?!\n\nBleurgh.", "subreddit": "BodyAcceptance"}
{"post_id": "cxwmwn", "created_utc": 1567264248, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cy0cem", "created_utc": 1567282867, "title": "about BDD", "author": "sojyonnie", "self_text": "anybody else here having BDD? if yes, feel free to share your experiences, thoughts and ideas abt the matter bc i am having a major fallback and can need some inspiration... \nthat feeling of complete and utter torture is killing me", "subreddit": "BodyAcceptance"}
{"post_id": "cy2alq", "created_utc": 1567292319, "title": "How to deal with thoughts that you aren’t attractive enough to keep your boyfriend satisfied even though he reassures you otherwise? *NSFW*", "author": "k8marie_", "self_text": "Sorry if this is a bit jumbled, I’m having a hard time putting my thoughts on this into words. \nMy boyfriend recently told me that he sometimes goes on some NSFW subreddits like gonewild, etc.. I’ve never had an issue with porn as I think it’s normal and something the majority of the population does. My main issue stems from my own insecurities. All of the top posts on those subreddits have the exact same body type and it’s hard not to compare your own body when you know he finds that body type attractive. I feel like I can’t compete or even begin to compare to them because I have a completely different type of body. I consider myself to be midsized, size 12-14 gal and I’ve always struggled with accepting my body for how it is. My boyfriend reassures me that he thinks I’m beautiful and he says that he loves my body but I can’t help but feel like he would much rather prefer if I had a flat stomach like the girls on those subreddits. He tells me not to compare myself to those girls because it’s just porn but that’s easier said than done. Any tips on how to get past this?", "subreddit": "BodyAcceptance"}
{"post_id": "ckipiy", "created_utc": 1564628943, "title": "Anyone skinny fat with a belly?", "author": "Kupcake_123", "self_text": "Hi guys recently I’ve gained some weight which has mainly gone to my waist area. I’m a skinny petite girl with small breasts that have gotten a little bigger. My main insecurity is my stomach now.  It had a little fat but has gotten bigger. \n\nI wish I could gain weight in other parts but if I wanted to I’d have a huge belly. Is there anyone with this same body type? I feel like most people think petite equals a flat stomach. I want to exercise and eat healthy but I don’t want to lose some of the fat as it kind of suits me except my stomach.", "subreddit": "BodyAcceptance"}
{"post_id": "ckjthy", "created_utc": 1564635653, "title": "What are your favourite body acceptance instagrammers?", "author": "rdrbangel", "self_text": "I personally love following people who inspire me to accept my body as it is and looking to see if you have any recommendations?\n\nMy favourites are:\n\n@lo.visa\n\n@mangedebauch\n\n@ashleighchubbybunny\n\n@dadcomplex\n\n@naomishimada\n\n@kelleemoran", "subreddit": "BodyAcceptance"}
{"post_id": "ckpph6", "created_utc": 1564672619, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "ckquii", "created_utc": 1564677793, "title": "My friend(15F) is getting a nose job soon", "author": "AnAnnoyingcoconut", "self_text": "Ok so I have a close friend that was constantly bullied and judged for her nose her entire life. Recently she told me she'll be getting a nose job next year. I was extremely shocked considering her age. I was even more shocked when she told me her mom suggested it.( She said that she had a breakdown and her mom asked her what's the problem and she said she hated the way she looked specifically her nose and her mom was just like that's fine you can get a nose job) Don't get me wrong I think everyone should be able to do what they want with their bodies, but I feel like my friend never got the chance to love herself since she's so young. She already visited the surgeon and saw how her nose would look and everything is pretty much planned. I know her and I know she is doing it to please others rather than myself. I don't know what to do honestly.", "subreddit": "BodyAcceptance"}
{"post_id": "ckyfzx", "created_utc": 1564714930, "title": "Wearing a bikini..", "author": "BirdieRex", "self_text": "I'm 5'2 and weigh 191lbs so I'm on the chunky side. I'm going to the beach tomorrow and I really want to wear a bikini. I feel so confident when I think of the idea but when I try it on and look in the mirror I get so unsure. I try not to compare myself but it's so hard. I want to say fuck it and just wear it!! But I'm scared that I'll get stared at. I just need that extra boost to wear it .", "subreddit": "BodyAcceptance"}
{"post_id": "ckzj6n", "created_utc": 1564721531, "title": "Trying to accept size due to medical condition.", "author": "captainraccoonotr", "self_text": "So I hope I’m not breaking any rules. I apologize for the novel. \n\nI’m genuinely trying to learn that I need to learn how to see the good physically in me, because it’s becoming really unhealthy if I don’t. \n\nI was never super skinny, but I’ve always been in a healthy BMI range and I’m naturally a more active person with a light diet from my love of running and hiking for photography, and being raised on a Korean diet with a Korean mother. \n\nBut I have developed 2 autoimmune disorders and 1 of them requires intravenous steroids with my medication every 3 weeks. I’ve gone from about 125lb / ~ 57kg to ~250lb / ~114kg \n\nIt’s double my size now. And I can’t necessarily stop it all. Steroids both make me eat more (and when I don’t eat a larger amount I physically shake and get faint) and just also puffs me up. I still run daily, and I keep what has turned obsessive notes on my diet and exercise. My immunologist and rheumatologist have both told me my blood pressure is low but good, and I’m in good physical shape so I need to slow down. They’ve referred me to a nutritionist who’s trying to encourage me but all medical and health professionals are saying the weight will likely stay on, and it’s okay as long as I’m exercising daily, not stuffing myself with cake and fast food, and I’m sleeping and hydrating properly. \n\nI have a partner who keeps swearing I’m super cute, I look great, I have a girlfriend who tries to help me find clothes that might flatter my size more and make me feel confident. \n\nBut I can’t. I just can’t. I’m trying therapy, I am now doing kickboxing three times a week, yoga every morning (mindfulness yoga as a part of therapy), and I still run. I don’t like to go outside at all anymore again and I was agoraphobic for years, I cry when I wash my face to put on makeup for work, just wondering what inspires people to be positive big or small if they’re really working on their health. \n\nLots of love.", "subreddit": "BodyAcceptance"}
{"post_id": "cl5fo8", "created_utc": 1564758965, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cl7efk", "created_utc": 1564768028, "title": "Old photos are haunting me with disruptive thoughts", "author": "maria_honeytea", "self_text": "I grew up with a mom that made me feel fat and unaccepted for a long time because I wasn’t built skinny like her, I got my dad’s family’s genes of thick muscles and curves. She has seen the error of her parenting and we have a much better relationship now. But, she sent an old photo from 10 years ago of my family at Disneyland in our family group chat reminiscing about our fun vacation. I was 17 at the time and hated myself and my body. I am 5’2” and was 140-145 lbs at the time. Looking at it now I’m like “damn, I was absolutely gorgeous”... I’m now 185 lbs and this one photo has completely disrupted my day. I can’t focus at work because I feel the agony of “why did I waste all my time hating myself when I was fine.” I just wish I could accept my body as it is but it’s hard when I’m comparing it to myself at 17.  I want to talk to somebody about it but my body issues have been a long time problem and I don’t want to bother anyone with this but I feel alone and emotionally overwhelmed. I guess I’m grieving all the years lost of not loving my body. Feeling so undeserving of love and yet I don’t know who I can talk to about this. Sorry if this is too long I just can’t stop thinking about this photo and feeling like the ugliest (and most unappreciative) thing alive right now. Does anyone else experience this and how do you deal?", "subreddit": "BodyAcceptance"}
{"post_id": "cl99i6", "created_utc": 1564776757, "title": "How can I stop comparing my body to the bodies of other women ?", "author": "yeepiyay", "self_text": "Hi people, first time posting here !\n\nMy problem is I've become obsessed with the way my body looks to the point where I can't help but compare other women to myself: I see good looking women and can't help but think do they have better curves, a flatter tummy or bigger breasts, etc.\n\nI know it sounds awful but I'm working on this, it's just become hard not to literally analyze other women. There are times when I simply don't think about this but then it comes back and idk I just feel like a terrible human for doing that...\n\nDoes anyone have some tips or advice on how to stop thinking about others ? I don't expect life-changing advice but any positive response would feel good ❤", "subreddit": "BodyAcceptance"}
{"post_id": "clenpk", "created_utc": 1564806612, "title": "How do you stop thinking about hurtful comments people have made about your appearance?", "author": "elizabitch0", "self_text": "I’m so glad this community exists and it’s been really helpful to read the reaffirming things that people post here. That being said, does anyone have specific tricks for how to stop thinking about/reframe hurtful things people have said about you looks? The one I’ve been fixating on lately is I remember several years ago I was looking through my graduation pictures with my family and my mother said, in front of everyone, “do you want me to delete the ones where you look 9 months pregnant?” This felt really degrading and I haven’t been able to get it out of my head the last couple days. Usually I’m pretty good about being confident but occasionally I’ll get stuck in a cycle where I’ll remember something like this and hate myself and my body for a couple of days. Any advice on how to avoid these occasional spells?", "subreddit": "BodyAcceptance"}
{"post_id": "cljlfm", "created_utc": 1564844000, "title": "Sonetimes I love having a soft, squishy tummy and other times I feel unconfortable with it", "author": "FlexibleCommunist", "self_text": "How do I stop feeling bad about my belly? On one hand, I absolutely enjoy a nice tummy rub from someone but other times having a belly makes me feel weird. What do I do to make myself no longer feel uncomfortable with having a round tummy?", "subreddit": "BodyAcceptance"}
{"post_id": "cljsh0", "created_utc": 1564845072, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "clurw0", "created_utc": 1564913284, "title": "Comparing myself to others has never been harsher...", "author": "signficantlyconfused", "self_text": "I've always had a habit of comparing myself to other girls physically, but I've actually managed to keep that fairly under wraps for the past few weeks. This was until I saw pictures of objectively far more attractive girls who are partners of this guy I casually sext with. I have never been in a real relationship, so this time it was the realest hurt I've experienced. I actually could not think about why the hell he would still sext with me if I look the way I do and they look the way they do. I'm talking about drop-dead gorgeous, bombshell girls, with big beautiful breasts and tiny waists. And here I am with my flat chest, weird looking face, big nose, pimples and a bunch of other things, but hearing someone loathe themselves isn't that much fun.\n\nI guess I'm just going to be that girl who people find mainly attractive for her personality and not her looks. And that will be very hard to deal with at times, because there will always always be part of me that badly wishes I was a pretty girl. It's just, I feel like it's this prerequisite you need to really be noticed by others, then things like your personality come on top of that.\n\nI just wanted to vent. Advice or thoughts are welcome. Thank you guys and thank you so much for this sub.", "subreddit": "BodyAcceptance"}
{"post_id": "clwncz", "created_utc": 1564927471, "title": "I didn't think I'd ever be comfortable in my skin. I've come a long way.", "author": "that-weird-dude", "self_text": "I'm trans. I had really bad dysphoria pre-transition and early into my transition. It was so bad that I was constantly suicidal and it's still kind of weird to be here because I never expected or planned to live this long but here I am. I hated my body. It wasn't me. It was something I was trapped in. And my body has been through a lot. I was sexually abused. I used to self harm. I've struggled with eating disorders. I've gotten so much better though. I've been able to transition. I've been on testosterone since September 2014, had top surgery in June 2016, and had a hysterectomy in April 2017. And I'm finally okay. And it's not upsetting anymore. I can look in the mirror and shower and get dressed and take selfies without crying or having panic attacks. I can just do things. It's weird but also amazing because I didn't think I'd get here. And now the dysphoria is almost like a distant memory. Like sometimes I think about how bad it was and I didn't think it would get better. But I'm ok now. And it's just surreal to remember how things used to be. I am the way I should be now. And I've just recently started more feeling confident. Like now I actually love my body and I thought that would never happen.", "subreddit": "BodyAcceptance"}
{"post_id": "cm594y", "created_utc": 1564972970, "title": "It’s not about my body.", "author": "gingerdemontor", "self_text": "It’s about the fact that I’ve pushed it to the limits in the gym and still look like a big girl despite being 5’6 and 126 lbs (no joke) next to my petite, pear-shaped friends because what little fat I do have migrates to the most visible parts. \n\nI probably eat less than 1200 calories per day, eat way less, but it’s not about that. It’s that I have no appetite to eat more, because I can’t enjoy food without thinking about it’s natural chemical consequence. Sometimes I wonder what it’s like to feel guilty about indulging in food, because to me it’s not an indulgence anymore, just a cause for more pain in the future. \n\nIt’s that people only treat me human when I am so skinny my hip bones jut out and I hover close to underweight. But it’s not about how unfair it is to maintain it, it’s about the fact that I don’t even notice the difficulty anymore. This is what you must do to earn a residence on earth, after all. Why should I complain? \n\nI shouldn’t complain that sometimes people are cold to me, avoid me, after meeting me. It hurts the most when it’s teachers, or employers, or coworkers- people who you *need* to get along with professionally who you hope knew better, hoped would treat you for what’s on the inside as if that’s somehow separate from the outside. \n\nI shouldn’t complain because sometimes I do the same when I’m surprised by someone’s appearance. And then I feel bad. Then I feel worse because I should know better. \nThen there’s fiberglass in my lungs because crap- *I* make people cycle through this guilt and discomfort, too. Do they feel I’m a human? It’s hard to see someone as human when you’re ashamed for your reaction to them. \n\nNo, really, it doesn’t matter in the grand life and death scheme of things. But sometimes I happen to see a picture, or a reaction flash across someone’s face, and I remember. It’s not unfair because we’d pick on something else if everyone was beautiful but I am selfish and, if I had the chance to swap into a more neutral body, I would in a heartbeat.", "subreddit": "BodyAcceptance"}
{"post_id": "cm85aj", "created_utc": 1564992236, "title": "Have learned to accept my body but i still find it hard sometimes due to the people around me", "author": "kkirino", "self_text": "Starting as a teenager i started to become more and more self-conscious about my body, especially due to my parents who had a constant worry about my weight gain and overall appearance. \n\nNow that I'm an adult, I've somehow come to terms with my body and don't hate myself over it like I used to. I've stopped comparing myself to other people and have learned to love it a little more, but it's just instances with my parents (mainly my mum) who just keep pushing me down. \n\nShe's compared to me to my cousin's (who are all very skinny) and has said 'if I was your age I would look sexy, but you're not even trying to do anything' -- referring to my weight. She's told me to not eat certain things or else I'll get even more fat, she just constantly references my body and how I'm not 'sexy' and i won't get a guy because of the way i look. She's even gone and compared her body to mine and said \"I'm skinnier than you and I'm 50\" \n\nIt's started to affect me again to be completely honest. Sometimes i just sit in my room and cry, and start spewing out negative thoughts in my head. \n\nI get into a really depressive state, and i'm currently in this cycle again. I thought i knew how to love myself but when i hear about these things i start to think about how ugly i am. \n\nIf anyone's experienced this, how have you been able to go forth with it? I don't feel the very best right now and have hid all my mirrors, too ashamed to look at my body right now. :(", "subreddit": "BodyAcceptance"}
{"post_id": "cm9u4l", "created_utc": 1565004857, "title": "Inescapable comparison", "author": "malpalval", "self_text": "Social media makes it nearly impossible to avoid comparing myself. \n\nI deleted instagram to break the habit of mindlessly scrolling through thousands of pictures that only made me feel like garbage. This has helped tremendously, but it's impossible to avoid entirely. \n\nTwitter isn't even as enjoyable anymore because my feed is still constantly flooded with perfect women. \nI know there will always be attractive people in the world, but social media just makes you so much more aware of it. \n\nAnd I'm so tired. I even find myself stumbling into my insecurities on here, which sucks because it's been the most helpful outlet. \n\nMaybe I need a break from everything.", "subreddit": "BodyAcceptance"}
{"post_id": "cmatft", "created_utc": 1565010803, "title": "I'm fat and I hate it", "author": "clarenceappendix", "self_text": "I've been overweight since I was young... so all through middle school, high school, and even college, I was overweight. I've been trying off and on but it's obviously harder than it looks, especially when you're trying to manage school, and especially while you're trying to manage school and an internship.\n\nBut I still feel embarrassed and ashamed of my body... It's almost like being naked in public all the time. \n\nI've barely hung out with people, had friends, or communicated in general... I've shut myself off from everyone because of how I felt about myself.\n\nLike I get it I need to lose weight I'm fat but I'm not doing something horribly wrong to anyone. I don't want to feel ashamed all the time!", "subreddit": "BodyImage"}
{"post_id": "cmc9r3", "created_utc": 1565018285, "title": "Meta Monday Casual Conversation", "author": "maybesaydie", "self_text": "Talk about weight, food, fatlogic and fitness.  Please no rants.\n\n\nSelfie post is scheduled for September 1st so get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "cmr44t", "created_utc": 1565100865, "title": "Why do you do this? It’s not a compliment.", "author": "cocapple", "self_text": "Why is it still acceptable to call healthy people “skinny”. The next time someone lets me know how skinny I am, I am going to call them fat. Just another American double standard.", "subreddit": "BodyImage"}
{"post_id": "cmrt22", "created_utc": 1565104257, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cmtsbt", "created_utc": 1565113480, "title": "The weird relationship between love and hate inside every plus person.", "author": "jayharr9", "self_text": "Hello, beautiful people of r/BodyAcceptanceToday,\n\n I read a very interesting piece regarding a fellow big guy who found confidence doing sumo wrestling and while reading his words I felt connected because distant memories of past experiences came to mind.  Looking back at my life I've always had self-image issues not because of how I see myself but how others make me feel.  Constantly people very close to me and even friends have always had something negative about my body shape.  Always with good \"intentions\".  Throughout my life, I distinctly remember the infinite times my dad compared me to others or asked me why wouldn't I just \"lost weight\" like Miguel Cotto (Puerto Rican boxer) who some say he was chubby and one day decided to pick the gloves and go from there.  I had overcome so much in all my years; from a very traumatic childhood and bullying to depression. To be honest I wish I could say that it got better with time and that now my life is the best.  But no,  being gay you constantly see in media examples of body standards that are unattainable by most but often we are compared by those same standards when meeting someone or dating in general.  Don't get me wrong I don't have any problem with someone's preferences that's their life.  What rubs me in the wrong way is the constant rejection and just plain asshole behavior of some, to the point where they've treated me or tried to make me feel like garbage.\n\n&amp;#x200B;\n\nAt the moment and with 28 years roaming through this Earth I can say that the only thing that has improved is my self-confidence and how I see myself in the mirror.   No matter how much love handles I have, how red or big are my stretch marks even how my manboobs are the butt of a joke by a few.  When I look in the mirror I see a survivor but more than that I see someone deserving of love, decency, and a good life. Whenever I feel down I repeat to myself all the bad things I been through always repeating one of Tess Holiday's quotes: No matter how big your waist is, everyone deserves respect.\n\nSorry for my grammatical and/or syntax errors.  English is not my first language.   If you made it to this point thank you for reading and have a great day.", "subreddit": "BodyAcceptance"}
{"post_id": "cmujqv", "created_utc": 1565116962, "title": "I feel like I am making progress on liking my body", "author": "eukarythotic", "self_text": "Today I saw my body in the mirror and didn’t feel disgusted, I just felt recognition that yes, that’s my body. It exists. And that really was it. I feel like I’m starting to get a bit more neutral about it, and I want to continue ahead in this way.", "subreddit": "BodyAcceptance"}
{"post_id": "cmv917", "created_utc": 1565120321, "title": "body dysmorphia has taken over my life", "author": "Scarlet1992", "self_text": "I'm sorry if this seems like a pity party rant - I just need to get this out.\n\nAlso, this might be triggering to some...\n\nI've had body dysmorphia (BD) for most of my life, and while I have never been happy with my body, it hasn't quite been \"this\" bad in a long time.\n\nIt literally feels like BD is taking over my life. Whenever people ask me what is going on in my life, weight is the first thing that comes up. Or the fact that I need to buy more make up or change my hair again. Or the fact that my chin is looking too flabby and my waist isn't small enough. My siblings, boyfriend, and mom have all told me in one way or another that my body is the only thing that I talk about, and I hate it so much.\n\nEvery time I look at myself, I just get more and more depressed. It feels like there is no \"happy ending\" for my body and there never will be. There doesn't seem like a way out anymore and I don't know what to do.\n\nIt feels like the only time I can forget about my body is if I'm drinking, but then I just start worrying about calories and about how I'm just gonna end up with a \"beer gut\".\n\nI've ben trying to change things myself; I know that I'm fat, so I've been dieting and working out, and I've lost 30lbs already. But, when I look in the mirror, I don't see a difference. If anything, I feel like I've gotten fatter.\n\nI feel like I'm losing my absolute mind and I can't keep doing this. Can someone please help me?", "subreddit": "BodyImage"}
{"post_id": "cn45h8", "created_utc": 1565174358, "title": "Any men here struggling with their bodies?", "author": "StrivingToBeMyself", "self_text": "Hi, I'm new here 👋🏻\n\nI'm not the tallest guy (5'8\" / 1,72m), pretty thin and I don't have a beard. I also have a slightly asymmetrical face.\n\nFrom what people tend to tell me I would be considered fairly attractive, but most of the time I don't feel like it at all. I'm 33 and I still look like I'm in my early 20s. That's also a problem sometimes.\n\nAnyone has similar body issues or any good advice for me? I usually don't talk about these things, so I'm hoping that having a conversation about will help 🙂", "subreddit": "BodyAcceptance"}
{"post_id": "cn71jf", "created_utc": 1565190801, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cn813o", "created_utc": 1565195404, "title": "Getting demotivated at the gym because I keep comparing myself to other women [semi-rant]", "author": "Separate_Definition", "self_text": "I've been going to the gym regularly for about a year so far, and physically I know it's good for me because I've been getting stronger and lifting heavier, but mentally I feel like it's not been very good for me. \n\nI keep comparing myself to other women at the gym, and am getting really down because of it. As someone who is built like a '12 year old boy,' with basically no curves, I have always wanted a curvy, feminine body that I know I'll never have. I have to work SO hard just to gain an extra cm on my butt, and no one notices because I'm already slim. \n\nThen I'll see women at the gym who looks absolutely amazing - big boobs, curvy butt, and a waist the same size as mine and I start comparing myself to her. Basically what gets me feeling the worst is that they almost always barely do any work in the gym (light cardio for 30 mins then leave), while I'm busting my ass for changes only I notice!\n\nImmediately after seeing them, I start thinking 'well why do I even try? I'll never have that sort of body even if I work out 7 days a week.' It gets really depressing, and I don't know if there are any strategies I can try to stop myself getting into this cycle.", "subreddit": "BodyAcceptance"}
{"post_id": "cn8auz", "created_utc": 1565196688, "title": "Happy Birthday MaybeSaydie!", "author": "GetOffMyLawn_", "self_text": "Please join me in wishing our favorite mod Happy Birthday!", "subreddit": "fatlogic"}
{"post_id": "cng3fn", "created_utc": 1565235496, "title": "Just got married. Feeling insecure...", "author": "oddoneinside", "self_text": "I've had body image issues most of my life. I was a chubby kid and got made fun of a lot. I eventually lost a lot of weight and kept it off for years. I was very fit and that was the happiest time of my life. I decided to go to nursing school and the stress caused me to gain a ton of weight. I now consider myself chubby. My husband has always been supportive and compliments me all the time. I got married recently and I feel insecure tonight. It seems like every girl I know is smaller than me. How did I let go of myself like this? I haven't been called any names, but I've had a few people say \"You look/got bigger\" I talked to my husband about this and he says I'm beautiful. He's never done anything to make me feel insecure. It's me. I compare myself to other women all the time. I know this is all psychological and I should learn to love myself, but I really don't think I'll be truly happy unless I go back to being fit.\n\nI never thought I'd get married. I used to think I wasn't pretty enough. Now I'm married to the man of my dreams who is drop dead handsome. But somehow I feel hideous.", "subreddit": "BodyAcceptance"}
{"post_id": "cngxse", "created_utc": 1565240427, "title": "Can't stop comparing myself to my ex's tall, thin new girlfriend", "author": "coffeescone", "self_text": "I was in a really toxic relationship for about a year, then broke it off, then did that stupid thing where you're \"best friends\" that occasionally hook up. Then he started dating this new woman and ghosted me COMPLETELY, like, I helped him move one weekend, everything was normal, then the next thing I know he's stopped responding to my texts and months have gone by.\n\nI am a healthy weight, but self conscious about my stomach and under-chin fat... and she is textbook model-esque attractive. Tall, super thin, long blonde hair, clear skin, basically Kate Moss with big boobs. This caused a huge blow to my self-confidence, and I know I shouldn't compare myself to others, but I feel like I have no control over it. And every time I think about her and him, it motivates me to exercise....which can't be healthy. At the same time though, I feel like any reason to exercise is a good one, and I don't take it to extremes (pilates/swimming 3-5 times a week for 30 minutes or so, plus yoga/stretching in the morning most days). Any advice?", "subreddit": "BodyAcceptance"}
{"post_id": "cnjea9", "created_utc": 1565257177, "title": "Tips for overcoming insecurity?", "author": "party_hoagie", "self_text": "This is my first ever post to Reddit so I apologise abt any mistakes w/ format (posting via mobile), or if this isn't the correct subreddit for this. \n\nI'm extremely insecure about my body.(18F) I've never been able to like my body for longer than a few hours before going to complete indifference or disgust with my appearance. It used to be based around weight, at the beginning of my senior year of high school I was 218lbs and I've dropped down to 193lbs due to new medication and having to ride my bike to and from school, but in my mind I still look gross. My breasts are noticeably uneven and even after losing weight it's still the same, I've been thinking about getting them done but I'm afraid of surgery doing more harm than good. I get anxious about things and talk myself out of it easily because change is scary to me. I have some problems about not feeling feminine enough and it's gotten to the point that I feel sick when I think about putting makeup on or wearing different clothes because it feels like I'm a kid playing dress up. \n\nI'm worried it's affecting my relationship with my girlfriend. She's supportive of me and has made it clear that she loves me for who I am and any changes I make regarding appearance wouldn't bother her as long as it makes me happy. Despite that I feel awful when she let's me be little spoon or things in that nature because in my mind I'm too big to be it. Too clunky and wrong or something like that. My gf and my sister have both mentioned I could have body dysmorphic disorder but I've never gotten anything from a doctor confirming that or even have asked my therapist about it. My insecurities are deep rooted and have been around for a long time and it feels like they won't ever go away, and I know they probably won't ever fully be gone, I just need something to help alleviate it somehow because it feels like it's killing me metaphorically. \n\nIf anyone has any tips on overcoming this or how to not hate my body as much it would be appreciated. I apologise if this post is all over the place, I have trouble organizing my thoughts and it's harder to form something coherent when I'm a bit upset/frazzled I guess.", "subreddit": "BodyAcceptance"}
{"post_id": "cnn2z2", "created_utc": 1565277092, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cnn7rv", "created_utc": 1565277728, "title": "My wonderful friend's new book on Body Acceptance", "author": "13Stories", "self_text": "https://i.redd.it/9b4lvzjrs8f31.jpg\n\nHi all,\n\nA couple of years ago, I was at an event in London called Sunday Assembly (a secular Sunday community gathering with songs, talks, volunteer projects and comedy; like a secular church). I was there with my walkaround performance project ([theinsecurityguards.com](https://theinsecurityguards.com)) and the event that month was focused on Body Acceptance, featuring talks from Megyn Crabbe and my now-friend Harri Rose.\n\nI was so impressed by Harri; she was witty, self-effacing but not self-critical, warm and insightful. She was also honest about her own struggle with eating disorders, diet culture and self-acceptance. We got talking at the event and she's become one of my best friends. I love her to bits.\n\nSo, I hope it's okay but I'd like to tell you all about my amazing friend Harri's brand new book that came out yesterday: You Are Enough. It's small (pocket-sized if you have fairly big pockets), beautifully designed and illustrated (by @ashlukadraws), and full of genuinely really insightful, original and helpful advice and information about defying capitalist constructs of self-criticism and insecurity in order to accept and celebrate yourself, whatever you look like.\n\nYou can find Harri on Insta @harri\\_rose\\_ and her website is [harrirose.com](https://harrirose.com). You Are Enough is available at Waterstones in the UK and on Amazon.\n\nThanks!", "subreddit": "BodyAcceptance"}
{"post_id": "cnt3yg", "created_utc": 1565303137, "title": "Moving, mindset, comparing.", "author": "lost_things90", "self_text": "I moved to Colorado and I think I am in culture shock so to speak. There are so many thin people here. So many.  I have met very few that are my size.  I am starting to compare myself which is absolutely toxic.  \n\nBut I can't help it.  My partners all think I am gorgeous. (I am polyamorous) But I am just so down on myself.  I can't find any plus size groups here.  Nothing supportive. Nothing to keep me from this space. I used to walk a run way for a lingerie show before I moved. I used to do some body acceptance modeling before I moved. Now I am having a problem getting back into that. I see all these beautiful people and I don't feel I belong.  It is hard being here.  The lack of diversity actually scares me too. I am just...  I am on the outside looking in.  I am unsure how to battle this mindset. I logically know that I am gorgeous and that my weight has nothing to do with my beauty. These thoughts are irrational.  I accept that.  I just don't know how to get out of this spiral.", "subreddit": "BodyAcceptance"}
{"post_id": "cnugl9", "created_utc": 1565309760, "title": "Ren fest is tearing me up, a little post partum rant", "author": "Eowyn-where", "self_text": "None of my prior year costumes fit my after baby body. I hate how big my stomach still is from muscle distention(sp?) and my breasts are up to an f. I hate how the only thing I'd be somewhat acceptable in is a wench or a barmaid. I made midsummer costumes for my whole family, I was supposed to be the queen of the fairies. I am no fairy. \n\nI just want my tiny fit body back but I know it isn't possible because, my body is different now.", "subreddit": "BodyAcceptance"}
{"post_id": "co3qgz", "created_utc": 1565363701, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "co9plj", "created_utc": 1565390298, "title": "\"Going out\" wear and body acceptance", "author": "creaturecomforts13", "self_text": "I was wondering if anyone here had any tips for accepting and enjoying your appearance when in \"going out\" clothes that are maybe shorter, tighter or more revealing than what you would wear every day?\n\nI (22F) am going out clubbing with some friends for one of their birthdays soon, and while so far I have gotten away with very casual club clothes (student bars, amiright?), the friends I am going out with are quite new friends and seem to dress up more than I am used to. However, I am very insecure and self-conscious about my body! Sometimes I think I look really good, but sometimes I just focus on the negatives and self-perceived \"flaws\" in how I look. Has anyone thought of a way to discourage these thoughts? Or, if not, should I go more modest with what I wear or brazen it out in a short dress? I honestly have no idea what to do! Thanks in advance", "subreddit": "BodyAcceptance"}
{"post_id": "coelyh", "created_utc": 1565418822, "title": "No Body Shame What is you take?", "author": "socal_makeupjunkie", "self_text": "I am watching all these reality dating shows and other reality shows, why is it that we never see a plus size person on the Bachelorette or the Bachelor ? Are they trying to give it across that only skinny people are allowed to  be on the show.. I do see thicker people on the Food Network shows and that is sterotypical network for people that are a bit larger.. what is your take?", "subreddit": "BodyAcceptance"}
{"post_id": "coj77a", "created_utc": 1565449826, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "comvp7", "created_utc": 1565467404, "title": "After having the worst day ever, I think I finally understand why negative voices don't matter.", "author": "ilikepineapples15", "self_text": "Today, what was supposed to be a fun evening with my friends was ruined when my mom decided to express a few of her \"opinions\" about my weight while I was getting ready and doing my makeup.\nShe said I put on some weight and I looked ugly and awful, and I used to look a lot prettier in the past. I have body image issues I'm trying hard to overcome, and she reminded me of every negative voice in my head I was trying to forget. \nI burst into tears and asked her to leave my room, spent 2 hours in an endless cycle fixing my foundation and crying and ruining it all over again, and was late to meet my friends. Even when I was with them, I was trying hard not to cry thinking about what my mother said. \nWhen I came back home I told her what she said was mean and way out of line and i would appreciate it if she didn't day it in the future, and she responded with \"Only a true friend would tell you something like this. It's the same as when someone says a dress doesn't suit you, it's a friend being honest so you end up looking nicer\". I ended up crying again, right up till right now, 1 a.m.\nI went to the bathroom to wash my tears away for the 3rd time tonight, looked in the mirror, and stood there staring in....horror?\nI didn't recognise myself. I looked really sad. My eyes were all red and puffy, my cheeks were stained with tears, I looked like a mess.\nThat's when it hit me - it doesn't matter how ugly other people said I looked, I felt the ugliest when I looked at myself in my bathroom mirror and saw a sorrowful, gloomy stranger staring back.\nI've now made a decision to be happy for ME in the future, and try to block outside \"noise\" as much as possible. It's not going to be easy, learning to accept myself, but I'm going to work hard until I do.\nI might look my ugliest when I cry, but I feel my prettiest when I wear a beaming smile and feel happy inside, and at the end of the day, that's what should matter the most.\nHere's to learning to love ourselves. ❤️", "subreddit": "BodyAcceptance"}
{"post_id": "cos8pp", "created_utc": 1565496489, "title": "A shorter and smalller boyfriend", "author": "CherryChann", "self_text": "Hi! I am a 19 yr old curvy/chubby? Tall girl. My boyfriend is quite short and he suffers from an eating disorder (in recovery!). My boyfriend loves me for who i am and how i look, even though I look HUGE next to him. I got a lot of comments that I look way more like the \"guy\" in our relationship and it hurts. I also get this comment that most girls want a taller bf and that this is \"cute\" or \"new\" for people to see. To be honest it ruined my self convidence. I feel terrible when i stand next to a small and petite girl. Sorry this was just a rant. Xo", "subreddit": "BodyAcceptance"}
{"post_id": "cp291v", "created_utc": 1565556981, "title": "Tired of the balance between confidence and protecting myself.", "author": "forksandfawkes", "self_text": "This is my first time posting on this subreddit and the thing that led me to (rant) here was an incident earlier this week.\n\n&amp;#x200B;\n\nThis past Monday, I was on my way home from the train station and absentmindedly saw a young man listening to music and walking pretty fast. I was holding a lunch bag in my right hand and my phone in the other, I stopped to look at phone and was about to start walking again when I look up to see the man LEANED TOWARDS ME AND KISSED ME. I managed to duck so he only got my ear but the interaction got me shaking for hours afterwards. I have been catcalled before and the worst got as far as someone following me until I pretended to make a phone call. I told a few people about what happened and the vast minority were sympathetic but most of them didn't really know what to say to me. And I still feel shitty about it now.\n\nI care about aesthetics but it is not a performative act, it's a part of my ~~consumerism~~ personality. I only dress for myself and I follow a professional dress code at work. In fact, I was not even wearing anything revealing!!  I had on a cardigan and a sleeveless tank where I guess you can see a square inch of my shoulders on each side if I stretch (wow scandalous). I had wide legged black pants that couldn't even be any less sexy. I don't work in a field that focuses on exterior beauty but I have a lot of interest in makeup and fashion and I like taking the time to pamper myself. I sometimes feel like I'm supposed to be punished for wanting to enjoy makeup, picking out a nice outfit and going outside with God forbid some joy and confidence. \n\nI want to be safe (and my outfit was \"safe\") but I don't want to be harassed or assaulted! I don't even go out often and never go out at night time. I always tell someone where I am going and I take extra caution in crowded areas. Yet it felt like nothing can guarantee my safety and it's terrifying. It took me years, decades even to get my self-esteem here and I'm damn proud of myself. I just want to enjoy who I am without feeling threatened. I know I can't control other people's actions and that's what really sucks. I'm SICK of feeling scared of going outside and evaluating whether or not my outfits are \"too flattering\" or I look \"too pretty\" and slouching to hide my boobs!!! I feel like I've been made to feel bad for complaining about these types of encounters because women just need to \"working\" on something about their appearance all the time so this is just normal! I know I will myself go to self blaming thoughts and I really shouldn't do that anymore but it's hard sometimes.\n\n&amp;#x200B;\n\nIf you got this far, thank you for reading and listening to me yell!! On a different note, I really enjoy the posts in this community and all the encouragement you give each other. Even though some things are not directed at me, I feel comforted by reading some of the other posts.", "subreddit": "BodyAcceptance"}
{"post_id": "cp355t", "created_utc": 1565561134, "title": "How do you actually accept yourself when everyone is obsessed with body image?", "author": "booksarelife99", "self_text": "I'm sorry, I'm not sure if I'm posting in the right place. \n\nI'm a 19 year old female and lately I have realised how down society's obsession with makeup and body image gets me. I only wear minimal eye makeup, nothing else, because I have eczema so any other makeup really irritates my skin.\n\nBut I feel like everywhere I go - social media, university, shopping in town, to see friends, most girls are caked in makeup, and I always think they look so much better than me! For example, my best friend at uni gets up hours earlier to do her hair and makeup, while I usually wake up 20 mins before I have to leave the house, shove some food down me and go. And for some reason, when I get to uni I feel like a potato sitting next to her. All of these influences make me feel like I 'should' be making more effort, and when I go out in public without makeup (about half the time) Jesus I feel unattractive.\n\nNot to mention the constant bombardment of makeup - I've unsubscribed to random makeup emails I always seem to receive, yet in shops (like Boots, which is a pharmacy that also sells lots of makeup, or Debenhams) you tend to have to walk through all the makeup and perfume to get to the medical section, or furniture section whatever.\n\nI know I have to work on my self esteem, that's a given. But I really don't know **how** when all these influences are constantly in my face making me feel bad about myself.\n\nSorry this post is a bit of a moan, I really just had to get all this off my chest! Thank you for reading.", "subreddit": "BodyAcceptance"}
{"post_id": "cpd2ea", "created_utc": 1565619893, "title": "'your body is just an extension of your brain'", "author": "pastelchannl", "self_text": "I was talking about my insecurities for the milionth time with my BF, this time complaining me looking so different in pictures than what I see myself as (and compairing myself with my (in my eyes) prettier friend).\n\n&amp;#x200B;\n\nthe thing that really stuck with me was him saying that the body is just an extension of your brain. as long as you're doing what you like best and live life to the fullest, it doesn't really matter what you look like.", "subreddit": "BodyAcceptance"}
{"post_id": "cpft72", "created_utc": 1565631936, "title": "Beautycon not Inclusive", "author": "eeevilmigraines", "self_text": "Not sure if this is the right sub for this. Apologies for formatting I am on mobile but I really need to rant. I spent a long time working over issues, loving myself for who I am and how I look.\n\nWhen I see one of my favourite Youtubers being treated like garbage at Beatycon because she's not a standard size riles me up. I wanted to cry for her. She looked absolutely stunning and all I could think was if she isn't accepted there I sure wouldn't be. I can't believe in 2019 we still have ignorant jerks who think you have to be a certain size to be beautiful. \n\nI'm going to have to put on a fab outfit and rock it to get rid of that negativity.", "subreddit": "BodyAcceptance"}
{"post_id": "cphkk8", "created_utc": 1565639443, "title": "Mini Confidence Boost", "author": "death-by-chainsaw", "self_text": "I've been struggling with a lot of body image issues lately due to stress, and today was a particularly bad day. There was a loooot of stress eating and subsequent self hatred. \n\nBut on my way out of work, a random stranger stopped me in the street and asked to take my picture?? She was a photographer doing some sightseeing around the city, and I guess she thought I looked nice? I normally shy away from pictures, which are a huge trigger for me. I've never considered myself picture worthy before, so I didn't really know how to respond. Not to mention I was sweaty and gross after an 8 hour food service shift. \n\nI posed for the picture anyway. And it actually gave me a weird confidence boost, something that I haven't had in a while. It's a nice little reminder that we all see each other much differently than we see ourselves. \n\nTo each and every beautiful person reading this: you're all totally picture worthy and ily ❤", "subreddit": "BodyAcceptance"}
{"post_id": "cpoqzv", "created_utc": 1565674778, "title": "Hate myself", "author": "YakaAka", "self_text": "13 yr old male, wanting to be very small and feminine. More of the opposite. I'm 5' 3\", when I want to be like 4' 9\", I have body hair all over me, and I can't get rid of it because my parents will kill me if I even remotely ask. can't buy any razors or anything else because they will most definitely find out. on the bright side, I'm not ugly and my face looks fine :)", "subreddit": "BodyAcceptance"}
{"post_id": "cpsjce", "created_utc": 1565699770, "title": "Recognised my dysmorphia's effects today", "author": "peepocho", "self_text": "I was checking myself in the mirror so I could point out one or two good things about how I look as an exercise to build confidence. I noticed today that when I place my arms down my hips look narrower than when they don't. Like, they literally morph when I bring my arms down and then back up again. Like I loose my ability to recognise shape. I think my broad shoulders contribute to this. So strange.", "subreddit": "BodyAcceptance"}
{"post_id": "cpugzl", "created_utc": 1565709090, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cpweez", "created_utc": 1565717429, "title": "My boobs make me fat", "author": "moregutsthanglory", "self_text": "Hi I’m a basic bitch living life and I feel like since my boobs got bigger I feel fatter. I’m 5’10 , 180lbs but my boobs make me look soooooo wide and idk. How to think more positively.", "subreddit": "BodyAcceptance"}
{"post_id": "cq39il", "created_utc": 1565748922, "title": "What would be the worst thing that could happen if I just accepted my body for how it is?", "author": "staticpopcorn", "self_text": "I had a sort of epiphany today.\n\nI was doing my usual spiral of self-hatred, looking at pictures of “perfect” women and wondering why I don’t look like them. \n\nThen, almost as if it were something other than my own consciousness, a small voice in my head asked me, “what is the worst thing that could happen from just letting yourself be how you are and accepting your body for how it is?”\n\nI’m not saying I’m cured of my body image issues. It’s probably going to take a lot more than a single moment to undo years of negative self esteem and body comparisons.\n\nBut it really made me think about it. What do I have to gain from hating the way I look? Absolutely no one is benefiting from my misery, especially not myself. Beating myself up for my soft spots and rolls is not going to “fix” them, not that they even need fixing in the first place. \n\nWorst case? Maybe I get a little bit sunburnt from exposing my legs in the sun. Maybe I decide to spend money on the clothes I WANT to wear instead of spending money on the clothes I think I should wear. Maybe I let myself indulge in that piece of cake that I’ve been obsessing over for the past week and get a little bloated because, damn, sugar really sets my digestive system off.\n\nBut I can live with those things. I can’t live with nitpicking myself and my self-labeled flaws. I can’t live in fear of letting my future boyfriends/sexual partners see me nude (and if, God forbid, I hear a negative comment, I guess they aren’t getting laid 🤷🏻‍♀️). I can’t live with the constant “ugh, if only I looked like this I could wear those shorts”.  I can’t live with crying almost daily over things I literally cannot change short of drastic and wholly unnecessary surgery. \n\nSo maybe, next time when you’re feeling low about yourself, ask yourself what would actually happen if you accepted your body for how it is. You probably won’t be able to come up with any truly negative scenarios.", "subreddit": "BodyAcceptance"}
{"post_id": "cqb0ff", "created_utc": 1565795551, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cqmtrc", "created_utc": 1565855535, "title": "i’m having trouble celebrating my fitness accomplishments bc of my bdd.", "author": "insomniopath", "self_text": "this is just a rant bc sometimes putting it into words makes me understand it better. Anyway, 4 months ago i was the fittest i’ve been since high school... but this summer, i didn’t have access to a gym bc my student membership expired, and i couldn’t afford a new membership. I became pretty depressed all summer due to starting a new job (from home, so i never left my house) and not having a gym. i also worked late, so i never really saw the daylight. i kind of developed a binge eating disorder and becoming obsessed with my weight, causing me to starve myself every few days... at the beginning of august i moved back to my hometown. i now have access to my parents gym and have been going frequently for the past two weeks. it’s helped my kind of eating disorder to the point where i really don’t do it at all, and i’ve been having happier days.... however, i still hate my body and looking back at photos from 4 months ago. i keep trying to tell myself that if i’m able to get that strong 4 months ago, i can do that again. But i also look at myself in the mirror, wondering if my weight gain is just a part of getting older, or that i have an underlying medical problem where i’ll keep gaining weight (like i know it’s probably not and it’s from taking terrible care of myself this summer). Anyway, tonight after my workout, i felt disgusting and hopeless. i felt like my workout was for nothing. physically, i worked hard but mentally, i felt like i didn’t work hard enough. \n\nit’s just hard to celebrate my healthy habits when what i see affects how i feel.", "subreddit": "BodyAcceptance"}
{"post_id": "cqpurx", "created_utc": 1565875842, "title": "Having Anxiety Even Though It's Stupid", "author": "X0X000", "self_text": "BACKGROUND:\nHow I view my weight has always been an issue. As a kid I was always the tallest and fattest. I used to get bullied a lot, both emotionally and physically. I've had switch schools and classes because other kids (both guys and girls) punched me, broke my glasses, threw food at me... All kinds of stuff.\n\nI went from 200lbs when I was 13 to 125lbs by the time I was 18. I'm now 23.\n\nPRESENT:\nI stepped on the scale yesturday and I was 148, this morning I'm 150. It made me really sad and it gave me anxiety. The first thing I thought was, I shouldn't have eaten that snack after I got home from work last night lol. WHICH I know is super unhealthy mindset. \n\nI know its probably water fluxuation or I just need to go to the bathroom or whatever, bcuz there's no way I can gain 2lbs over night because of 1 extra snack the day before.\n\nANYWAYS, how do I over come this foolishness?", "subreddit": "BodyImage"}
{"post_id": "cqqnjs", "created_utc": 1565879732, "title": "Fatness attraction and dating.", "author": "jayharr9", "self_text": "Hello, beautiful people of r/BodyAcceptance,\n\nI came back because I found this subreddit very inspiring and you guys made me feel creative. I found an old series that I watched back in 2017/18 called Dietland it only has one season and I connected with it because is about what we as bigger people go through.  From being bigger kids to full-figured adults people still, find ways to make us feel bad for our weight and just project their own insecurities onto us and not only that,  society has deemed us ugly and undesirable. We are portrayed like the butt of a joke over and over again in mainstream media.  When was the last time you saw someone bigger doing a serious role in a movie?  When have you someone doing a dramatic scene or acting their asses off on screen with a plus figure? Almost never, that has always rubbed me the wrong way. Feels like you have to have a flat stomach in order to evoke emotion to an audience and don't get the wrong idea there's are people like Kevin James, my favorite comedian Gabriel Iglesias, and Melissa McCarthy who have done it but they all had to start in comedy and build up from there.  Even John Goodman, one of the greatest actors of our days had to get stupid roles in his career before even got considered for more serious roles or action roles.\n\nFat people are constantly treated like the emotional punching bags or the comedic relief of the world at least in modern days we have  the body positivity movement  and at least they  are leveling the playing field by doing important work and creating a market for people who's waist  like mine is not a 32, that is beautiful. There's a lot of work to do.  Kids out there that are still victims of bullying for being fat,  also being shamed and mistreated for not having the 'ideal body'.  I remember at 14 I was doing caplets for weight loss you know how dangerous that is at such a young age,  I did exercises, I walked, I ran every sunset and jumped rope in the morning just to please the eye of someone or in my mind I thought that I needed to burn fat in order to be treated like other men or even being deserving of love and respect.  We do so many things for society.  The same society that treats us so badly and corners us constantly.  A society that has kept our character hostage for so long.   We are so addicted to beauty standards that we evaluate someone by how they look before we even listen to a word that person says.  Even in the dating world as a fat person, you are forced to do poses and angles just so people think you are slimmer than you actually are. I read somewhere that women's first fear is a blind date is that their date is a rapist and men's first fear in a blind date is that their date is fat.  Being gay is no cake either, unattractiveness is viewed as an illness for the gays; some even say that being gay is only fun if you are physically beautiful.\n\nOver and over we repeat the same lies to ourselves.  Lies got stuck in our head like the latest pop song on the radio.  It's time to break the cycle.  Some of what we say is not even our own thoughts,  some of it is just insecurities of other people projected onto us.  We use it as a weapon against ourselves because in some fucked up way the worst we can do is actually love ourselves and be positive about our body.  The most offensive thing that we can do is actually in the eyes of society is actually liking what we see in the mirror and flaunting it so people can see that we are not an emotional punching bag, comedic relief or ultimately the butt of a joke. Maybe it's time we bring out the worst in us, maybe it is time that we show society that their worst is our best.  That even if they get offended, angry or disrespectful we are going to still wear what we like, we are gonna get out are we are gonna still kill the game. Because being bigger is just part of us not what we are.", "subreddit": "BodyAcceptance"}
{"post_id": "cqr4ul", "created_utc": 1565881881, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cqreyx", "created_utc": 1565883144, "title": "Is this fatlogic? Or do I have a point?", "author": "Amiller1776", "self_text": "I'm fat. 5'10\" male. 270 lbs. Lots of muscle because I like to lift and I have a job the requires a lot ot heavy lifting, but still like 30% body fat. I've lost weight a few times, but it keeps coming back. I know its not genetics, its pizza and monster. I go through phases of discipline followed by phases of total relapse.\n\nI also know about the health risks, like heart disease, diabetes, cancer, etc...\n\nI have a chronic cough that occures every fall and winter, then goes away in the warmer months. I  have cold and exercise enduced asthma that can be treated with an inhaler so I can run. (Did a 5k 2 years ago during one of those \"discipline phases\", that really helped my asthma actually. Kinda want to call bullshit on it being \"exercise enduced\" but thats what they told me)\n\nThe asthma predates my weight gain, but the cough does not.\n\nMy Doctor tells me the cough is being caused by my weight. I'm calling bullshit because my weight isn't seasonal, but the cough is. I did keto last winter and dropped down to like 240lbs, and I STILL had a cough. Skip ahead to this summer and 270lbs... no cough.\n\nSo am I right in assuming this doctor is full of shit, and that I should see another one? Like yeah, I get it. Being fat probably doesn't help the cough at all. But it sounds more like a seasonal alergy he could be helping with, instead of blaming it all on one thing that the evidence doesnt point to.", "subreddit": "fatlogic"}
{"post_id": "cqv41n", "created_utc": 1565899206, "title": "Does coffee make you lose weight?", "author": "junegum12", "self_text": "Im a skinny person i just wanna lose weight on my belly. Dont tell me to go to the gym because i have tried and i am still going from time to time. I want faster results. Is there any tips or tricks on what foods to eat because ive read up online tea and coffee makes you lose weight in general?", "subreddit": "fatlogic"}
{"post_id": "cqxr5q", "created_utc": 1565911020, "title": "I wish I looked older", "author": "turboshot49cents", "self_text": "I am 24 but look like I’m 14. Everywhere I go I get carded. Usually I take it in stride but sometimes it really gets to me. I just want to be beautiful in a more sophisticated way than just “cute” and “adorable.” What sane person my age is going to look at me and think I’m attractive? I’m about to start a job at a high school and I know I’m going to get mistaken for a student. How am I ever going to be taken seriously when I look like this? Not to mention, creepy men talk to me a lot, so how can I stay safe on the streets when I look so vulnerable?", "subreddit": "BodyAcceptance"}
{"post_id": "cr047a", "created_utc": 1565923008, "title": "am i being complacent if I’m alright with being chubby?", "author": "guy1234567892", "self_text": "Ive always had this problem with needing to be the prettiest I could be and for me part of that is being thin (my face looks better with less weight on it, but don’t get me wrong this isn’t a universal truth tons of ppl can be hot and not thin, 100%). but anyways I think it’s bc i have high standards for guys and i feel like i should be perfect so I’m worthy and I’m aware that’s shit but yeah. and now that I’ve recently felt better about myself it’s translated partially to being okay with being a little chubby but I feel like I’m being complacent or lazy if I’m good with myself like this? I dunno. I’m sorry if this is offensive I just want people to tell me what they think if it’s being lazy or if it’s alright I don’t know", "subreddit": "BodyImage"}
{"post_id": "cr25mi", "created_utc": 1565934792, "title": "How to get a good mindset before a trip home", "author": "Heather722", "self_text": "Hi! Newcomer here....this seems like such an awesome community...I'm heading out for a trip where I'll see people who haven't seen me since I gained weight.\n\nI was doing better with self love then put on 20lb pounds in new places... after already gaining 30. \n\nAlll I can think about is how they'll see me and I barely have enough clothes to fit. I'll try to go shopping....\n\nI'm trying to focus on empowerment but this has got me so down I'm worried about being distracted and anxious the whole time...\n\nHelp! Always plus size but never this size...", "subreddit": "BodyAcceptance"}
{"post_id": "cr3wgg", "created_utc": 1565947097, "title": "M16 My head looks like a burger", "author": "SpiceMercator", "self_text": "My head is wide but so short, my friends told me the only way to make it look bigger is to reveal my forehead by either brushing my hair up or cutting it shorter, I love long hair and I can't bear with the fact I can never have long hair going over my forehead like everyone else, people with big heads are lucky because a big head is common and can be ignored, but small heads are rare and are very noticeable and off-putting", "subreddit": "BodyAcceptance"}
{"post_id": "cr7q3v", "created_utc": 1565968444, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "crh1nm", "created_utc": 1566013260, "title": "Why", "author": "lili1223", "self_text": "Why don’t people see that the only reason I think someone is attracted to me is if it’s for a fetish? \n‘Normal’ sized people don’t have to deal with people liking ‘big girls’ at THATS why they’re comfortable putting their dick in you. \n\nI just wish someone was attracted to me and didn’t have to see my body. I already hate myself so much. I already am disgusted with myself. I already want to change myself. But people still can only be attracted to me if they’re a ‘chubby chaser’ \n\nI know everyone has their insecurities but fuck it’s like I’m wearing a sign that says ‘I already hate this part of me, pls only people who will take that part of me that I value least and take advantage.’\n\nSorry if this is any part rude or offensive I just had to deal with a guy say he just wants to see if he’s into girls my size and I felt gross", "subreddit": "BodyImage"}
{"post_id": "crnbo5", "created_utc": 1566054610, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cro0yz", "created_utc": 1566057810, "title": "[M22] I have a tiny head and it makes me really sad!", "author": "adalios", "self_text": "Hello everyone!\n\nI am 22 years old and I find my head very small, disproportionate to my body.\n\nI started repairing this about two years ago by simply looking myself in the mirror after I had my hair cut. I my hair longso whenever I shave it I feel extremely insecure and the thing that makes the situation even worse is the fact that I am getting bald.\n\nI'd like to know if someone shares the same feeling about their head size and how to deal with insecurity.\n\nthx!\n\n&amp;#x200B;\n\nPS: Another issue is that I am never knew someone with the same feeling about their own head, it really makes me feel an alien and more alone.", "subreddit": "BodyAcceptance"}
{"post_id": "crrxc8", "created_utc": 1566075848, "title": "Why are all dancers so skinny??", "author": "sojyonnie", "self_text": "This is just a random thought that popped into my head but that has actually been bothering me a lot the past weeks.\nJust why when you watch dance practices on YouTube the clear majority of dancers are super skinny, if not bony already. And I get that when you are dancing and maybe even do it professionally, your body grows leaner and you are fitter, but does that necessarily also mean not having much weight?\nI love dancing very much personally, even though I just do it as a hobby I take it seriously as it is almost the only sport i really enjoy. But seeing all these seemingly perfect society-approved dancer bodies is harshly discouraging... I even don't like to watch dance practices &amp; videos anymore bc of all the toxicity to my brain. \nI've tried searching up body positive dancers on Google, Pinterest &amp; YouTube, but I only found 2. 2! \nIt's not like your body type (mine's slim thick and small, btw) hinders you at doing what you love. But it just really suggests that the dancing community doesn't accept such principles and often sexualises the dancers even more than the Beauty Industry (!!). \nI just needed to get this off of my mind and of course I would appreciate if you shared your thoughts and experiences with me here.\nThough I am proud to call myself a dancer I have to say that these circumstances make me a whole lot insecure about myself and my body especially when dancing &amp; I am NOT proud, to call myself a part of the main dancing community as I would always feel at a disadvantage.", "subreddit": "BodyAcceptance"}
{"post_id": "crui7x", "created_utc": 1566089070, "title": "Books &amp; stories about eating disorders", "author": "Sue_a_cider", "self_text": "What do you guys recommend?\n[my experience is anorexia but I’m not adverse]\n\nI’ve been reading books more often because having a voice that’s not mine in my head but has similar thought patterns makes me feel less alone.\n\nEdit: Forgot to add\n\nI’ve also been reading people telling their stories on eating disorder forums for support organizations but they tend to be a lot shorter for obvious reasons - are there any other forums you frequent?", "subreddit": "BodyAcceptance"}
{"post_id": "cs0v45", "created_utc": 1566133057, "title": "Guy in a wheelchair", "author": "teammav41", "self_text": "Hi I'm 26 and am completely normal except I'm in a wheelchair. I do literally everything myself. I'm honestly tired of being treated badly by women because of my wheelchair. Can anyone talk to me", "subreddit": "BodyAcceptance"}
{"post_id": "cs7fan", "created_utc": 1566163907, "title": "I am just going to live the way I want to live", "author": "prudekaed", "self_text": "Through my whole life, I have struggled with my body. I was very big when I was pre teen and then I became anorexic through high school. After high school I gained about 200 pounds in 3 years, and then lost back to a healthy weight. I then had a one night stand and got pregnant and I gained 60 pounds while I was pregnant. Then after I gave birth, I shot back up the scales to 350 pounds as of last July. I then decided to lose weight again but it didn't work so know j have decided that I will eat how I feel like eating and I will weigh what I weigh and I will love my new self.", "subreddit": "BodyAcceptance"}
{"post_id": "csc3lq", "created_utc": 1566188705, "title": "[academic] [participants] INSTAGRAM AND YOUNG WOMEN'S BODY IMAGE EXPERIMENT (WOMEN 16-35 years of age)", "author": "rachelsummerfield", "self_text": "Hi Everyone   \nI am seeking participants for my fourth-year research project which is comparing how Instagram influencers makes women feel about their body. This project is supervised by Dr. Danielle Wagstaff. **I am recruiting women between the ages of 16 and 35 to participate in my experiment via email correspondence over a two-week period. You will be required to complete a short survey, interact with some email correspondence over a two-week period, then complete another short survey.** The total participation time over two weeks will be approximately 45 minutes. This research has been approved by the Human Research Ethics Committee at Federation University Australia. If you are interested in volunteering to take part in our study, please click the link below.\n\n[https://federationpsych.syd1.qualtrics.com/jfe/form/SV\\_0pMqVwVP6j0N3nv](https://federationpsych.syd1.qualtrics.com/jfe/form/SV_0pMqVwVP6j0N3nv)", "subreddit": "BodyImage"}
{"post_id": "cscnuc", "created_utc": 1566192256, "title": "help a gal out &lt;3", "author": "butterflybitch13", "self_text": "hey everyone :)\n\ni'm doing a speech (very angry slam poetry style) on body image for my english class and i'd really love it if anyone could drop a comment talking about their struggles for body image that i can use in my presentation. you'll be completely anonymous (aside from on reddit ofc) and it'd really help x\n\nthank you so much,\n\n\\-e", "subreddit": "BodyImage"}
{"post_id": "csgit2", "created_utc": 1566218336, "title": "Don't always believe people. Some of them are just mean.", "author": "Infinitexpo-end", "self_text": "Just yesterday a guy that I don't know  (we actually  took a class together from a year ago and I never noticed him) told me that he likes from  a year and he told me thar he found but me so beautiful and sweet but as he said he couldn't come and ask me out because he was jobless and kind of broke,  and now as he started working he feels more competent to be in a relationship, that guy was so sweet and we are having a date soon!  And also yesterday I over heard my cousin speak with my aunt as I left the room telling her how ugly I am and that I am disgusting.  \nMe being myself , self conscious and with low self esteem hearing my cousin's words broke my heart like why would you say that about me. Disgusting? \n\nObjectively speaking I'm not disgusting I'm sure... \n\nSo sometimes we should just not listen to some people.\nSome people are just mean and their negative remarks come from how bad they are.", "subreddit": "BodyAcceptance"}
{"post_id": "csgzbu", "created_utc": 1566220775, "title": "Advice for Body Dysmorphia?", "author": "abblepabble", "self_text": "Hello wonderful people of r/BodyAcceptance,\n\nI’m a 20 year old female that has an average build (5’6-5’7 at around 140) and I struggle so much with dysmorphia. I go away to school and tend to perceive myself as being much slimmer because I’m walking more, doing more, and eating less (due to time constraints and stress). When I got home from the semester for summer, I felt as though I gained weight. All my clothes fit the same, but I can’t knock that feeling when I look in the mirror of “your hips are massive, your stomach is massive, your thighs are too big.” Everyone around me (parents, boyfriend, best friends) reassures me that I have in fact not gained weight and that I look exactly the same. Not sure if this is the right place to get advice on body dysmorphia, but anything would help.", "subreddit": "BodyAcceptance"}
{"post_id": "cshemk", "created_utc": 1566222910, "title": "Meta Monday", "author": "GetOffMyLawn_", "self_text": "Selfie Sunday will be on Monday, September 2nd, that's Labor Day for us Americans, which is a holiday here. We will have a sticky for it then. \n\nWhat's on your mind?", "subreddit": "fatlogic"}
{"post_id": "csl5jo", "created_utc": 1566239262, "title": "Afraid to check my weight", "author": "moodydonut", "self_text": "Today I saw my weight for the first time in 3 years. I was horrified. Absolutely horrified. I’ve always been so scared of checking my weight. I thought that If I didn’t check, I could ignore it, pretend it’s still the same as it was 3 years ago. Am I the only one? Ive been working out everyday for the past 7 weeks. I was struggling to control my diet. Today, after I saw my weight Im so determined to starve myself. But I know that starving myself will only make me miserable. I hate how I look... I want to be able to wear sleeveless clothes without obsessing over my underarm fat... I wanna wear crop tops... But above all I wanna get rid of this idea that I look disgusting... help :(", "subreddit": "BodyImage"}
{"post_id": "csoeif", "created_utc": 1566253200, "title": "Puberty: How do I learn to accept my new curves?", "author": "ariii456", "self_text": "I’ve been very thin my entire life. I’ve also had a lot of issues with my body growing up because of this, which took a toll on my self-esteem and encouraged disordered eating habits. I eventually decided to accept being skinny and flat-chested, and worked my look around my body type as well as live a healthier lifestyle.\n\nNow I’m almost 21 and noticed that my bras weren’t looking right under my clothes, so I went to get fitted—note that I haven’t been fitted since I was 16 (my fault) but have gone braless or worn size S bralettes since then, so I felt fine, my bras were just turning raggedy and losing shape. Turns out that I’m no longer the 34A that I used to be, but a 32C! \n\nMy new bras fit perfectly and I definitely see the difference in my clothes. I’m still surprised that this is my size, because I look better (no more uniboob, I look more proportional), but different (boobs!). On one hand it’s cool, but I don’t know to adapt to my changing body—although I’ve had this issue for a while, getting my new bras today has really signified that for me. \n\nI feel like I just figured out how to embrace my twigginess when now I feel like I have to embrace my new (curvier) figure, and it’s scary—now that I’ve accepted the new bra size, I’m made to accept my wider hips, that I’m an hourglass and not a ruler/pear, as well as other changes.\n\n I’ve also experienced sexual assault and catcalling back when I was thinner, and although I kind of like my “new look” for myself, the new attention that I may get scares me (I’ve basically been smushing my boobs in sports bras and bralettes for a while-a bad look, I know).\n\nSo how do I cope? How do I go through yet another cycle of body acceptance?", "subreddit": "BodyAcceptance"}
{"post_id": "csortp", "created_utc": 1566254851, "title": "No more thrift store posts please", "author": "SomethingIWontRegret", "self_text": "We're getting several submissions a day for the same thrift store post.  It's been posted enough times, and the theme has been well mined out in the past.  Thanks for your cooperation.", "subreddit": "fatlogic"}
{"post_id": "cssdr2", "created_utc": 1566272722, "title": "tuberous breast deformity", "author": "barfinmyhair666", "self_text": "so. i am nearly seventeen and my breasts have been the same for basically 5 years. after doing research on tuberous breasts it seems that.. that’s what i have. they look very odd, i literally look like i have the chest of a girl who just started puberty. the rest of my body looks mature but.. my breasts look like they are frozen in time. i literally cry thinking about it. i don’t know how i can ever show my body. once i turn 18 i am old enough for surgery but. what would i pay with? i wonder if i should even talk to my mom about this. i hate my chest so fucking much", "subreddit": "BodyAcceptance"}
{"post_id": "ct0gdj", "created_utc": 1566313943, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ct1u3e", "created_utc": 1566319089, "title": "Intimacy / body image struggles", "author": "SimpleKale1", "self_text": "Hi, this will be my very first Reddit post but I'm super glad I found this subreddit (and other useful resources). A bit about myself, I (F, 28) am in recovery from EDs and while I got my eating fully under control, enjoy exercising and the feeling of being strong, refound my love for food and cooking, and see a therapist and a dietician, I still very much struggle with my body image. How do you handle being intimate with someone when you i) have zero sex drive and ii) you don't like what you see in the mirror?\n\nEDIT: I should have clarified that I live with my S.O. who has an active sex drive. Not being able to reciprocate in some way makes me feel sad and honestly angry about myself (i.e. \"why can't I just be normal?\").", "subreddit": "BodyAcceptance"}
{"post_id": "ctajrp", "created_utc": 1566354979, "title": "I have a problem... with loving myself...", "author": "mrs-sweetiepie", "self_text": "I love everyone. I love how everyone looks, whether they’re skinny, curvy, tall, short, busty, etc. I think everyone wears themselves perfectly. Everyone... except me. I want to love myself. Some days I do and some days, like today, I don’t. It’s always the day before I have somewhere important to be that I struggle with my looks. I sit there and I look up pictures of my really skinny friends, the ones my mom says I need to look like. I love curvy girls. Always have and always will, but my mom ingrained it in my head that other girls can be thick but I can’t. So, here I am looking up pictures of what to wear to a concert. I know that no matter what I wear though, I will not like what I see in the pictures. Me looking ugly next to all of my friends. And I love them, don’t get me wrong. I just wish I loved myself as much as I love them.", "subreddit": "BodyAcceptance"}
{"post_id": "cthdzx", "created_utc": 1566396565, "title": "Why?", "author": "lili1223", "self_text": "I have been overweight my entire life. I’m currently 20 and 5’  coming in at around 200 pounds. I’m trying to eat much healthier so I can lose weight but since I have hypothyroidism it has been a big struggle for me bc even on my medication I continued to gain weight. \n\nI have never liked my body. But more recently I’ve come to accept that people don’t like it either. As shallow as it is I know people judge based on looks and I know that people steer away from me because of my weight. People would like me more if I lost the weight. \n\nIt just sucks. I’m going to therapy on Friday so it should help. I just wish people saw how much I dislike myself so they could look past my body.", "subreddit": "BodyImage"}
{"post_id": "cti7rl", "created_utc": 1566400356, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "ctkxae", "created_utc": 1566412289, "title": "The perfect outfit", "author": "mrs-sweetiepie", "self_text": "Today I went shopping because I’m going to a concert tonight. I needed an outfit, or more like a confidence boost. I struggle with finding clothes so very very much, but have you ever found that one shirt on the rack and thought it was the most beautiful thing. Except you feel deep down that you don’t even want to try it on because you already think you know how it will look on you. Well, that happened to me today. Except I forced myself to try on the shirt, and it fit perfectly. It’s been forever since I had that happiness in a fitting room.", "subreddit": "BodyAcceptance"}
{"post_id": "ctyrwb", "created_utc": 1566486703, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cu7e6x", "created_utc": 1566526108, "title": "You have only one body. Why would you wate your time hating it?", "author": "jayharr9", "self_text": "Hello, my beautiful people,I came back with a thought that I had for a while and in the past days I was listening to Gettin Better with Ron Funches which was a delight and in the last episode he invited my favorite person in the world, Nicole Byer and they chatted about their experiences in terms of being bigger in the world and one of my favorite parts of the whole episode was when they've said that they love to be fat they workout on the regular but they love to be fat.  To be honest I feel the same way I love my body.  I love Every part of my body and of course, there are parts that I am not that happy but I accept them because that is who I am. Throughout my life, I've been through terrible shit my life has been a constant struggle.  From sexual violence, to losing all my belongings to a hurricane twice in my life my body has always been there and it is the only thing that I got and is the vessel for my soul why would I hate it?  Why would I go into the mirror and strip and say negative stuff about myself?  The other day I wore a shirt which I truly liked and the shirt made my nipples look hard as hell and being a guy with man boobs you always are self-conscious of that but in the same second I thought to myself I am no longer in high school, there are no bullies here.\n\nI bought this shirt with my honest and hard work why don't I wore it with pride? At that moment I knew I came so far from being a tiny fucking person to the man that I am now.  A man who's not afraid to occupy space anymore.  A man who loves himself not because of what's on the outside but for what's on the inside.  I think that is what they meant when they said:  It gets better.  With time you stop giving a fuck on how people see you or perceive you and you start enjoying life because this is a one chance thing only and no one should waste there time hating themselves.  Wear those jeans, use that shirt, buy that swimsuit and feel like the most beautiful person in the world why? Because society will make you feel like the garbage they will try to make you feel like you are undeserving of love and respect and that is not true.  Everyone deserve love and respect in this world no matter the size of the belt they use.  Stop believing the lies that has been told to you in media that the only reason that people aren't giving a fuck about you is because you're fat I've seen bigger people constantly falling in love and being truly happy because they know how to carry themselves and because they know that being fat is their asset, not their liability (for my accounting people out there)  If you are struggling with any type of dysmorphia or body issues disorder just know that you are not alone.  You are valued and you are loved. Reach out and look for like-minded people who are more than willing to help you it's not an easy battle but is a battle that with the right knowledge and work you can win.", "subreddit": "BodyAcceptance"}
{"post_id": "cubi6e", "created_utc": 1566552689, "title": "My SO hates her body and the way she looks, how can I help her?", "author": "azkaelleon", "self_text": "I don't know if this is the right sub or not, of not I'll remove the post and keep looking.\n\nAnyway, my girlfriend is really hard on herself about the say she looks and her body in general. I try to tell her almost daily that she is beautiful and that she shouldn't be so hard on herself but she mostly just scoffs att my compliments and tell me I'm weird for thinking so it just flat out disagrees with me. It's really making me sad aswell because I see how she struggles with it all.\n\nDoes anyone have any advice on what I can do to help her love herself more? \n\nI tried to get her to tell me 3 things she liked about herself every day, just anything at all really. She doubted that she could do it though and we agreed that she would try to tell me 1 thing every day instead. I figured that if maybe she would start to find the things she liked instead of just seeking what she dislikes everytime it would gradually be better, but I don't know.", "subreddit": "BodyAcceptance"}
{"post_id": "cuf95c", "created_utc": 1566573354, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cuj1zp", "created_utc": 1566590393, "title": "Help? I guess?..", "author": "shaharh41", "self_text": "M 18 I'm 178 cm and around 56 kg I work out 6 days a week (around 45 mins) and eat healthy. I'm like 10 percent body fat (according to the internet ¯\\_(ツ)_/¯ )\nEveryone tells me that I'm skinny and look good and some people talked about my abs but I hate how I look. More than that I obsess over it, I put my hand on my belly and check if it's flat with my pelvic region, I grab my belly from the side, I flex and try to grab belly fat and tit fat or try and feel the muscles below, I lift my shirt to check if I'm fat at every mirror all the time and I dislike what I see most of the time. There are times where I like what I see and even high five myself in the mirror and smile, I do like my body sometimes and it feels so awesome when I do. \nBut most of the time I don't, and I hate obsessing about it.\n\nAny tips?\n\nBTW some of this may be caused by my OCD or the fact I used to be fat (like maybe 75?)", "subreddit": "BodyAcceptance"}
{"post_id": "cukwvs", "created_utc": 1566598952, "title": "REQUEST: Websites, accounts, or literature for accepting your appearance that have nothing (or little) to do with weight.", "author": "moistarticle", "self_text": "I hope this doesn't count as weight talk thats against the rules, but it's relevant information. I've almost always been slightly underweight due to health issues. Most of my insecurities have nothing to do with weight at all, or sometimes I'll be upset about being thinner than I'd like. I struggle to accept my facial features, my scoliosis and matching warped ribcage, my permanently disfigured collarbone, a weird hemangioma I was born with, the overall shape of my body, etc. \n\nI feel like a mutant most days. I don't relate to talk about how to stop dieting, which is most of what I can find online. It actually makes me feel lonelier when I try to find resources or support networks.", "subreddit": "BodyAcceptance"}
{"post_id": "cumzuz", "created_utc": 1566609566, "title": "Know your value.", "author": "jayharr9", "self_text": "Hello readers if this beautiful subreddit \n\nI hope that everyone here had an amazing day mine was a bit boring.  I stayed in bed and basically just catch up on all the podcast I was missing.  But anyways I came back because I love writing and more than that I like to write to you guys because you are actually supportive and really nice.  Now to the point because I got kinda sidetracked.  This is going to be a short one.  Know you value people.  You are amazing and beautiful why won't you show that to the world.  People are needing a light like yours to shine in their lives.  If you are good at something share it.  If you love something, chase it.  There's not a set of rules and there's no limit on what you can do.  There's no limit on what you can achieve and there's no ceiling that can stop you.   Keep being positive I know that is hard and life might not be fair but I'm so proud of you you came a long way and you crushed a whole week.  A whole new week.  Keep being you, keep lovin yourself and keep dreaming.", "subreddit": "BodyAcceptance"}
{"post_id": "cup302", "created_utc": 1566621860, "title": "Im trying to move on, but sometimes my insecurities will hit back.", "author": "TurningBlueArrows", "self_text": "I (M20) have for a long time been quite insecure and somewhat hate my body and my genitals. I posted pictures of my body on r/normalnudes to get people's opinion and stuff, and i have received a ton of support and positive messages. From then on, i kept telling myself to stay positive and just accept myself, but sometimes the negativity just keeps coming back. I keep thinking \"I'm too skinny for anyone to like me, im not tall enough, or my penis is not big enough.\" The body part that im most insecure about is my penis. For a long time, i keep telling myself my penis is average (5.5 ish inches.) and that i would be able to please my future partner, but the truth is im afraid. I've never dated anyone before, but i have had sex like maybe only twice. (Both times were paid) I'm afraid that my penis is not good enough to pleasure my future partner or she might make fun of it by calling it small or whatever. I'm afraid that one day when i do date a woman and we have sex, i'm not as good as the previous guys she slept with. I have all these fear, uncertainty, and doubt going on in my head and although i try my best to forget about it and stay positive, it still finds a way to haunt me. I dont want to have these thoughts anymore, but it keeps coming back and i'm really tired of this whole emotional rollercoaster.", "subreddit": "BodyAcceptance"}
{"post_id": "cuujkq", "created_utc": 1566659454, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cuy18w", "created_utc": 1566675561, "title": "Cellulite", "author": "lovenpizzza", "self_text": "How do I get rid of cellulite, they make me feel so self conscious 😩", "subreddit": "BodyImage"}
{"post_id": "cuzdoz", "created_utc": 1566682177, "title": "Strech marks", "author": "Tip_Mou", "self_text": "What do yall think about strech marks?", "subreddit": "BodyImage"}
{"post_id": "cv89e6", "created_utc": 1566738344, "title": "Recently I’ve been feeling bad about myself", "author": "EmiTandborste", "self_text": "I’ve always been thin which is good I guess, but after puberty I grew to 5’7 which is tall for my age (16F). So basically, I turned into this lanky, too thin, and too tall teenager. When my friends tease me about it I laugh and I think it’s funny because they understand me and their jokes are clever. When strangers comment on how thin/tall I am, I get really annoyed and self conscious though, like ‘I know, you don’t have to comment on it.’ I just wish I looked sort of normal/like all the other girls my age.", "subreddit": "BodyImage"}
{"post_id": "cvihdu", "created_utc": 1566789082, "title": "I dont know how to feel good about myself", "author": "HiddenMaruchan", "self_text": "Hi, new to this sub, Idk if this goes here, but here i go.\n\nIm 22, a rather skinny guy (1.70m -75 kg ish) but almost every time i feel my body is downright ugly, i have kind of a belly going on, my arms and back are too skinny and that makes me feel less masculine in general, also my physical condition is absolute garbage.  I have a very unhealthy livestyle, i spend nearly 70% of the day sitting and my only real exercise is walking around whenever i go out or for work. \n\nI KNOW i have to begin exercising, the thing is i only exercise when im feeling good with my body (which is aroun one or two times in 3 months) the rest of the time i feel like i dont deserve to look good, and be healthy. I see jacked guys on social media and want to be that, i want abs, and a broad back and biseps, but i feel, again, like i dont deserve that, and lack the willpower to overcome that.\n\nThis also makes me EXTREMELY insecure, i have a girlfriend, we ve been together for the past 3 and a half years, she likes highly muscular guys and i feel like she just does not like my body at all, and is constantly comenting on their friends bodies look \"nice\" and never makes me compliments or anithing like that. \n\nIdk if all of that is normal, or is a product of my insecurities, but i want to have a body that she could like, and i couls like, but cant bring myself to accually doing it. Some people told me to first accept myself before start doing exercise because if its something psycological ill never stop feeling like that even if I improve my looks.\n\nWhat should i do? what could i do? I dont expect to found the holy grail of self love in here, but i think i just want to feel a little understood.\n\n&amp;#x200B;\n\nBtw, sorry for my bad english, hope its readable...", "subreddit": "BodyAcceptance"}
{"post_id": "cvimaz", "created_utc": 1566789932, "title": "I'm not ok with my body, but I reserve the right to set my own goals.", "author": "AoifeSilentwing", "self_text": "Tell me something. Why do people's feelings about other's bodies have to be made known? Its valid to have those feelings, to express them even. But why get upset when the subject of those feelings doesn't change their body to assuage your feelings? My significant other keeps making comments about how my goals aren't ambitious enough.", "subreddit": "BodyAcceptance"}
{"post_id": "cvjui8", "created_utc": 1566797765, "title": "Can’t find confidence as a girl with broad shoulders/no curves", "author": "rottenpaints", "self_text": "I’ve been struggling a lot with my confidence lately and honestly feel very stuck. I’m 17 years old and around 5’9, and have very broad shoulders and a square body. The average shoulder width for women is 14 inches while mine are about 20. My friends all know me as a super masculine chick because I look better in men’s clothes so that’s what i wear, but i want to look feminine. However, every time i put on a dress or a skirt or other “feminine” clothes, i feel stupid because of how my body is shaped. Even though I’m chubby (190) i have no curves, just an unfortunate protruding belly, and nothing i wear makes me feel pretty or delicate, just like a linebacker in a tutu. I hope this doesnt offend anybody but i just feel like i dont have a very feminine body and i know its not a big deal but its hard to cope with. Everybody tells me to just forget about it, just love myself but that feels sorta dumb to force myself to love something i hate.", "subreddit": "BodyAcceptance"}
{"post_id": "cvp41n", "created_utc": 1566831167, "title": "MetaMonday No Stupid Questions", "author": "maybesaydie", "self_text": "Ask the community about weight loss, maintenance, calorie counting tips or anything at all to do with fatlogic. Please, no rants or medical advice.\n\n\nSelfie post is next weekend! Get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "cvr0e5", "created_utc": 1566839717, "title": "Body image 31 F- Tired of comparing myself to other girls and feeling not enough", "author": "PiscesJoy", "self_text": "Does anyone ever get all done up to go out and feel really good about yourself looking in the mirror before you leave and then when you get there you start comparing yourself to other people and suddenly feel extremely ugly and ashamed and like you want to just go home and your whole mood changes? I went to a concert last night (I live in LA, so going anywhere here is like going to an Instagram influencer/model convention) and all these perfectly tanned girls with perfect bodies and long thick flowing hair wearing short shorts and cowboy boots and I’m looking around and feeling like an old maid all of the sudden. I’m 31 and probably comparing myself to 20 year olds but in the moment not taking into account they’re a decade younger than me and even if they’re not, why can’t I just focus on myself and having a good time at the concert. My anxiety all of the sudden runs rampant looking around at everyone and feeling not enough. I start thinking “ugh I need a tan, should I get a nose job? I need to grow out my hair, why did I wear these jeans, I should have worn shorts, but my legs wouldn’t look as good as these girls in shorts, I need to work out more, how do they have such smooth skin? Why is my skin not that perfect? Etc etc etc” ’m so tired of this way of thinking and having these petty insecurities get in the way of me living my best life and enjoying fun activities. Just wondering who out there relates and if anyone has any advice on how to stop comparing and still feel beautiful on my own (the way I did before I left the house) no matter what anyone around me looks like.", "subreddit": "BodyImage"}
{"post_id": "cvruaf", "created_utc": 1566843419, "title": "Do you avoid mirrors?", "author": "sirinkale", "self_text": "Hi everyone\n[Posted with mod permission.]\nI'm writing an article for the Guardian newspaper which is about people who avoid looking in mirrors - whether for body image issues, or because of anxiety.\nI'd really love to chat with UK based case studies who could chat about why they prefer to avoid mirrors - I'd be looking for a phone interview, cannot do interviews via Reddit.\nIf you'd be up for chatting with me my email is sirin.kale.writer@gmail.com or you can message me on here. Happy to answer any qs you may have and also to provide evidence of my press credentials .\nThanks\nSirin", "subreddit": "BodyAcceptance"}
{"post_id": "cvtwku", "created_utc": 1566852565, "title": "35 male with gastric bypass wants to post pics for feed back", "author": "pureconfussion", "self_text": "When I was 19 I weighed 375 pounds and in my early 20s I lost about 175 pounds. I’m 6’3” and about 200lbs  I’ve struggled with my self image since losing the weight. I now go to the gym every day and trying to build muscle but it weirds me out that I am far more attractive to the human race than I give myself any credit for or believe. It has been a never ending battle to deal with Waymore attraction from the opposite sex the I know how to handle so I’m thinking maybe to try to address this and gain some sort of perspective I thought I could post some pictures of myself in swim trunks on a roast me sub or body image sub to get some sort of feedback both super negative and positive to try to get a grip on my beliefs of how I look. Does any one have any sub recommendations where I could post a picture in the appropriate sub and get feedback?", "subreddit": "BodyImage"}
{"post_id": "cw5s4k", "created_utc": 1566918645, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cw7eiv", "created_utc": 1566925881, "title": "I can never find stuff in my size", "author": "TheOceansHaveOrgans", "self_text": "I’m a size zero and when thrifting and shopping at regular stores I feel awkward and child-like for not being able to fill out tops and jeans. Advice?", "subreddit": "BodyAcceptance"}
{"post_id": "cw9nut", "created_utc": 1566935941, "title": "Brown eye positivity doesn't help me at all, think about blue eyes on a daily basis", "author": "throwawayidsh9", "self_text": "I even had my eye*lashes* appreciated, but not eyes. I had several people say that my eyelashes are beautiful, which to me means that my eyes are sufficiently ugly to deflect attention to eyelashes. And for the reference I didn't do makeup.\n\nI spent several months looking up brown eye positivity and finding beautiful associations with brown color, but it doesn't help. Something just doesn't feel right about me having brown eyes. I even tried calling it \"honey\" or \"caramel\" or \"dark orange\" or even some hexadecimal code or making up some fancy labeling instead of brown, but I still can't be content.", "subreddit": "BodyAcceptance"}
{"post_id": "cwdqdu", "created_utc": 1566954948, "title": "Do we deserve love? (The stigma of dating in plus sizes)", "author": "jayharr9", "self_text": "The other day at my job and let's say I do customer services.  I was helping a client get through a transaction and when I've finished helping him one of my bosses who's puerto rican like me and we are a very sharing group of people so she told me you were checking him out,  I corrected her and said that he was attracted to skinnier men and I am attracted to bigger bodies to which she replied with a laugh and she couldn't believe the fact that I liked bigger men.  Which was literally the first time that someone had a negative reaction to my taste in men and it doesn't bother me says a lot about her. Don't get me wrong is not a fetish and is not definitely a feeding thing I just find bigger men beautiful. \n\nDating bigger people is somehow shameful in the eyes of few.  We are instilled violently with the image that the only way to be attractive is to be skinny, tall and white and everything outside that is wrong and ugly.  On the contrary in porn searches BBW and BBM rank on the top so there's an audience for big bodies. What is the hold up?  Why dating people that score a bit more in the scale have to be a taboo.  \n\nIn conclusion I always remember the words of a friend of mine when he said:  Gays fucked the chubbies but marry the hunkies.  This is kind of a rant kind of a rambling. I tried to make it as shorter as I could. Thank you guys for your compliments and your kind words they make my day go much happier.", "subreddit": "BodyAcceptance"}
{"post_id": "cwehaj", "created_utc": 1566958649, "title": "Cried in front of my doctor when he brought up my BMI and told me “just set a goal and consume less calories”", "author": "Corinvincible", "self_text": "I had an appointment today that I have been waiting for for 3 months while dealing with pulsatile tinnitus (whooshing sound in my ear). My new ENT specialist and I spent an hour going through all kinds of tests and questions. At the end he off-handedly said, “what is your BMI?” and then figured it out for me while I said, “I know it’s high...it’s in the obesity range...” and then he started telling me that even if I lost 20 or 30 lbs. I would be in the overweight category. He then said that I should set my goal and not focus on exercise but, eat less than I expend, it’s a simple math equation, etc. I play tennis very aggressively three times a week and walk 30 mins a day to work and back. I broke down crying in front of him because, I have felt bad about my body since I was 13 and in the last five years I have felt pretty good with my curves. I’m 38 and it sucks to melt down in front of a stranger because, I feel so broken by the constant conversation in my own mind everyday about my body coming back in under a minute today. The rule = health isn’t body image on this sub, so not discussing that aspect of a health professional’s job here -- just sharing and knowing that others might have felt this way is why I’m posting. How do you get back out of the shame pit when you fall back in?", "subreddit": "BodyAcceptance"}
{"post_id": "cwm4ry", "created_utc": 1567005113, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cwsnec", "created_utc": 1567034691, "title": "how do i love myself", "author": "haleeyxx", "self_text": "hi,\nso for years now i have never been happy with my self. i am very unhappy with my appearance and even sometimes unhappy with just the person i am. i am very self critical and very insecure. i compare myself to other women constantly. i have been in a relationship for awhile now and sometimes i feel like it gets in between us. he has some gal friends that’s he’s very close with and i’m okay with it but every time they come up i can’t help but think of how much better or prettier they are than me. and then i always ask myself why he’d rather be with me. and just start to worry and over think. i just always am so unhappy with myself. i never feel pretty or good enough. and i compare myself to literally every other woman out there. i’ve struggles with this for so long. i just want to be able to love myself, be confident, and not worry so much when it comes to other women and constantly over think my relationship just because i’m insecure. \n\nplease help, i need advice. i’ve done so much research and talked to people and i’ve done everything and nothing seems to help.", "subreddit": "BodyAcceptance"}
{"post_id": "cwy22w", "created_utc": 1567067595, "title": "Never happy with my weight", "author": "throwawayxxx42069", "self_text": "For starters, I’m a young woman who is 5’7” and at my skinniest weighed 140, and my heaviest is 180+. Right now, I am sitting at about 170-175 and am completely miserable. When I was at my thinnest I was ALSO miserable (my large boobs had deflated and I had a distorted view of myself, diagnosed body dysmorphia). Maybe I’m still suffering with BD but it actually feels impossible to be happy with myself. It’s annoying because I know none of my problems will be solved my losing weight but I still feel this incessant need to be thin. Ugh. Sorry, it’s 1:30 am here and it’s been a shitty night. Can someone give me pointers for how to deal with weight gain and body positivity?", "subreddit": "BodyAcceptance"}
{"post_id": "cx144z", "created_utc": 1567086221, "title": "I have a high sex drive but I am too ashamed to be naked in front of my partner.", "author": "mismatchmittens", "self_text": "I feel so frustrated and confused. There are times when my (25M) partner initiates sex and I feel too awful about my body to go through with it. We have been together for almost 7 years and we live together, and so it's not like he hasn't seen me naked before.\n\n\nMy weight has fluctuated up and down since the beginning of our relationship and I sure am not as thin as I was before. Ive struggled with disordered eating in the past and am certain I have some form of body dysmorphia. On top of this, I have a very boyish-shaped body. I am very short, broad shoulders with no hips, butt, waist or boobs. I have some muscle but I'm certainly not shredded. My quads and calves are large for no reason (blaming genetics) and I struggle to find pants that fit properly. I try to take care of my body so I work out and do some cardio but I still absolutely can't stand the way I look. I end up wearing a lot of baggy clothes to cover myself up because I am so embarrassed, also because it's easier to wear oversized things than to find clothing that really fits. I recognize the body types and women he thinks are hot or beautiful and I am nothing like them.\n\n\nMy partner initiates sex often and there are times where I have to say no because I am feeling particularly ugly, ashamed, and uncomfortable in my body. He counteracts with comments like, \"I love you the way you are\" or \"I still think you are pretty\" and reassures me that he finds me attractive and comments on my legs. By this point, I am very conflicted and feel like I'm being lied to just to get in the sack. I know I have a high sex drive (especially with the current medication I am taking right now) but a lot of the time I need to say no because I am embarrassed and ashamed of my body. If I go through with it, you best bet I won't be having a good time because all I would think about is how ugly, fat, and unflattering my body looks from his point of view.\nI am very very frustrated and torn.\n\n\nHas anyone ever felt this way? What can I do to feel less like this? \n\n\n\n\nTLDR: I am too insecure about my body to have sex with my long term partner who has seen me naked many times before.", "subreddit": "BodyAcceptance"}
{"post_id": "cx27wr", "created_utc": 1567091500, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cx52zs", "created_utc": 1567104520, "title": "One for my fellow girls here regarding cellulite.", "author": "uKaty", "self_text": "Okay so I’ve gained 2 1/2 - 3 stone since leaving school (6 years ago) so I’ve obviously gained a lot of cellulite on my legs. I don’t ever dare wear outfits that reveal anything above my knees, I don’t by any means think I’m severely overweight (I’m a UK 10-12 in clothes) however the cellulite on my legs prevent me from wearing pretty dresses/shorts or whatever. \n\nSo on a serious note I’m just wanting to know how to get my confidence back and how people have learned to deal with it. Do we think I’d go outside with a dress on and people would even take notice of it and think ‘ew, cellulite sally’ 😂 or am I just being very paranoid about something people don’t care about? \nThankyou ❣️", "subreddit": "BodyAcceptance"}
{"post_id": "cx79id", "created_utc": 1567114306, "title": "Always remember to cleanse yourself from toxic people in your life.", "author": "jayharr9", "self_text": "Very often we find ourselves being put down by someone or made fun of by that \"friend\".  We all have that person in our life it can be even a relative that just cannot wait to make that snarky comment that will spike your anxiety or that remark that when you hear it triggers sadness.  Get those people out of your life.  Take an active role in your life and let them know about their bullshit behavior.   Don't let absolutely no one dictate your value and treat you less than what you deserve.", "subreddit": "BodyAcceptance"}
{"post_id": "cxhob1", "created_utc": 1567175243, "title": "I was body shamed by my hand surgeon", "author": "singamelody1987", "self_text": "Yesterday I saw a hand surgeon for a cyst on my finger. We spent a small amount of time talking about the cyst(which ended up in us scheduling a surgery to remove it) and the majority of my time there was spent listening to the surgeon harp on about my weight. Sorry if this is kind of rambling, I'm still really upset at how the appointment went.\n\nWhen the nurse was taking my blood pressure she went to her desk and got a bigger arm cuff and said \"I call this my curvy cuff.\" I have never EVER required a bigger blood pressure arm cuff, the regular ones fit me fine. She had to wrap this bigger one around my arm like twice because it was too big for me. \n\nAfter that I was brought into the examining room. The doctor spent maybe 5 minutes looking at my cyst and asking if I wanted it removed. After we agreed on a surgery date, she began by asking if anyone has ever talked to me about my weight. When I said no she then began to give me diet tips, telling me I should start eating more veggies and stop drinking soda/eating fast food. Little did she know, I go to my local farmer's market every weekend and load up on fresh veggies, I don't drink soda, and my husband and I eat fast food MAYBE once a month...which I ended up telling her. She then asked how I sleep at night and I said on my stomach....to which she replied \"oh wow, you're able to sleep on your stomach?\" She then said she would be right back and left the room. I sat there wondering what the hell any of that had to do with getting a cyst removed on my hand. She came back with an iPad in her hand....she looked up weight loss tips and how to deal with my GERD(which I've had since high school when I was 120 pounds.) She told me that it was entirely possible to lose 5-10 pounds before my surgery(in less than 2 weeks) so that I would be more comfortable laying down during the procedure.\n\nThey also repeatedly told me that they would have to do the procedure in their office under a local anesthetic instead of at the hospital where they can put me under because \"the hospital probably won't put you under because your BMI is too high.\" This was a weird statement to me because from what I've heard, these types of procedures are done in office without putting people under anyway. To me it was kind of a way for them to say \"see how difficult your weight makes things?\"\n\nTo top it all off, before I left the nurse told me I shouldn't get my nails done anymore because it's not good for me. Silly me, I thought I was going there to get a cyst looked at. Nope, turns out I went to get unsolicited life and health advice that had nothing to do with the issue at hand.\n\nTLDR; Went to a hand surgeon, scheduled surgery to remove a cyst from my hand, majority of the time was spent by the doctor telling me I'm overweight, making false assumptions about my diet and giving me diet tips, and then the nurse told me getting my nails done is bad for me.", "subreddit": "BodyAcceptance"}
{"post_id": "cxiaah", "created_utc": 1567178049, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cxjqwb", "created_utc": 1567184608, "title": "Too hairy", "author": "throwzawayz37", "self_text": "No other guys appear to be as hairy as me. I can't stand it, but I've had to come to terms with it. I started this throwaway exactly to throw myself out of it and talk about it. \n\nI hate how it's increasing as I get older, and that's just the start of my lack of acceptance and the start of the issues. Save for getting laser removal I'm stuck with it and even the odd waxing every few years just makes my skin red and sore and spotty and then the hair is back two days later anyway. \n\nAny other hairy as fuck dudes out there? Any hairy as fuck ladies? Anyone wanna go back to caveman times so we can be the pick of the bunch?!\n\nBleurgh.", "subreddit": "BodyAcceptance"}
{"post_id": "cxwmwn", "created_utc": 1567264248, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cy0cem", "created_utc": 1567282867, "title": "about BDD", "author": "sojyonnie", "self_text": "anybody else here having BDD? if yes, feel free to share your experiences, thoughts and ideas abt the matter bc i am having a major fallback and can need some inspiration... \nthat feeling of complete and utter torture is killing me", "subreddit": "BodyAcceptance"}
{"post_id": "cy2alq", "created_utc": 1567292319, "title": "How to deal with thoughts that you aren’t attractive enough to keep your boyfriend satisfied even though he reassures you otherwise? *NSFW*", "author": "k8marie_", "self_text": "Sorry if this is a bit jumbled, I’m having a hard time putting my thoughts on this into words. \nMy boyfriend recently told me that he sometimes goes on some NSFW subreddits like gonewild, etc.. I’ve never had an issue with porn as I think it’s normal and something the majority of the population does. My main issue stems from my own insecurities. All of the top posts on those subreddits have the exact same body type and it’s hard not to compare your own body when you know he finds that body type attractive. I feel like I can’t compete or even begin to compare to them because I have a completely different type of body. I consider myself to be midsized, size 12-14 gal and I’ve always struggled with accepting my body for how it is. My boyfriend reassures me that he thinks I’m beautiful and he says that he loves my body but I can’t help but feel like he would much rather prefer if I had a flat stomach like the girls on those subreddits. He tells me not to compare myself to those girls because it’s just porn but that’s easier said than done. Any tips on how to get past this?", "subreddit": "BodyAcceptance"}
