{"post_id": "dq2rkf", "created_utc": 1572606652, "title": "For those struggling with \"asymetrical faces\"", "author": "Infinitexpo-end", "self_text": "I shared this post in r/amiugly and I feel like it might help someone here\n\nI am that girl who just can't unsee past her crooked nose, uneven smile and eyes. My face felt like a complete mess when I see it in pictures but reading this essay, the first 3 paragraphs made me feel so much better about myself. I want to share that with you. \nI'll mention briefly the key points and I'll attach the link. \n\n1. The brain process the face holistically, (as a whole entity) rather than picking it part by part. So the details we focus on most people don't see them at all. \n\n2.the holistic process itself is asymetrical and scans the face from left to right. \n\n3.each side of the face (left then right ) is processed alone with focus on the left side. And due to that way of processing people tend not to notice the difference between the two sides.\n\n4 . Asymetrical faces need slightly more time to process (than completely symetrical faces, because left and right sides are identical) thus making asymetrical faces more memorable and in cases even more attractive.\n\nThe link\n\nhttp://m.nautil.us/issue/13/symmetry/an-experts-guide-to-celebrity-faces", "subreddit": "BodyAcceptance"}
{"post_id": "dq3cfk", "created_utc": 1572610131, "title": "Kim Harris - \"Once You Were Wondrous\"", "author": "nigeypigey", "self_text": "Hi everyone, I work with an artist named Kim Harris who put out a music video this week that I wanted to share. It's my favourite song from her album that's coming out early next year, and I hope the video's message will resonate with folks. Here's what Kim had to say about the video, which [you can watch here](https://www.youtube.com/watch?v=N1u1FD5c4GI):\n\n\"I wanted to make a video, where I could 'glow without apologizing,' with other women like me, as extensions of myself. I wanted to be swimming, I wanted to be in formations together on a beach, mystic and ethereal. In the planning stages, as I spoke with people about the treatment for this video, the first reaction was always an immediate, 'How brave of you!' All well-meaning, some would follow by interrogating their initial reaction, or try to soften it. It is rare to see big bodies presented as objects of beauty. It is political to put my fat queer body in a gold bathing suit for the public. But does it have to be?\n\n\"We live in a world that both hates and fears fat bodies. Living in one as an artist, it's impossible to separate my life from my work. Along with a team of queer filmmakers, I made the video for 'Once You Were Wondrous' as an offering of the beauty and splendour of bodies like mine, in celebration, because I needed to.\"", "subreddit": "BodyAcceptance"}
{"post_id": "dq5k4r", "created_utc": 1572621216, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dq9dax", "created_utc": 1572637904, "title": "I like being petite, but I can’t help and think I look like a child.", "author": "Nano2k19", "self_text": "As I get older I feel like I shouldn’t waste my energy and time worrying about my body. That I should use that time to occupy myself with positive things. Which I try to do, but always in the back of my mind I have these thoughts that were caused by body shaming. \n\nMy most recent experience was my ex bf who leaked my photos in revenge. I have never felt so humiliated in my life. The worst thing about this incident was that random guys were body shaming me. Saying I had the body of a boy. That I looked trans because my boobs aren’t fully developed. That I wasn’t sexually attractive. That I was too skinny blah blah. It hurt I’ll admit but I know deep down those people are shallow and toxic. The pictures were from years ago. My boobs are a little bigger but still.\n\nI guess this situation has helped me to realize that I need to just accept what I have and that there will be people who won’t think you are their cup of tea. Unfortunately it has lowered my confidence and now I just feel like I’ll never be attractive enough and that no guy is even attracted to this body type. That they would rather have someone who has something and not with a 25 year old who looks like a 13 year old.", "subreddit": "BodyAcceptance"}
{"post_id": "dqlel0", "created_utc": 1572707211, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "dqn3cd", "created_utc": 1572714563, "title": "A friend of mine is obsessed with the idea that only plus size women or women with cellulite are “normal”", "author": "White_Petal534", "self_text": "Rant incoming...apologies in advance tl;dr at the bottom\n\nMy husband and I went to see a burlesque show for Halloween, and it was amazing! If you don’t know what the Suicide Girls Blackheart Burlesque is please google! (Warning it’s NSFW) that’s who we saw and I was in love. So much diversity in skin tone, body types, boob size, hair color, tattoos, etc etc, it’s just a gorgeous work of art.\n\nI sent some shots I got of the girls to my friend and she instantly latched onto one dancer. There was a performance by this gorgeous curvy woman who was beyond flexible and it was hella impressive! \n\nBut my friend saw her and instantly was like “OMG The curvy girl! She actually looks like a normal woman!! She has cellulite and everything! So nice to see a normal body in society” \n\nNow let me preface this with I’m not shitting on plus size women, y’all are sexy and stunning beyond measure. I’m just sick of my friend spewing this idea that in order to be a “normal” woman you have to have a certain type (her body type...which she complains about constantly mind you)\n\nI am short and skinny and have slight curves but nowhere near what anyone would call curvy and that is a huge source of body negativity in my life. So hearing my friend repeatedly call the body type I have “not normal” just drives the point home in my mind that I do not have a nice body. \n\nI feel like in society today there is love for EVERY body type, obviously it isn’t “perfect” and people are still dicks. But she clings to this idea that society thinks she’s disgusting and therefore has to put down thin women to feel “normal”\n\nTl;dr- My friend constantly body shames skinny women for not having what she considers a “normal” body size", "subreddit": "BodyAcceptance"}
{"post_id": "dqql5e", "created_utc": 1572729278, "title": "How to not let people’s comments about your body affect you", "author": "taterhogs_", "self_text": "So I’m 5’3, and around 122 pounds. In High School I used to weight 140 and I always kept gaining weight near my stomach. Anyways I lost weight when entering University because I was more active, I would walk a lot and also walk to work. \n\nNow before everyone would say I look chubby, my love handles and so on but now, I’m getting shit for being thin. I literally can’t go to any family gathering because everyone has a say in my body. I went to the gym and my dad would say Im already skinny and that anorexic :/\n\nAnd all I do is smile because I can’t say anything  either way. My mom thinks it’s a compliment to be called skinny, and sure but they say it in such a condescending and even jealous way. \n\nAnyone else felt this way ?", "subreddit": "BodyAcceptance"}
{"post_id": "dqwlru", "created_utc": 1572760933, "title": "10 Minute Body Love Practice by Kaylee Misener", "author": "JulieAMao", "self_text": "I use Insight Timer app to meditate and just bookmarked a bunch of body acceptance guided meditation audios. This morning I used one by Kaylee Misener, and it was full of body affirmation. Give it a try!\n\nAnd if you want to be buddies on the app, msg me here. :)", "subreddit": "BodyAcceptance"}
{"post_id": "dr346v", "created_utc": 1572800076, "title": "F*ck Fatphobia", "author": "he_ros_", "self_text": "Hi everyone! Just a quick announcement to tell you that I've crated a sub called r/FuckFatphobia wich, you got it, is against Fatphobia. If you're interested, come on in!", "subreddit": "BodyAcceptance"}
{"post_id": "drimdk", "created_utc": 1572878990, "title": "Gained a lot of weight because of my depression medication and am having a hard time accepting my new body", "author": "LauraXa", "self_text": "Basically the title. In the last 2 years I gained 25kg (55lbs) and am having a lot of trouble in accepting that. Especially now that I get married in two months. Any tips in how I can begin to accept my new body?", "subreddit": "BodyAcceptance"}
{"post_id": "drjhp4", "created_utc": 1572882848, "title": "Post Halloween Selfies/Progress Pics", "author": "maybesaydie", "self_text": "It's that time once again! Post your progress pics below. Please mark all NSFW material and please, no kids.\n\nLet's see the results of your hard work.", "subreddit": "fatlogic"}
{"post_id": "drjxpg", "created_utc": 1572884653, "title": "Body dysmorphia, having pictures taken, and never REALLY knowing what I look like.", "author": "melleilani", "self_text": "25, female, I have body dysmorphia, I’ve been recovering from ED for a few years, and low self confidence. I’m ALOT better than I used to be. I have a lot of acceptance but one thing:\n\nI hate having my pictures taken. I’m getting better, if someone takes my picture I just don’t look at it and keep it moving. I don’t like posting selfies either, because I feel like it’s a lie. “I don’t really look like that”, “it’s the angles, you’re tricking people.” But, i’ll take one every few months and post it to my social media. I’ll get likes, people compliment me, but I don’t feel anything. I just slowly keep it moving. I try to do minimum edits on a selfie. (I’ll take out zits and edit the lighting, slightly edit my jaw, and maybe make my eyes shiner).  But I dont blur my skin, or make my teeth whiter, no extreme photoshop.\n\nBut the worst is when people from work say “Wow you look so different on facebook”, it ruins me. It also confirms my feelings of “you’re lying to people”. I also always take pictures without my glasses on. (I’m always wearing glasses irl) \n\nI just don’t know how to go about this. It makes me not wanna take selfies.\n\nAny advice?", "subreddit": "BodyAcceptance"}
{"post_id": "drkt57", "created_utc": 1572888137, "title": "Trigger warning? Trying to recover from anorexia, having a hard time lately.", "author": "some-velvet-morning", "self_text": "I was never EXTREMELY skinny, but I was pretty damn thin at my lowest weight of 115 (a summer or two ago) and height of 5’6, especially on my frame, which is pretty broad/sturdy in terms of bone structure. But I have been getting healthier because I’ve discovered that food tastes good and it makes me feel good, lol. And I haven’t weighed myself in a long time but I would estimate I’m probably somewhere around 130 now.\n\n\nBut triggers are everywhere. My new therapist knows about my eating disordered past and she said “you don’t look TOO skinny, that’s good” and I know she meant it positively but it triggered me pretty bad at the time. A lot of my old clothes still fit me, but some don’t, and some of them are tighter, and that’s a trigger too. And I can feel my thighs brush each other a bit and sometimes that’s really disturbing to me. \n\n\nSo lately I’ve been getting obsessive (mentally) about calories again, and obsessing over whether or not I look fat alllll the time. I’ve been able to push those thoughts away for the most part, and I don’t really act on them because I still try to eat 3 meals a day and snack if I’m hungry, but I just wish all those guilty and shame-filled thoughts could go away forever. Do you think they will someday, or is this my life now?", "subreddit": "BodyAcceptance"}
{"post_id": "drohmx", "created_utc": 1572902779, "title": "Body-shame advices and comments", "author": "packofviceroys", "self_text": "I think I look great. Yes i have imperfections but overall I think I am fucking hot. I have always thought like this. \nBUT I have always got comments like: Ur very pretty but you have to lose a bit of weight/ Oh if you were size 6 you could be a model bla bla. My friends think I am single because i have 20 extra pounds (even though I carry them very well) but being skinny is whats important. And they always give me advices like this. No one ever has said to me to just love myself. I hear every girl around me complain about her imperfections and criticise other girls for their imperfections. Because of this, even though I love my body, I try to make my imperfections dissapear for years, including losing weight. I know that's not right but I just feel like people are not allowing me to love myself.\nBoys are worse. I know a friend that liked a girl so much but won't go out with her cos he would be ashamed to go out with her in public because she was little overweight. And they are awful at commenting women's bodies and what sexy and what's not. \nI realised I have anxiety of going out with someone because of fear what would people think when they see a person going out with me.\nI am disappointed of myself for feeling like this.", "subreddit": "BodyAcceptance"}
{"post_id": "drrnjx", "created_utc": 1572916259, "title": "I really don’t like my boobs", "author": "cararaca", "self_text": "Every person I’ve been with has said I look good but I can’t help but absolutely hate my boobs and feel like they’re lying just to get some. they’re so small and I feel like my nipples are too big. Like I just feel like a fat man rather than a woman wtf can I do at this point it’s a big part of what I get down about when I’m depressed and apart from surgery it seems like an unfixable problem", "subreddit": "BodyImage"}
{"post_id": "drtohe", "created_utc": 1572925637, "title": "Feeling less confident for a very important job interview tomorrow, because of weight gain after eating disorder", "author": "pbouttav", "self_text": "So I’ve gained about 40 pounds since my senior year of high school (I’m in my final year of college now), and it’s really been killing my confidence. I have this amazing opportunity to have a final interview for a full time job position after graduation and although I am confident and sociable, my weight gain has been taking a toll on how I feel about my image. A little more about me, I struggled with weight my entire life, and had actually had bulimia and restrictive eating habits for 3 years in high school, from freshman to junior year. My smallest size was about a size 0-2 and I loved all of the compliments when I was that size, but I knew that it was unhealthy. I put an end to it senior year of high school and then slowly started to put the weight on, and now I’m a size 8-10 and am significantly happier.\n\nI think that I am a very social person with good qualities that make me stand out, but with my business clothes not fitting the way that I want it to, is really putting a damper on my attitude. My mom has told me that appearance always matters, and that my personality means nothing if I don’t” look good”. I know that size doesn’t matter, but I don’t feel confident in the styling options that I have, especially for business professional attire. Any advice on how to make my personality shine more than my clothes?", "subreddit": "BodyAcceptance"}
{"post_id": "drtxkv", "created_utc": 1572926947, "title": "how can you love yourself at any size?", "author": "melanatedbutterfly", "self_text": "I’m 28; F and weigh in the upper 300s. I know I have to lose weight to have a healthier lifestyle. I’m considered healthy - no problems with high blood pressure, cholesterol, sugar, or anything - just obese. However, everywhere I go, I’m judged for my weight and how I look.\n\nI’ve been struggling with my weight my whole life. I was always either the biggest or nearly the biggest friend or classmate. I always felt like the odd one out.\n\nI know weight is not associated to beauty. However, it is a part of a preference for many people; I don’t fit that preference for most. I have a fiancé currently and he loves me for how I look. However, I wish I was able to love how I look fully. I’m very insecure with showing how I look to him during fun nights out (ie revealing dresses, body cons, etc), beach days, sex - whatever that draws attention to my body.\n\nI feel like as a case manager all I do is help the people I support. But I can’t even help myself feel comfortable in myself while I work on transitioning to a healthier weight.\n\nYou should love yourself in any part of your body’s journey. But I don’t even know where to start or how I will feel when the weight is off.\n\nI’m like 👌🏾 this close to skipping meals - it’s dramatic lol - but I feel low key depressed that everywhere I go, I’m told about a new diet, or told by a stranger that I should consider losing weight. Like no duh, but shit; leave me alone.\n\nOkay, I’m done. But I would like some advice on how I can learn to love myself no matter what size I am.\n\nThank you in advance 💛", "subreddit": "BodyImage"}
{"post_id": "ds0elt", "created_utc": 1572966431, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dscbne", "created_utc": 1573021323, "title": "Asymmetrical face annoying me", "author": "Laurie_Nicholls", "self_text": "I’m 15 yr old boy and I’ve noticed my face is very asymmetrical, my eyes sit at different levels and one side of my face looks to be pushed back. I sleep on my front on the side that looks weird, could this be the reason of asymmetry? Otherwise what are some tips to get over asymmetric face. Thanks", "subreddit": "BodyAcceptance"}
{"post_id": "dshkc1", "created_utc": 1573052874, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "dsi01u", "created_utc": 1573054829, "title": "Unhelpful family", "author": "vicvivix", "self_text": "I’m from an Asian family and my mom and younger sister are of an average/lighter weight and my dad and I are on the heavier side. Unfortunately for me I’ve always been the only chubby kid in my family and it sucks cause the rest of them are really petite... so no hand-me-downs could ever fit me, neither could I pass my clothes down to other family members. My weight has never really been a problem, until recently when my weight shot up tremendously due to the stress I have from my major exams coming up. My family instead of helping have just been very harsh and critical of it, especially my parents. My mom and dad directly fat-shame me and it really hurts my feelings. I took it as a joke at first but now they really just keep bringing it up in conversations like “Your main focus should be losing weight not studying”, “We spend way more money on your clothes and it’s so hard to find your size anyway, just wear your dad’s shirts” even to the point of “hey we didn’t cook your share of dinner, you’re too fat already” \n\nI understand their concerns about my sudden increase in weight which is normal for anyone’s family to react when they have a sudden weight gain/loss, but this is really to a point where I cannot take it, especially with the major exam period nearing. \n\nI would normally go out and exercise, but since I am too busy studying, I don’t have enough time to get an actual workout routine rolling. I have told them about my feelings but they just dismiss it as me being sensitive, and they just continue to fat-shame me as if nothing happened. I really cannot deal with this as it just happened all of a sudden and I already told them my plans of starting my exercise routine again after my exams are over.\n\nI normally just love my body and my curves but with this current situation, what should I do to regain my confidence? :(", "subreddit": "BodyAcceptance"}
{"post_id": "dsnaxo", "created_utc": 1573077293, "title": "I need help on a project please!", "author": "kcstoller19", "self_text": "My friend and I are doing a YouTube series about hard topics that we all face. Ranging from  emotional abuse, school stress, but body image is a huge one we are discussing. What are some key points you guys feel should be discussed? \nWe have our own experiences, but I don’t want to miss things either!", "subreddit": "BodyImage"}
{"post_id": "dso17p", "created_utc": 1573080277, "title": "Trans Guy with Stretch Marks (Need Support)", "author": "yeet_my_teets", "self_text": "As you can see by the title, I’m a trans male (meaning I was born female and realized I align more with the male gender, so now I have a different name and use he/him pronouns to describe myself) and I recently gained a lot of weight due to a few medications I was taking that caused my already thicc thighs to get thiccer and created some very noticeable stretch marks. I’ve been having trouble dealing with them, because in my mind I associate stretch marks with women, and having something that I feel is “womanly” on the body that I wish to appear manly is very triggering. Do more guys have stretch marks than I think? Or is it just one more thing to add to the list of dysphoria items? Are stretch marks perceived as “unnatractive” on men and that’s why I don’t see them in the media? It’s really hard to be trans and love your body (at least that’s my experience) but I’ve really been trying to cope with what I can and change the things I need to. Would love to hear your opinions on it!", "subreddit": "BodyAcceptance"}
{"post_id": "dsohgy", "created_utc": 1573082292, "title": "needing some fashion wisdom", "author": "sammers916", "self_text": "i am a 6’1” f with very thin/long legs and a short mid section, which is where my weight gathers. i weigh 175 pounds to date, and i’m not in any type of good shape (i’m not overweight or inactive, i go to the gym and run about 2-3 miles each time) i simply don’t love how my body looks in clothes and need advice on what would flatter me. i tend to like a line skirts/dresses or flowy shirts with tighter pants. i’m not sure if i’m doing anything wrong, or if i could just use some alterations, but i would love to look in the mirror and not feel that little bit of doubt. any and all suggestions welcome.", "subreddit": "BodyAcceptance"}
{"post_id": "dsyzz5", "created_utc": 1573139263, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "dt22g2", "created_utc": 1573152110, "title": "Change of perspective.", "author": "Serunette", "self_text": "this is just a random thought i have and i felt the need to share it.\n\ni remember when i was 12 or 13 years old i started feeling extremely self-conscious about the way i looked (which i believe is \"normal\"). i was especially unhappy about the shape of my body, i thought i looked weird, short and squished together. i thought my hips were massive and i was SO insecure about being a \"pearshaped\" person. i was unhappy with the fact that i had no boobs and a very straight upperbody but was more curvy on the bottom. i thought i looked skinny-fat, although i was infact very skinny (and still am).\n\nwell, i'm 18 now, still struggle with my body, but something ironic happened. i look at myself in the mirror and think \"i wish my waist was smaller and my hips were wider\". sure, i'd also like bigger boobs, but nowadays i'm way more focused on the hip-to-waist-ratio and constantly wish there was a more significant difference between these two. i do think it must have to do with the whole instagram models, which definitely impacted our society and girl's views of an \"ideal body\". \n\ni just find it ironic. i used to wish my hips were small and my boobs were huge, now i wish my hips were more rounded and wider. isn't it weird? did any of you also experience this shift of perspective?", "subreddit": "BodyAcceptance"}
{"post_id": "dt3sm4", "created_utc": 1573158781, "title": "guilt-tripped with my insecurities", "author": "boucantfindme", "self_text": "i just can’t accept how i look. Since I was 12, i’ve grown more and more conscious of both my body and face. At that time, i started working out, because i felt too fat. The thing is, i was and am not overweight, and most would say i’m somewhat skinny, but i could not see that. these workouts quickly became toxic for me, as i’d beat myself up if i missed a day. i skipped any meal i could; if my family couldn’t find out, i wouldn’t eat. after around a year of that, i stopped working out and controlling what i eat, and i was somewhat happy, but deep down, i still disliked my body. this year, around 2 months ago, i started working out and being conscious about what i eat. it’s been fine, but i still often beat myself up if i miss a day or eat something i shouldn’t have. it’s extremely toxic, but if i stop this cycle, it seems like my body would only get worse.\n\ni’m super insecure about my face as well. all the girls around me are so beautiful, and i’m just not. i know that when my friends compliment me, they don’t mean it. some boys from my class have said that i have a sexy body, but my face is unbearable. i already know that i’m not attractive, and people tell you to ignore those things, but it honestly hurts. even though i don’t care about those people. i can’t change my face, and i simply don’t know how to live with it for the rest of my life.\n\nit also doesn’t help when you have no one to vent to (kinda why i’m posting this here). whenever i express my insecurities to my friends, they always just say things like “you’re not ugly”, “i’m fat, don’t say you don’t like your body”, comparing me to their insecurities and guilt-tripping me about how i don’t have the right to complain. deep down, i know that they probably think that i’m seeking for attention, but it’s not nice to not be allowed to be unhappy about myself.\n\nwhile i don’t want to waste my time on worrying about how i look, looks are a huge part of our daily life, and it’s really consuming me.\n\nplease drop any advice you can... thank you ❤️", "subreddit": "BodyAcceptance"}
{"post_id": "dt6amn", "created_utc": 1573168975, "title": "Hey, what’s one thing you genuinely like about your body?", "author": "abbylikesoreos", "self_text": "Just one thing.  Mine is my hair.  I have trouble with this too.", "subreddit": "BodyAcceptance"}
{"post_id": "dtgpmp", "created_utc": 1573225840, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dtx22y", "created_utc": 1573311996, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "du147i", "created_utc": 1573330681, "title": "Abandoning the ideals of past generations", "author": "rachelberleigh", "self_text": "OK so something that I think is becoming obsolete now and hopefully will just go away completely is having any kind of expectations or standards about how someone looks or how they present themselves. Such as expectations about the way you present your gender, how to define masculinity and femininity, how you “should” present your race or ethnicity, how you “should” fit into your social class, etc. I think that all of that is just meaningless. It doesn’t really contribute a whole lot to society and I actually think you could say that it take takes away from society because it puts people in a made up box. Like because of your expectations you prevent people from expressing themselves.\n\nBut the reason that I’m thinking about this is because my mom was watching a video of Niall Horan’s music video she literally said “does he not realize that his gut is sticking out?” and I’m like...you’re kidding me right. Who tf cares if he has a gut or if it’s sticking out? And plus I would have never noticed anything if she hadn’t pointed it out. It’s just part of the older generation I think that everything needs to be a certain way but their way is not the best, in the slightest. \n\nOn a brighter note, I think nowadays that box is becoming at least bigger and hopefully it will fade away to allow anyone to be seen and heard regardless of what they look like. Looks and genes are such a surface level and shallow way to judge someone. I think that in the future people will understand you don’t have to look like anything traditional or acceptable in order to be heard.", "subreddit": "BodyAcceptance"}
{"post_id": "duaa7f", "created_utc": 1573384840, "title": "I have a love/hate relationship with my penis... sometimes I think it's beautiful. Other times, I can't even bear to look at it.", "author": "throughmethroughyou", "self_text": "I'd been molested/raped (?) as a kid and the guy's package was the first one I'd seen, other than my own, which was covered with hair. At that age, I hadn't hit puberty yet so had no idea that it was only natural to have growth down there. I just wanted to forget about my past so blocked out the entire incident as best I could. Fast forward to my high-school years and I notice my body starting to change, specifically my crotch. I'm horrified. All the images come flooding back to me. His face, his eyes, his hair. I don't know what to do. I have no one to talk to. I notice my dad's shaver and get the bright idea to buy a blade and shave off my pubic hair. Problem solved, or so I thought... .\n\nSize was another issue. Having spent my formative years secluded from my peers, I had no idea what the average size of a penis should be. Discovering porn didn't help any either. Nor did the drugs I'd take to alleviate my anxiety and fears for they would constantly keep my size in flux. I've finally made my peace though. My penis isn't the biggest, nor is it the widest but, it is pretty beautiful.\n\nAnd I love it.", "subreddit": "BodyAcceptance"}
{"post_id": "dv2mjk", "created_utc": 1573521979, "title": "How to accept body changes???", "author": "friedchicken7557", "self_text": "I’ve struggled with my weight since a super young age (since age 10). I’ve been through it all- anorexia, binging, working out way too much and eating way too little, and also gaining weight. I’m 5’6, my average weight is 145/150. I started lifting heavy weights, and eating a lot so I’m seeing lots of muscle growth. Problem is, I’m out growing all of my clothing. It’s making me feel large!! How do I just accept my body and stop hating myself for not fitting into my clothes??", "subreddit": "BodyAcceptance"}
{"post_id": "dvatfy", "created_utc": 1573569500, "title": "It’s been a long time.", "author": "herza12", "self_text": "So I’ve had body image issues since as far back as I can remember. I think it started when I was 7 yrs old. I’m just seeking advice. How did you learn to accept yourself after putting yourself down for so long? How did you start? Little steps to take?", "subreddit": "BodyAcceptance"}
{"post_id": "dvb71w", "created_utc": 1573571228, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dvre5d", "created_utc": 1573649902, "title": "Thought I had accepted my body but I felt uncomfortable when a FWB and I got intimate last night", "author": "everyonebutme23", "self_text": "Basically in the title. I've been in the community for a while and I thought I'd reached a place where I was comfortable with my body and the way it looked. However last night when a FWB and I started getting intimate I froze up. I just struggled to believe that he really liked the way I looked and that he really wanted to be with me despite him making it clear for months and being very patient with me and my journey to self love. We ended up stopping and he didn't make me feel guilty or anything but I really would like to get intimate with someone eventually and I'm starting to think that's going to be very difficult due to how I feel about my body. He's also smaller than me (weight and height wise) which made me feel very awkward.\n\nHas anyone else ever struggled with this? What helped you overcome this?", "subreddit": "BodyAcceptance"}
{"post_id": "dvt1q2", "created_utc": 1573657688, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "dvtu9m", "created_utc": 1573661061, "title": "Off social media for a year. First day back was...not so great.", "author": "[deleted]", "self_text": "So my husband and I got married last year after that I have basically been absent from social media, deleted the apps on my phone but will occasionally look while I am at work. Just to stay updated on my loved ones lives. I was having a really hard time with self acceptance, comparison and my body changing as my life style changed and became more stressful. \n\nToday I woke up, got ready. Felt REALLY cute. And it was a first for me in a bit. My first instinct was to take a selfie, post it to show to the world how confident I was. \n\nI did take the picture, I did post it. And about a half hour after posting it I got insane anxiety. Even though my body image hasn't been 100% positive this past year off of social media, it has been more rich, I live in the present and I am not constantly comparing myself to other people. Social media is the drug to my addiction of self hate. And I think I am always just going to be one of those off the grid people. Only out of self preservation. \n\nHow do you have a good relationship with social media or with yourself in general? I am always up for hearing advice and suggestions on how to pivot my way of thinking.", "subreddit": "BodyAcceptance"}
{"post_id": "dw7ebs", "created_utc": 1573725388, "title": "Trader Joe's is not fat friendly?", "author": "Pugshugpugs", "self_text": "Hi! \n\nTo those of you who live near a Trader Joe's, do you feel like you get weird looks from people or like they aren't as friendly to you if you are a person of size? I am a short fat woman (and proud!) And I just don't feel like my money is good enough for them lol. Anyone else have this experience?", "subreddit": "BodyAcceptance"}
{"post_id": "dwar4v", "created_utc": 1573744061, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "dwelb0", "created_utc": 1573760235, "title": "Still getting used to my \"new\" body", "author": "throwawaythosecreeps", "self_text": "I've gained weight over the past couple years, about 20 lbs. A few years ago, I was barely 100 lbs. I was mostly just so depressed that I wasn't eating or sleeping.\nIt's so hard to go from that skinny to the point where I have slight \"back rolls\", a stomach that isn't flat, and thick thighs. On top of that, my chest is still pretty small and disproportionate. \n\nMy insecurities were even more pronounced in my last relationship. My ex used to look at Instagram a lot, mostly to check out the hot, \"perfect\" Instagram models that I could never live up to. And he would look at them right in front of me. It propelled me into a deep depression and caused me to hate on my body more than ever. \n\nIt also doesn't help that I've posted on NSFW subs on reddit. I really enjoy posting, but not when I receive horrid comments that only confirm my fears about my body. It takes a lot of courage to post, and being knocked down like that is really demoralizing.", "subreddit": "BodyAcceptance"}
{"post_id": "dwmiv3", "created_utc": 1573797752, "title": "Starting to love myself again", "author": "zappleg", "self_text": "All my life i have been chubby/a big girl, and never really payed attention to how i looked. Quite frankly i loved the way i looked all up until i left school. But in between grades of course i was aware i was bigger than almost ALL the girls in my grade, plus i never looked my age and still don't.\n\nMind you \n1. Stress\n2. Not eating enough\n3. Eating too much\n4. Not enough water\n5. Sleep\n\nAll 5 i just named were ALL of my battles. I had all of them since little, never liked to sleep, and than when i got older it got worse. \nSame with the eating, I'd binge till there's no tomorrow than would go days without food or water.\n\nRecently i dropped 25 pounds\nThe highest I've ever weighed in my life was 262 at 15 years old\nAnd it scared me to DEATH. That number was to never reach any further and i refused to let it. So i took a stand for my health, i already battle with sickel cell and possible arthritis so all that weight on my bones and joints will make it SO much harder for me to function on a day to day basis.\nI am 16 now and weigh 237\n\nI'm not completely in love with my body, but I've learned to love it SINCE i am changing it. Yes i was bullied all my life you already know how that goes, but i never let it cripple me. \n\n I struggled with hating how i looked and than not doing ANYTHING about it and I would be a hypocrite and say \"i wish i was skinny, i wish i looked like her\" and than continue to do bad habits that would cause me to blow up you know? Not on purpose but just out of being SOO stressed with my personal life. Stress and depression are bad toxins that your body doesn't need, so if you have either one or BOTH, you'll blow up without even realizing it until you look at yourself.\n\nSo i stood my ground and got tired of it. I don't want to be skinny, nor disgusted with myself, i dont want to look like anyone else, my body shape is perfect like how God made it and i will HELP sculpt it out to be nice and HEALTHY. \nNOT skinny.\n\nAlmost every big girl i have ever talked to always refrenced to being \"skinny\". \nThey don't want their gut, their cellulite, their flabby arms, they just want to be flat and toned all the way around. You see skinny was always in, you never saw chubby/thick/heavyset girls in commercials, nor flaunting their confidence in themselves because who wants to see that? It's nasty disgusting and uNhEalThy.\nI mean Who wants to see OTHER than the typical skinny girl? You know? so me myself and I wanted to share my take on my body as of right now. \n\nStill a teen and will always have problems within myself but for thr most part, being fat isn't the problem, the problem is not being HEALTHY. And that is what i want, so if your struggling with your body image wether \nskinny/big\nTall/small\nYoung/old\nTake a stand to want to FIX it what you DO NOT LIKE!!!  Don't set a standard for yourself to look a certain way because you stand out from everyone else. Don't let the stereotypes of your gender take a tole on how YOU should look and feel. Stereotypes are a disease to the mind and are to be terminated within the -0.1 seconds it reaches your mind okay?\nHonestly stereotypes are they JUST so you won't be your own person. It's easier to have everyone in one category, rather than have a million.\n\nWant better for your health. If your healthy in the inside, you don't think your outsides will be intact? \nIt WILL! \n(This applies to guys too, i never forgot about y'all lol)", "subreddit": "BodyImage"}
{"post_id": "dws1tk", "created_utc": 1573830637, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dx237m", "created_utc": 1573877834, "title": "I feel I'm weird", "author": "TheGamingFan", "self_text": "Hi guys\nSo I'm 16 yrs old....and I'm around 172cms\nI hv been the same for 2 yrs now and i feel I'm not growing\nI really want to be 6 feet.. so I would love some help on that\n\nAnd i also have a lot of  body hair(in my thighs also)and also have neck hair....when people in my class have nothing or very less\nSo Is there any way that I can overcome this and just reduce it .....pls help\nThanks a lot", "subreddit": "BodyAcceptance"}
{"post_id": "dx7z2j", "created_utc": 1573916792, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "dxdobx", "created_utc": 1573942699, "title": "In our new world of body acceptance and body positivity, how do I make peace with the entities still trying to convince me I'm literally not worth it if I'm overweight?", "author": "diddlydeedledoo", "self_text": "I recently decided that since buying a house, it would be wise to get disability insurance enough to be able to pay my mortgage payments if something were to happen to me and I couldn't work. The agent whole sold me my homeowner's insurance suggested months ago when I first bought the house. I did my own research and decided it was something I wanted to do. I went to his office, took a health survey, and everything seemed fine. I signed my name, and he took my first payment. I got a call yesterday from him saying that my application was denied because of my \"height to weight ratio\". ???? I'm miffed and embarrassed and apparently not insurable. I'm healthy!! I don't smoke, my blood pressure and cholesterol are normal, glucose levels normal, and I exercise regularly (heated yoga 3x per week). Any advice? Should I try a different insurance agency? I'm so disappointed because of all the mental work I've been doing over the past 5 years or so to come to terms with being overweight.", "subreddit": "BodyAcceptance"}
{"post_id": "dxoq8l", "created_utc": 1574008638, "title": "How to accept your disproportionate body?", "author": "DykesOfHazzard", "self_text": "23F, 5’8, around 64kgs. I have a very strange build. Wide shoulders and hips, thick muscular arms and legs (woo weightlifting), very small breasts and waist. Clothes don’t fit me. I feel very much like my body isn’t how it’s supposed to look, and that it isn’t finished. Friends and family have always mocked my chest, especially in relation to my shoulders (around my busy is 33 inches, around my shoulders is roughly 37 inches). I’ve consistently felt like my chest makes me unattractive, and that I don’t look ‘right’. I’m very aware of the relationship I have with my upper body, and how it makes me feel. \n\nThe million dollar question is, how the hell do I start to feel better about this? Or even accepting? I’d love to just love myself.", "subreddit": "BodyAcceptance"}
{"post_id": "dxuzph", "created_utc": 1574035370, "title": "I'm not worried about being attractive; I can't see the beauty in myself and I feel like life is less fulfilling", "author": "hot-apple-cider", "self_text": "I've struggled with highs and lows of loving my body, specifically my face, since middle school. There are times when I feel great, and times when I am convinced I am simply an ugly person and I'm going to have to suck it up. The problem isn't that I think I'm unattractive, I get validation from others, and although nice, I don't put a lot of weight into it. The real thing I want is to find myself beautiful. I can so easily appreciate the beauty in other people, but I just can't see it in myself. Or, the things I find beautiful in other the people are the traits that I don't possess.\n\nI think part of the problem is that I don't \\*really\\* know what I look like. The mirror, photos, and videos show a completely different person each time. I see a good photo of myself and think its just the angle that makes me look good, and then I see a bad photo and think that that's probably what I look like. I don't know what to believe.\n\nFor reference, I'm 20 and female. I know this isn't unusual. I'm also an enneagram 4, and have this problem with wanting my life to be like a movie. Protagonists are always beautiful. For some reason, I just don't find as much meaning in life without being beautiful. I want to be a part of the beauty I see in the world, and I just don't feel that way.\n\nI guess I'm wondering if anyone else feels this way, and if so, what do you do to cope? I'm currently in a period of feeling bad about myself and I find it quite debilitating.", "subreddit": "BodyAcceptance"}
{"post_id": "dy5x33", "created_utc": 1574096569, "title": "🎂Meta Monday: Happy Birthday /u/GetOffMyLawn_🎂", "author": "maybesaydie", "self_text": "It's our favorite mod's birthday today. Many of the technical things that make this sub run smoothly are the work of the birthday lady. We're lucky to have her.\n\n\nToday we're opening this post to ~~causal~~casual conversation. Please no rants.\n\nNext selfie post will be the day after (US) Thanksgiving. Get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "dyazrx", "created_utc": 1574117221, "title": "(Perceived?) Judgment from family", "author": "2991lme", "self_text": "This is a rather summarized version of this sequence of events, missing plenty of details. would love input on how to sit with this and not lose a relationship with family members:\n\n•Wedding dress shopping with mom and sister: explicitly asked them not to bring up weight loss because I was in a bad place in terms of body image and wanted to stay positive. I made one comment about hoping to tone up a bit before the wedding and they thought that meant they could make comments. We had a 30 min conversation about different weight loss solutions and why I don’t like to talk about it, all while I say there crying asking them to stop talking about it. \n\n•wedding came and went and I stopped focusing as much on fitness and nutrition (as I’d guess is normal?). 3 months after wedding I go on beach vacation with family, super anxious entire time about being in swimsuit around family who are all smaller than me. 2-3 weeks after vacation my sister calls and says I should wait to have kids for several reasons, one of which being my risk for gestational diabetes (mind you, my midwife did not express concerns about such a risk, nor did I express any serious plans to try to have kids soon, rather it was a fun conversation to have as newlyweds with my family)\n\n•I tried to address this with her days later because it was still sitting with me and causing major frustration, making my husband feel like my sisters input about when we have kids had more weight than his. I got super anxious and in my head so much about body image that it even started causing intimacy struggles. When I brought this to my sisters attention purely wanting to tell her how I felt so she could understand (honestly was so calm about it and did not attack her rather said how I was feeling), she turned it on me calling me sensitive and defensive and saying I need to see a therapist about how I respond to her. And that I’d been so distant and dismissive and ruined our relationship....  \n\nShe called 10 min later to apologize for not listening..\n\nToday, I still feel tension toward her but do not want our relationship to be ruined. She and I are so different and I don’t think she understands how I operate mentally or emotionally, and I don’t know that she wants to understand. My plan is to shut these conversations down if they ever come up, and/or remind myself that I can only control myself and my responses. But honestly it’s super shitty to have this tension with her, coupled with some fairly significant body image issues already. \n\nAny thoughts would be great", "subreddit": "BodyAcceptance"}
{"post_id": "dyh49l", "created_utc": 1574147903, "title": "Realising I really hate a tattoo I’ve had for 8 years and don’t know how I can ever love or accept myself or my body", "author": "SkyHy214", "self_text": "Hi, I’ve lurked here a bit but never posted... \n\nI’ve always had problems with loving my body. I’ve always fixated on the things I dislike. I’ve taken people’s comments far too much to heart. I try to practice body acceptance and taking up sports has been a helpful way of celebrating my body for what it can do rather than what it looks like. \n\nI began getting a small tattoo removed earlier this year. It’s happening very slowly and I may seek out a different kind of laser. But this process has made me realise I really don’t want to be a tattooed person any more. I have three other small tattoos and one which is essentially a half sleeve. The three other small ones are fine and I don’t mind them so much, but the large one is driving me out of my mind. \n\nI feel like I want to tear off my skin. I can’t believe I did this to myself. I can’t believe my mother can still love me when I did this to the body she grew. I can’t respect myself at all. I avoid looking at myself while getting dressed or showering so I don’t see it. I get distraught every time I see a woman with bare arms on tv or online (its winter here lol). I know I need to look into laser for this tattoo now, which is expensive but I reckon I can afford it if it’s spread out, but I know the process will take a couple of years and I may be left with scarring.\n\nI don’t know how I can love my body when I’ve done this to myself. It’s a physical reminder of the bad decisions I made. For context, I got the tattoo at a time when I was in an emotionally abusive relationship (he didn’t tell me to get it, but I was still not in a good way). \n\nCan anybody help me with a little bit of acceptance, so I can get on with my daily life? This has been the central thought going through my mind for weeks now and I’m losing sleep.", "subreddit": "BodyAcceptance"}
{"post_id": "dyll8c", "created_utc": 1574176016, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dymhp0", "created_utc": 1574179957, "title": "Living with folliculitis😔 If u have this leave a comment pls🧡", "author": "Jo-17", "self_text": "I really wanna talk about something that makes me unhappy almost all the time. Something that keeps me from loving my body and accepting it. Something that i hide from everybody, because I’m too ashamed to say it out loud. \n\nI have folliculitis. \n\nFolliculitis is actually the infection and inflammation of one or more hair follicles. This rash may appear as pimples that come to white tips on the face, chest, back, legs, buttocks, private area. It's usually cause by a bacterial or fungal infection and it can spread and turn into nonhealing, crusty sores and leave really bad scars. You may ask yourself, why I’m so ashamed about this because it’s a common thing for tennagers to have it on their face or back. I really wished I had it where most people have it, but no, unfortunately, I have it on the most uncomfortable parts: my butt and private area. \n\nGrowing up, my body was normal, like everybody else, till i turned 13 and puberty hit me. That’s when all things went crazy. I starting noticing little pimples on my private area and butt. I was waxing so I didin’t know what was the problem. These pimples in time, turned into red bumps that caused me awful pain. I remembered telling my mother about this and she told me it was a normal thing and that I shouldn’t worry about it. But this bumps never healed and left me with permanent purple scars(on my butt) and with red bumps(on my private area). For the first time in my life I felt ashamed of my own body. Going to the beach and seeing girls, my age, havind perfectly normal butts without scars on them made me feel so miserable that I would cry for hours in my room, thinking “why I am not like them?”. Years passed till i had the courage to go to a dermatologist and they diagnosed me with folliculitis. I finally had an answear for my condition, but that didn’t helped me a lot. The lotions from my doctor made the bumps go away, but still left me with really bad scars. \n\nThis affected me in so many ways, that when i went to the beach in the summer, I covered up my butt with a towel and i didn’t want to go into the water because i was too afraid that people will see my scars and judge me. When my boyfriend invited me to go with him and his friends to the pool, I refused, because I was so afraid that if he saw my body he will freak out and be disgusted of how i look. My self confidence was really down...I couldn’t even look to myself in the mirror and not feel sad. When I had really sore bumps, I couldn’t even sit properly or not felling itchy down there. I always came up with excuse for my bad mood or why I couldn’t go to the beach or wear certain things. I felt like i was trapped in my own body and I couldn’t escape. \n\nLoving your body it’s such a nice thing that is stole for me everyday just for having this condition. I really feel like I’m the only one dealing with this and want to feel, just for a couple of seconds, like a normal 17 year old girl. Will anyone ever love me like this?", "subreddit": "BodyAcceptance"}
{"post_id": "dytiow", "created_utc": 1574208912, "title": "Body Image Survey For Class Project", "author": "bethers_", "self_text": "Hi everyone! I'm conducting research between social media influencers and body image for a class. I'd really appreciate it if you could take my survey! It should take 2 minutes tops.\n\n&amp;#x200B;\n\n[https://forms.gle/yCf6XBo4H33JDg947](https://forms.gle/yCf6XBo4H33JDg947)", "subreddit": "BodyImage"}
{"post_id": "dyzwm7", "created_utc": 1574243370, "title": "I hate my fingers.", "author": "jisungclouds", "self_text": "I have long, thin fingers and my friends always compare it to theirs.\n\nThey always put theirs against mine and say stuff like, \"wow, you have such long fingers!\"\n\nAs a result, I've grown insecure of my fingers. I get jealous over my friends who have such feminine and small hands.\n\nI know hands are something most people tend to overlook and that being insecure over them seems pointless. Still, I find accepting having this feature difficult because a lot of my friends unconsciously bring me down by continuously comparing their hands to mine.", "subreddit": "BodyAcceptance"}
{"post_id": "dz21s6", "created_utc": 1574256481, "title": "What to do about my Stretch marks?", "author": "DesignerKey", "self_text": "Hi. \nI lost weight last year and due to how quickly the weight was lost, it caused me to get sketch marks on my lower part of my stomach. And a few at the back thighs. \n\nI absolutely hate them and want to remove them through surgery but don't have the money. My boyfriend says they are barely noticeable but I already feel like I'm so unconventional looking; I am chubby, and short and occasionally get acne. I don't want to be covered in flaws. \n\nWhat to do? I feel an enormous disgust and don't know how to overcome it. \nAny advice would be great ❤", "subreddit": "BodyAcceptance"}
{"post_id": "dz32yy", "created_utc": 1574261563, "title": "How to like yourself after large changes in body?", "author": "msp827", "self_text": "I don’t really know how to start this off so I guess I’ll just get into it. I used to be really fit, skinny, etc etc. I gained a bunch of weight starting around 2 years ago this February. I lost some, now I’m at a weight that I like pretty well. Although I like my weight, I absolutely loathe the fact that I lost the perkiness in my boobs and have stretch marks on my legs... there’s not much I can do for my boobs as I am a 34D, and working out only does so much (unless I get surgery of course, which isn’t ideal or viable.) Plus, I’m in my first year of college, so everyone else still has really perky boobs and it just makes me feel really sad and empty that I have these very obvious imperfections that seemingly no one else has... is there any way I can like myself even after I really screwed myself over?", "subreddit": "BodyAcceptance"}
{"post_id": "dz3aiw", "created_utc": 1574262487, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "dz8tme", "created_utc": 1574286485, "title": "Genetic Traits that have become Insecurities.", "author": "hotel_bella_muerte", "self_text": "I’m an extremely insecure person. I hate pretty much everything about myself. I have an interesting body type, I have a baby face, slouchy shoulders, a small torso, and pretty large legs. I gained most of these traits from my mother, with her legs being much bigger than her torso as well. They are my biggest insecurity. I know there’s not really anything I can do to control it, and it makes me feel awful because I feel so ugly. I have one friend, she tries to assure me that “everyone’s worst judge is themselves” which I do get, but I just feel like nobody likes me because I’m more curvy than others. I’m not sure what to do. \n\nAnother thing is acne and like facial structure. My back is covered in acne, and I’m currently going through a breakout. I’m always under much more stress then I can really handle, so that’s probably a reason. I’m past the age where acne tends to be most prominent, but I still break out all of the time. I don’t go swimming because of how I feel albeit my body and the fact that you can see the acne I have. \n\nIf anybody else struggles with these things, please let me know.", "subreddit": "BodyAcceptance"}
{"post_id": "dzb5xa", "created_utc": 1574296819, "title": "Tips for how to cope w the knowledge that I will never be attractive", "author": "soowon2014", "self_text": "23f : Hi. I know I’m not pretty, and I’m not looking for sympathy. I’ve been uglier and over time I’ve improved the condition of my skin, the way I dress and carry myself, and I’m in relatively good shape (5’3”, 120 lb). But the fact of the matter is I know that no matter how much I do, I can move from ugly to “not ugly” but I will never go from there to “cute” or “pretty”. I have a long torso and short, thick legs with disproportionately small feet. My shoulders are wide. I have weirdly wide hips for the relatively small amount of ass I have. My forehead is small and slopes and I have a big, fleshy nose and small eyes and an unbalanced face (area underneath eyes is much larger than area above).  Basically, I’d have to go through extensive plastic surgery to be truly content w my appearance. It just breaks my heart that I will never be beautiful. Not even for the sake of attracting people, but for the sake of just enjoying the way I look and being able to consider myself an attractive person. Have any of you gone through something similar? At the risk of sounding dramatic, how can I live with the knowledge that I’ll always be plain? Is there anything I can do other than “love myself” in an unrealistically inspirational Pinterest way in order to not be devastated about this?", "subreddit": "BodyImage"}
{"post_id": "dziwrt", "created_utc": 1574340869, "title": "What did you do for yourself this week?", "author": "mizmoose", "self_text": "What did you do to make yourself feel better?  \n\nWhat progress have you made to accept yourself as you are today?  \n\nWhat made you smile? \n\nWhat made you realize that today is a better day than yesterday, and maybe tomorrow will be even better?", "subreddit": "BodyAcceptance"}
{"post_id": "dzkkvb", "created_utc": 1574348866, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "dzysks", "created_utc": 1574415646, "title": "My boyfriend has low self esteem.", "author": "Andi_5150", "self_text": "My boyfriend is a very handsome man. He is 25 years old 6’3 and has an amazing career for his age. He is very successful. He was a chubby kid growing up. He looks in the mirror and is disgusted by his self image. He is completely fine and he goes to the gym every day. I love this man. How can I help him ? I complement him often. I make him feel good. But out of nowhere he will start to feel down. When I first saw him I thought he was hot af. But he sees the exact opposite and talks down on himself. How can I help him ?", "subreddit": "BodyAcceptance"}
{"post_id": "e028cw", "created_utc": 1574435384, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "e09p93", "created_utc": 1574466867, "title": "Insecurities Control My Life", "author": "just_peachy3002", "self_text": "Hello everyone! I am a 16 year old girl in highschool. I need some advice on body insecurities because I have so many. I think my hands and arms are so fat and ugly so I wear long sleeves as often as I can even in Summer. I think my nose just looks plain out weird. I feel so overweight that it's a habbit for me to constantly suck in my stomach no matter where I am. I also have some acne usually near my lower face and neck area, sometimes on random other places on my body. I also hate my feet because I have flat foot syndrome which means that I have no arch on the bottom of my foot like normal people do. My feet also stick outward like a duck and that is just the way I was born. I hate the way my boobs and butt look. And all of those are just my body insecurities. Don't even get me started on other insecurities I have about myself. Anyways, all of my insecurities take over my life in a way because I can't even be myself because of them. I can't talk to a guy that I like. I can't eat in front of people at school. I don't even like people looking at me from the side because I hate my side profile. And whenever I take a picture of myself or a picture that someone else took of me, it has to be edited and/or have a filter. I am extremely lonely because I have no friends at school or anywhere except one that lives in another state. I really love talking to people but I only do when they start talking to me first because of how insecure I am. I have never in the 16 years of my life had a boyfriend and personally I feel like guys don't try to talk to me because of how I look. I'm a really interesting person if people would just actually try to get to know me and start up a conversation. Does anyone have any advice on how to deal with all of this? Please help.", "subreddit": "BodyAcceptance"}
{"post_id": "e0izwz", "created_utc": 1574521607, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "e0psm3", "created_utc": 1574550432, "title": "Is getting tattoos to cover up stretch marks a good idea?", "author": "daintysunflower", "self_text": "I’ve gotten stretch marks because I gained a lot of weight after getting kicked out of my parent’s house. My boyfriend says I’m still beautiful and he still loves me. \n\nWill the tattoos help cover them up or will they just show through?\n\nEdit: I have stretch marks on my inner thighs and sides of my thighs and hips.", "subreddit": "BodyAcceptance"}
{"post_id": "e0r9jl", "created_utc": 1574557231, "title": "I hope this is okay - first post. - needed to share with someone. (ITS LONG , i said i'm sorry)", "author": "lilipoirier", "self_text": "  \n\nStop saying my face is pretty.\n\nToday was a day like many other. Something special yet ordinary happened. It was while I was having a conversation around the kitchen island with my mother. Now, I have always being a bit chubby and my mom made us go on a thousand diets when I was younger. But that’s only partly relevant. \n\nSo I was having a conversation with my mom and I was just pointing out in conversation how insulting it is when people say to fat girl like my self, how pretty our faces look. As if the face was the only part of my self being deemed worthy of praised as I obviously did not deserve to be simply called pretty because of the rest of my body is unacceptable because of its fat content. My point is, say I’m pretty, point. Or don’t say anything at all.\n\nAnd I kept going with examples of stuff that annoys me, like ; when people say I’d be prettier if I lose weight, and that’s where the punch line comes in. \n\nMy mom, who had not said much till then, (I’d assumed she was agreeing with me you know) but no that’s where he true feeling shines thru when she very simply answers… “Yeah as if you did not already knew”\n\nAnd I was shook. But you know what I did ? \n\nAbsolutely nothing,\n\nBecause that is what us daughters do when our parents hurt our feeling. At least that is what I do. I brush it off thinking they don’t mean anything by it, because surely they love me right? There is no way that they said something to hurt me right?\n\nThat was not the direction my thoughts were going. No mother, I was saying that because I’m sick of people assuming I’d be happier thin. I am happy. I am confident. I was saying that because I thought it was stupid. But now you saying that as if it was a fact made me take a step back and for one second there, I felt like the little lili at 12 years old when you make me step on a scale in front of strangers at a weekly meeting to see if I had been “good”, if I was to be worthy of a round of applause for not stuffing my chubby little face in “bad foods” this week.\n\nI had to hold my tears back while writing this, and felt so silly and defeated. Because I was there, to the magical place when you do not doubt yourself anymore, at the edge of 30, when you know who you are and don’t need strangers approbation. But for a moment a couple words brought me back to lili of my early twenties where I believed I would be prettier thin and that all my worries would vanish if I did. But you know what, it passes. I started to unfollow every dieter on my Instagram, turned to body positive inspiration like tess holliday and other. I’ve started to consume only what made me feel good.  And this day, I did not cry or flinch, because I know my worth, and I’m over letting people affect me. I meant what I said when I was talking to her, if she misunderstood that is her problem not mine. I hope young people have the courage to stand up to societal norms faster than I did.  \n\nthank you for reading this if you did, there's no finale or anything, just a little glipse of a day that i needed to get of my chest.", "subreddit": "BodyAcceptance"}
{"post_id": "e0sgji", "created_utc": 1574563057, "title": "Just having low body image and medical anxiety today", "author": "Pugshugpugs", "self_text": "I have gained a ton of weight over my birthday weekend and feeling stressed out knowing that the holidays are coming, so I am probably going to gain even more weight. (This is also due to my endocrine disorders, I have 2 conditions that cause massive weight gain no matter how strict my diet/exercise routines are. I am also pushing 30 so my metabolism is not as fast as a young person's would be.) I am so stressed out and worried that I might have to go to the doctor for some reason or another and I know they will ignore my complaint, tell me to lose weight and rush me out the door without helping me at all! It's all that's on my mind today. (Sorry if this triggers anyone, I am mostly just venting and wondering if anyone else is going through these thoughts today.)", "subreddit": "BodyAcceptance"}
{"post_id": "e15fe4", "created_utc": 1574632452, "title": "Hello Fashion!", "author": "Thesecretivefox97", "self_text": "Hello to all the lovely folks here!  I've been on both a recovery journey and a self acceptance journey, and recently I've been trying to push myself out of my comfort zone with clothing. I do like the idea of dresses and skirts but I seldom find any that fit me in a way that is comfortable or flattering, does anyone have any recommendations on where to look for them where I might have more luck?", "subreddit": "BodyAcceptance"}
{"post_id": "e1bjuc", "created_utc": 1574660613, "title": "My body image issues are preventing me from going to interviews and I don't know what to do.", "author": "tongale08", "self_text": "So to start off hi! I'm new to reddit and I would always go on to find answers to question and finally decided to make an account! \n\nSo this is me looking for answers to resolve my body image issues and spill my soul in a mature and safe environment. So let me start from the beginning. In high school I was a competitive swimmer, and ran for my high schools track and cross country team. I was in pretty good shape, in the sense that I never really thought about my body. I loved going shopping had an amazing wardrobe and loved to dress up and was really into fashion. My first semester in college I swam for my college's swim club for a while, but quit because I realized I didn't have to do it. For about 9 years I did 5 am practices and I think I mainly did it because it was a lifestyle. But when I quit in college I ate EVERYTHING. I only had 2 dining swipes a day and would usually  stay  in the dining hall for HOURS just studying and eating. I would sit for hours and eat eat eat study study study.\n\nAround sophmore year I started noticing the weight gain. I couldn't fit into old jeans or shirts and started dressing in basketball pants and sweaters more often. Eventually it was ALL I WORE. Friends would comment on how I would wear shorts in the winter and hoodies in the summer. By junior year I literally had none of my old clothes because they didn't fit. Everyone started commenting on how I looked \"healthier\" because of the weight gain. I believed them because I was pretty skinny to begin with. \n\nFor my part time job all I had to wear was basketball and a plain t-shirt, and one of my internships was through the computer and the other had a very informal atmoshpere where all I had to wear was, you guessed it, basketball shorts and a plain shirt. I didn't really have to wear proper dress clothes until college graduation. I remember going to the store to buy a formal outfit and everything looked really bad on me. I thought now big deal, just wear dress pants, a t-shirt and my robe over my shirt to cover up the fact that I didn't wear a dress shirt. So I did that. Graduation was great, but this experience was the first time I had a negative experience with my body and clothes. \n\nI decided to take a couple months to unwind before stepping to the real world and kept my college parttime job. After a while I decided to get into the game. I polished my cover letter and resume and applied to jobs. I got five interviews the first week I applied! I was ECSTATIC. I got ready to spend some big bucks on a big boy outfit. I got some cltohes I thought would look nice and to the dressing rooms I headed only to find out I looked fat. I looked in the mirror and was absolutely disgusted. I didn't go to any of the interviews because I looked fat. I weighted myself and found out I gained 60 pounds. \n\nRight now, I'm too scared to apply to jobs because I'm afraid of how I look. I am the first to go to college and the pressure to be successful along with my poor body image is making me depressed. How do I get past this? How do I make myself feel better? I feel worthless and empty.", "subreddit": "BodyImage"}
{"post_id": "e1muwr", "created_utc": 1574716518, "title": "Didn’t use to reoccupy myself with worrying about how much body fat I gain but somehow I do worry about it now? Does this happen to anyone else?", "author": "MeridasTwin", "self_text": "I went from loving eating more feeling good in my skin to worrying about having too much dessert because I don’t want to end up not liking the way I look after eating as much as I want. Therefore, I end up feeling a little guilty and don’t allow myself to have dessert for a few days. Does anyone else’s body image abs stuff sort of flip flop? If so, what the reasons that is also happens to you?  P.S. I meant to say *Preoccupy*", "subreddit": "BodyAcceptance"}
{"post_id": "e1z5vu", "created_utc": 1574780853, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "e23ivh", "created_utc": 1574798515, "title": "I’m in love with my body", "author": "[deleted]", "self_text": "I love how my waist curves, how its very small in relation to the rest of my body, how my hips are quite broad just as my shoulders. My legs are kinda big but it’s a great look and if they weren’t they wouldn’t be able to carry me. My arms are chubby but I’ve been working out and developing a little tiny visible triceps and biceps. My neck is really long and tight. I have lots of stretch marks on my tummy, legs and butt and I think they’re so cute and flattering and once again show what my body’s capable of. I like my small chest. It’s flattering on my frame, it’s good as it is. I like my hands and feet. They’ve been helping me all my life. My face has a great shape. My lips are so beautiful, my nose suits me, I like my cheeks very much. My eyes and brows are an awesome match. My hair is long and shiny. My body is healthy and does everything it can to keep me alive all day every day. I am so grateful. \n_Thank you, I love you_", "subreddit": "BodyAcceptance"}
{"post_id": "e2awkq", "created_utc": 1574830416, "title": "I love my”Apple shaped” body", "author": "Cado7", "self_text": "I have skinny legs, no booty, and a wider waist. My body type is considered unattractive according to what’s trendy, but I AM attractive. \n\nI’m not just saying this to make people feel better, I really am objectively attractive! My pancake booty has not scared off any men. It does make finding pants that fit a difficult task, but I still look great naked. \n\nApple shaped women never hear this. I had to realize this on my own. I just wanted to share in case anyone shaped like me needed to hear it.", "subreddit": "BodyAcceptance"}
{"post_id": "e2fxpv", "created_utc": 1574860969, "title": "Small package preventing intimacy", "author": "bobsmith2019", "self_text": "Hi I am so tired of being limited by my embarrassment and anxiety caused by my tiny package.  I rationally understand that my penis siZe is mostly irrelevant in life. But I let it define me.  I hate to be naked even alone and intimacy still causes so much anxiety even though I am married.  I hate my body. How can I learn to accept my body. \nThank you.", "subreddit": "BodyImage"}
{"post_id": "e2h9vp", "created_utc": 1574867312, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "e2j41y", "created_utc": 1574874761, "title": "YOU WILL PAY FOR WHAT YOU ATE", "author": "musicalastronaut", "self_text": "&amp;#x200B;\n\nhttps://preview.redd.it/enhmws6nh9141.jpg?width=506&amp;format=pjpg&amp;auto=webp&amp;s=989c0a9d08c7b51bf95ca57a0b1a072bb196c04e", "subreddit": "fatlogic"}
{"post_id": "e2rni1", "created_utc": 1574910017, "title": "Any tips on self love over the holidays?", "author": "eisforecfeandendo", "self_text": "My body has changed quit a bit over the past year and I've made a lot of progress with loving myself during day to day life but the pressure of being around family always gets to me and makes me second guess areas of my body rather than enjoying the day.", "subreddit": "BodyAcceptance"}
{"post_id": "e2trso", "created_utc": 1574921324, "title": "To my BBW’s out there and my other insecure pals", "author": "CurlyHairedPotatoBab", "self_text": "Do you feel confident in how you dress? I feel like no matter how I dress I look stupid because of my shape. I’m trying to start to love myself but it’s haaaard. I feel like I’m so hard on myself but I have no idea how to stop.", "subreddit": "BodyAcceptance"}
{"post_id": "e2z79d", "created_utc": 1574953690, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "e30ei5", "created_utc": 1574959115, "title": "Stay strong over Thanksgiving!", "author": "abbylikesoreos", "self_text": "No one over the holidays, family or not, has any business conversing with you on your body and how it might have changed over the past year. Similarly, no one today has any right to comment on how much/how little you're eating.\n\nYou are worth more than you know and don't let stupid comments drag you down.\n\nIt's happened to me and it may happen to you, but keep oriented towards your acceptance of yourself and throw unwanted comments in the trash.  You can do it.\n\nHappy Thanksgiving, family.", "subreddit": "BodyAcceptance"}
{"post_id": "e315li", "created_utc": 1574962247, "title": "Thanksgiving Selfie Post", "author": "maybesaydie", "self_text": "Food season begins with this holiday. Keep yourself on track by posting a nice progress pic. Please, no pictures of children. \n\n\nCat and dog tax enforced.", "subreddit": "fatlogic"}
{"post_id": "e33fgl", "created_utc": 1574971518, "title": "Today is the first time I've been called fat", "author": "flyingcorgibutts", "self_text": "I recovered from an eating disorder a few years ago but since then my weight has truly ballooned which is another problem. I hate my recovery body but at my highest weight. Today is the first time someone has called me fat, they didn't mean to be mean they said they are just \"blunt\" and that's fine. But it still hurt, fat is not a bad word but I must admit it hurt a little.", "subreddit": "BodyAcceptance"}
{"post_id": "e35hoq", "created_utc": 1574980540, "title": "Do butts matter that much?", "author": "crashband105", "self_text": "I'm a 19 year old female, 5ft 2, size 6 (UK size) and weigh about 53kg. My frame is pretty petite, but my main problem is my bum. I HATE it. Absolutely despise it. It's so flat it looks stupid on my body.\n\nCan someone here tell me if butts are a dealbreaker or not? Everything else about my body is not too shabby but my butt is absolutely abysmal, want to know if its as deep as I'm telling myself it is!", "subreddit": "BodyAcceptance"}
{"post_id": "e3fwny", "created_utc": 1575040258, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "e3xqlm", "created_utc": 1575126468, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "e3zmlf", "created_utc": 1575133649, "title": "My voice sounds HORRIBLE and it's making me so sad.", "author": "DutchSandwich", "self_text": "This sounds weird but my voice changes a lot. But it only changes into two different voices depending on the situation, my emotions, who im talking to. Idk. And both of my accents sound so embarassing! To me at least. I either sound like a 10yo (I JUST TURNED 19) or a crackly speaker. I hate it so much!!!!! Whenever i talk to people i always get the feeling that they mustve thought something like \"wow his voice is so childish for an adult\" or \"he sounds annoying\" it sucks when everyone has a normal voice and ur the oddball.", "subreddit": "BodyAcceptance"}
