{"post_id": "e4dh1y", "created_utc": 1575186553, "title": "Holidays are hard", "author": "throwaway9999---999", "self_text": "I allow my outward appearance to affect my ability to enjoy certain occasions/ outings especially when it comes to family over the holidays. I know it’s not true... and I shouldn’t feel this way... but whenever I am not looking my best (at my lowest weight) I feel like it lowers my worth. I guess it’s just so deeply engrained in me by my upbringing/ society/ whatever that a woman’s worth stems from how attractive she is. It’s stupid and I don’t believe that when I look at other women. But I do believe on some unconscious level we all do. Pessimistic as it may sound I do think there is some truth in that. Sure I don’t lose any actual worth when I gain a lb or breakout or whatever but I do think it affects how others value me. Example: my SO’s family comes to mind. This holiday season I felt like all eyes were on me. I hadn’t seen his family in a few months and in that time I put on a few lbs. A couple of people made joking comments about it (nothing intentionally harmful... more like: you can barely tell or it looks good on you) and even though they didn’t mean anything hurtful all I could hear was “we notice your getting fat and slacking off”. I feel like I am letting them down in some stupid way. I’m embarrassed and ashamed to show my face. I dread every holiday season bc of this. I care that people notice for whatever reason. People care. Especially old people. Idk what it is but there is nothing like a back handed comment from someone’s granny about how “you’re filling out your jeans better than you were last thanksgiving” \n\nI guess I don’t really have a question. Would just love to hear other people’s thoughts and experiences. Having struggled with disordered eating for most of my life, I struggle with weight issues everyday and can’t shake the feeling that, to a degree, I am what I look like.", "subreddit": "BodyAcceptance"}
{"post_id": "e4j109", "created_utc": 1575215346, "title": "can’t help but think everyone else is more attractive and I feel left out and jealous", "author": "74389654", "self_text": "my friend is in town visiting and let me know about every single one of my female friends that he thinks that they look hot and he has crushes on them and it makes me feel incredibly unattractive and left out. I’ve been struggling with my own body or with accepting it so I don’t want to blame any of them. but it’s a complicated situation to me because literally everyone I know is more conventionally attractive than me and I don’t even register as a woman to most people but rather as a thing that is in their way or whatever. I’m jealous and I’m a buzzkill because of that. I don’t feel like a full human. I know that you can call this a subjective point of view and that it’s probably not true and I still can have an amazing life and find some kind of beauty in me but this is not what my environment is telling me and for me it’s hard to ignore. I can’t just change society. I know my friends probably don’t mean to hurt my feelings in any way and no one owes me to find me attractive and it’s a thing I just have to deal with by myself but I don’t know how. I don‘t think I’m horribly ugly but from people’s reactions I don’t think I look good enough either although I have done everything possible to make that happen that won’t destroy some other part of my life. I don’t want to feel this way. what can I do to not feel so bad and additionally destroy my relationships by feeling that way?", "subreddit": "BodyAcceptance"}
{"post_id": "e4zwk7", "created_utc": 1575297394, "title": "Loving yourself", "author": "uriboo", "self_text": "Hi all, I just wanted to post something positive here, to maybe give some hope.\n\nI'm fat. Wonky face. Wonky skeleton. My eyes are a weird gangrene colour. My hair is a mousy, ashy brown. I struggle, to this day, to find something about my appearance that I like (maybe my pinky nails?).\n\nBut I have come to a point where it doesn't matter. Like... oh, what, people are going to judge my body for what it looks like? Okay? So, and, therefore? People could *choose* to judge my worth as a person on other things. They could judge me for my humour, my joy, my love for simple things like leaves falling from trees and Christmas lights. They could judge me for my willingness to listen to other people's problems, my ability to analyze and help people when they are too emotional to understand what's happening in their lives. Judge me on my fortitude, my warmth, my unwavering desire to create. You can even judge me for my poor qualities - my messiness, stubbornness, cruelty or recklessness. But... if you choose to judge me over the circumference of my THIGHS, that means I'm doing really well. If there's nothing else to judge me about, then I figure I'm doing alright.\n\nAs for my own dislike of my body, I have gotten to the point where aesthetics have ceased to matter too much. Fat legs, but do I walk? Long torso,  but does my spine still hold my body up? Chubby tummy, but are my organs protected? My body performs a function and it does so exceptionally well (except for my asthmatic lungs, but we can't be perfect and bless them they're trying). My body doesn't exist to look pretty and pleasing to the eye. It exists to keep me alive. So that I can enjoy those falling leaves and Christmas lights, so that I can help my friends, so that I can be warm and cruel and analytic. I have an intrinsic worth as a human being that is completely separate from what my body and face look like: they are just the support system to keep me alive. And for me, that has given me a *huge* amount of peace of mind. \n\nYes, my thunder thighs are huge, but thank you, thighs, for supporting the rest of my weight. Yes, my tummy is chubby, but thank you for keeping my organs safe &amp; being there in case I fall on hard times. Yes, my spine is hella crooked, but thank you spine for still holding me up as much as you can. Weird, misaligned eyes, but I can still see my mom's smile. Yes, my lungs function terribly (really, it's a problem... should probably revisit my physician about it...), but they are still working to keep me breathing. I am grateful for the body I have, because it means I can enjoy life.\n\nAnd I find that if you can start to lead your thought process down \"body means I can enjoy life\" rather than \"body means I don't enjoy life\", it can do wonders for you. It takes a long time and it will hurt, bad. I'm 25 now and couldn't have done this 10 years ago, or even 5. I spent so much of my youth believing I was missing out on life while I was fat/ugly, I didn't realize that I WAS living life. Like, I was just doing it, while thinking that it was impossible for me to do it. And now that I'm armoured with this knowledge, nobody can stop me from enjoying myself. Like... you can throw your trash at me and tell me I'm too fat to live as I walk down the street all you like, but I'm still going to laugh with my friends in the Silly Accessories section of the store on the corner, I'm still going to cry at the sad ending of the movie but watch it again the next week, I'm still going to eat a slice of cake on my birthday and I'm still going to live life. \n\nMaybe I'm just rambling at this point (another negative you can judge me for, lol), but I just wanted to put this kind of positivity out into the world. I've had such joy and peace of mind with this approach, I just hope it might give somebody else a similar freedom. Go. Live life. Dance down the street, sing terrible show tunes, laugh loudly.\n\nYou're already living life. Why not sit back and enjoy it?", "subreddit": "BodyAcceptance"}
{"post_id": "e5idxy", "created_utc": 1575385649, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "e5sn89", "created_utc": 1575428163, "title": "Hair", "author": "Queenxxxxx", "self_text": "Ladies, does the colour/cut/length of your hair make u feel more/less beautiful? I’ve been wanting to cut my long hair but everyone likes it long and I’m scared my bf may not be as attracted to me with short (shoulder length) hair :/ \nI know I shouldn’t care what others think and just do what I want but I’m not at that place yet with my body where I don’t care how about how others see me", "subreddit": "BodyAcceptance"}
{"post_id": "e5tpjw", "created_utc": 1575433289, "title": "Today i achieved a major milestone, and i have to share it with someone!", "author": "esmereldaskysurfer", "self_text": "I go to belly dance classes, usually i wear a t-shirt and leggings to cover my stomach (im a very big gal). Tonight i wore a choli, which is a cropped dance top, and leggings, with my belly on full display. And nobody cared! There were lots of bellies in the room, all different, and nobody commented on mine. I felt so liberated! I still cant believe i did it :D", "subreddit": "BodyAcceptance"}
{"post_id": "e5tvmt", "created_utc": 1575434174, "title": "Struggling with my face.", "author": "collegestudent3657", "self_text": "My view of myself is a roller coaster. It’s so hard for me to accept myself. Some days I think I’m attractive and I like what I see in the mirror, but on other days (like today), I feel upset about things about my face. For example, I don’t know how I feel about my side profile. When I was younger, around 12 or 13, I hated it. Something was weird about it. Now, I always take photos of my side profile to figure out if I think it’s attractive or not. \n\nAnyway, someone said something to me that just crushed me. I met someone for the first time and she asked, “oh did you go to [insert my high school’s name] prom?” And I was like “yeah! How did you know?” And she was like “I remember seeing you.” And I was like, “oh, how did you recognize me?” And she said, “You have a very memorable face.” \n\nThis may sound like I’m overthinking, but there have been studies that prove that unattractive faces are the most memorable. And, based on my own experience, all the faces I’ve seen that are memorable are faces with very distinct features. However, I don’t think my face is distinct or unique at all. I’m brunette, 1/4 latina, and people constantly say I look like the most normal looking brunette girls. People say I look like kendall Jenner, Selena Gomez, and basically any normal looking brunette girl or Hispanic girl. Random people on the streets have come up to me saying I look like their daughter (usually their daughters are brunette and normal looking). \n\nSorry if this sounds like I’m hyper focused on my appearance, I don’t mean to be. It’s just a constant struggle. I ask myself: am I ugly? Is my side profile so ugly that it makes my face memorable? I don’t know what to do. I go to therapy, but I feel as though it is not enough. I have mental breakdowns every couple of days because I feel so heart broken and completely devastated over my appearance. In the grand scheme of things, I know I’m not ugly. If anything, I’m average level. But, sometimes I feel like parts of my face are hideous. Sure, maybe the rest of my face is normal and it balances out the ugly parts, but the ugly parts to me are so ugly. I feel a deep, dark pain over this. And I need help and support. I came here hoping for some answers and guidance. All I want is to be normal looking. Please help me.", "subreddit": "BodyAcceptance"}
{"post_id": "e60ju6", "created_utc": 1575472102, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "e64za4", "created_utc": 1575490044, "title": "Is my head too small?", "author": "Far-Sun", "self_text": "This is a topic that no one really talks about seriously, yet the line \"hey big head\" gets tossed around quite often. Many people around me often exclaim when their head is too big but I think I am the opposite. I started to notice when in some pictures taken behind me, my head looked a little too small on my shoulders. Granted no one said anything and I do admit that I worked a lot on my shoulders to make it look broader but still.. it irks me. I've measured my head circumference, which comes out to be 57cm but 56cm when I wrap it tight. I'm not sure what the point of this post is.. I just wish I looked more proportional? I'm 5'10 and I weigh 145lb so a little on the skinny side but still..", "subreddit": "BodyAcceptance"}
{"post_id": "e6bt3p", "created_utc": 1575519484, "title": "Any books, advice, tips, anything really, on how to appreciate my body more?", "author": "ThrowGlitterNotShade", "self_text": "Im a 26 year old single mother and student. I recently moved on campus, along with my daughter, in September. I am working on my BA :) I’ve been having such a hard time making friends and talking to people for the simple fact that I am not comfortable in my own skin, I don’t feel attractive. The more I think about it, the more it doesn’t make sense to me. That’s just how I feel. My low self-esteem is playing tricks on me and making me feel like I an not worthy of friendships and making connections with others. I find it hard to attend evens and clubs for this reason. Part of the reason for this is because I truly dislike my body.\nI had my daughter when I was 20, I’ve felt so ugly since then. I’m thin but full of flabby skin and stretch marks. My breasts are so saggy, i hate them.\nI see all the younger, pretty girls at my school and compare myself to them. I cant help it. I try to love my body but I see more defects than anything. I just don’t feel attractive at all. It’s been really taking a toll on me, more than ever.", "subreddit": "BodyAcceptance"}
{"post_id": "e6if49", "created_utc": 1575558448, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "e6r077", "created_utc": 1575594164, "title": "Bf said he prefers boobs \"maybe slightly larger than [mine]\" am i being too sensitive?", "author": "mdane9", "self_text": "So it started as a joke where i gave him the larger piece of chicken because i said he \"prefers big boobs anyway.\" He said \"i dont know about big boobs, maybe slightly larger than yours.\"\n\nIve always known im not blessed in the boob department and i frequently make jokes about them. My bf has also made it very known that i'm the smallest woman on general he's ever dated. \n\nIve joked around about my small boobs before, even with him, but this one hurt. Like I guess it was different for me to just know he likes big boobs versus him saying he would prefer mine were larger. Am i reading too far into this and being too sensitive? \n\nI feel like i need a little validation that he does like mine even though they may not be his preference. He's not a very word-oriented person, so compliments are few and far between which i think makes it more difficult for me sometimes.", "subreddit": "BodyAcceptance"}
{"post_id": "e6zye1", "created_utc": 1575645048, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "e7n7yr", "created_utc": 1575768847, "title": "I struggle going home because my (22f) sister’s (16f) body makes me feel insecure", "author": "32Boobs", "self_text": "I have always struggled with my body image, and my major issue with the way I look is my breast size. I have small boobs, and in an attempt to make them bigger I’ve swapped birth control several times, swapped to soy milk, taken supplements, bought dodgy “breast enhancement” creams online... basically everything short of a boob job, which I’m considering getting if/when I have the funds. None of this has helped.\n\nIt’s always been clear that my little sister was going to be the “pretty one”, and that didn’t bother me until recently. At 14 she started wearing my old bras, and recently she’s quite obviously overtaken me in the boobs department. Around the house she wears what is essentially underwear - bralets and shorts/sweatpants - and it’s hard not to notice that she has a hell of a lot more cleavage than I do. This is upsetting because my body image swings so much from being happy with how I look to really hating myself, and my much younger sister having bigger boobs than me has turned out to be a massive issue for me.\n\nObviously, my sister can wear what she likes in her own home, and as an adult I should just try to get over it. A side point is that she has shown some signs of having body image issues herself (although I’m not sure if this is just me projecting). But that’s something I’ve told my mum to look out for as I’m rarely home from uni.\n\nI have other aspects of my body that I really like- the major one being that I’m quite muscular. So I guess my questions would be: how do I work on loving myself beyond just ignoring the parts I don’t like, which is what I’ve been doing for the last 6-7 years? And how do I help my sister not develop insecurities like I have when I rarely see her?\n\n(Also, a bonus question- can anyone recommend ways I can try to increase my boob size that aren’t expensive surgery?)\n\nThank you xx", "subreddit": "BodyImage"}
{"post_id": "e7wzmh", "created_utc": 1575828215, "title": "(17M) I hate my whole body", "author": "NoSelfEsteemLol", "self_text": "I don't really know where to start with this but I hate my body even my family joke about it I'm 17 (about to turn 18 in feb) and a male but whenever anyone meets me or sees me they don't believe my age I'm short (5'5 165cm) I struggle to put on weight and I can't grow facial hair I also have a big babyface and a high pitch voice so I pretty much look and sound prepubescent and don't get taken seriously as an adult male if that's in college or just in general (my sister makes fun of my height and my friends make fun of my looks as I can't get served without an ID even if I'm buying a fucking energy drink mind my language) And then I can't even get away from it all online as my voice is high pitch so people normally tell me I sound like a 14 year old girl or that I sound like an extremely young child I literally have no self esteem from people telling me I look and sound like a 14 year old. Even every girl I've dated has said I have a huge baby face and don't look my age even a 13 year old recently told me I look 15 or under no higher and that's what pushed me to make this post.\n\nAnyways what I'm trying to say is I don't feel like a proper man or like I'm taken seriously due to these features I have no power over.\n\nTLDR : I look and sound prepubescent and people don't take me seriously\n\n&amp;#x200B;\n\nif you have any way for me to stop thinking negative of myself or any way I can improve myself it would be greatly appreciated.", "subreddit": "BodyAcceptance"}
{"post_id": "e83od5", "created_utc": 1575859110, "title": "Looking for spa experience", "author": "xilsa", "self_text": "Hi- can anyone tell me how to find a masseuse or spa that is a positive experience for someone with a not “typically beautiful “ body. \nCan’t old fat disabled sick or ugly people enjoy a healing spa day?\nHow do you find out ahead of time? Most of these places seem to only be for beautiful people. \n\nI don’t want to pay for and inflict  an experience that reinforces all of the negative stereotypes. \nThis has happened. ☹️\nThank you!", "subreddit": "BodyImage"}
{"post_id": "e86qi2", "created_utc": 1575876272, "title": "Reminder: Loving yourself doesn't happen overnight, it takes time and effort.", "author": "Clutsy_Naive", "self_text": "You've been brainwashed into thinking you are ugly and not worthy by society. You won't accept yourself overnight. It takes time and effort and sometimes extra help to unpick the brainwashing. You're not a failure if you don't like yourself yet. You're not a failure if you have a bad day. Be kind and patient with yourself. ❤", "subreddit": "BodyAcceptance"}
{"post_id": "e86ws6", "created_utc": 1575877523, "title": "How to handle fat shaming comments?", "author": "Pantokki26", "self_text": "So...my cousin’s wedding is coming up in a few weeks. I’m going to my cousin’s wedding in Pakistan and I’m absolutely terrified by the comments and body shaming I’m going to have to face...\n\nMy weight has always been a topic of conversation with my family and relatives. It just hurts. My weight has fluctuated a lot over the past few years. Fighting depression has caused me to gain and lose weight but I never make any real progress.\n\nI went to another cousin’s wedding in September, and my aunt just looked at me and was like “You need to lose weight. Seriously, you need to lose weight.” And she said that over and over again, repeatedly, in front of my mother, my other aunts, and my cousins. It was hurtful and embarrassing. I was the only one trying to stick up for myself but it’s hard to when you’re alone in doing so and on the verge of crying. My cousins who don’t believe in body shaming didn’t say anything. My mom agreed with her and said it’s because I drink too much bubble tea LOL. But I only drink bubble tea maybe once or twice a month? Yet somehow she thinks I‘m this raging boba addict fattening myself up every time I come home with a cup in hand.\n\nAnyway I told my aunt that I try to work out and eat less but all she said was “Lose weight. Stop eating”. I just don’t understand...I’m not hurting anybody. I’m just minding my own business. Does my appearance and body really offend people?\n\nHer words didn’t motivate me. I spiraled into another depressive episode, ended up eating more, and gained weight. Another aunt saw pictures of me from September and said “you need to lose weight. You better not be like that for the wedding this December or you won’t look good in our pictures.”\n\nI’ve been trying hard to work out and fix my eating habits but it’s a hard struggle. There’s this pressure looming over my head and time is almost up. I’ve only lost 7 lbs since September. I basically gained weight and lost it since then, so really I’m about the same size as when they last saw me.\n\nI just know I’m going to get these comments again and I’m dreading it. I’m terrified. I want to pull my hair out and scream. I want to cry. I’m so upset I wasn’t able to lose more than 7 lbs but I’m trying. I’m trying my best. I’m scared to be in that situation again...in a room full of people being told “wow, seriously you need to lose weight. Oh my god” while everyone is staring at me silently judging. I’m scared because I know I’m the only one who is going to stick up for myself, if I even have the strength to do that.\n\nI don’t know what to do...Asian aunties are brutal. Does anyone have similar experiences?", "subreddit": "BodyAcceptance"}
{"post_id": "e8arjv", "created_utc": 1575902403, "title": "Skinny shaming in my house", "author": "chopper45", "self_text": "I'm so tired of my sis skinny shaming me and bragging to me every chance she gets about how she gets hit on at work. It always ends with the conclusion that girls with phat asses are more attractive and I'm left feeling like I'm not good enough because I don't fit the so called 'thicc' trend right now. I'm more slim with big boobs and I have plenty of insecurities already, but to hear thoughts like, \"why is she even getting guys, shes skinny, its always the skinny girls who are flat,\" or \"her butt is so tiny, this model's butt is flat thats not attractive\" everyday is just making me insane. It's like thanks for projecting all your insecurities on to me so you can feel better. \n\nThen, it goes back to \"oh I ate too many carbs today!\" which makes me feel like I shouldn't be eating to gain weight either. SO which is it? I'm battling between wanting to be curvy and wanting to be model thin. WTF is attractive anymore? I don't know I'm so tired of trying to keep up and feel self-conscious every minute of my life and feeling like I'm just not enough. I'm arguably not even that gorgeous so what the fuck does it matter anyway. \n\nSomeone telling you 'I'm fat but I'm pretty' is like picking on my problems and then turning it around to make themselves feel better and pair this with a nitpicking mother who always made you feel down about yourself. I don't think I'll be happy with myself until I can be away from people who are constantly hating on themselves and living in vanity.", "subreddit": "BodyAcceptance"}
{"post_id": "e8bbpk", "created_utc": 1575905098, "title": "Weight gain and confidence to wear pretty clothes", "author": "[deleted]", "self_text": "I'm recovering from an eating disorder. I'm currently mostly ok with gaining weight, but I'm insecure about how my clothes will look on me in the future. I wear alternative/goth-like clothes. I feel like I'll look mannish and ridiculous in those clothes if I'm not doll-like and tiny. I have wide shoulders, a square jaw (basically the same face as my dad's), and a straight/curveless body type, and I don't really feel feminine. I love wearing black dresses with lace and ruffles, but I feel like my body isn't meant for anything feminine, elegant, or cute. I also can't compensate with make-up because it feels so uncomfortable on my face (some kind of sensory issues, not allergy). How do you get the confidence to wear what you want? Do you follow any average-sized fashion bloggers?\n\nI'm also scared of sizing out of some size S clothes I bought during my eating disorder. I would probably blame myself for wasting money on them and wouldn't allow myself to buy replacements. I've thought about altering them to make them bigger, but I'm not sure if it's doable.", "subreddit": "BodyAcceptance"}
{"post_id": "e8n2cb", "created_utc": 1575960006, "title": "Stylish Not-So-Pretty Women", "author": "HaloBop", "self_text": "Does anyone have examples of women who aren't facially attractive at all, but are well-dressed or stylish and make it work? \n\nI just can't deal with comparing myself to others when my face is distractingly... strange compared to other peoples.", "subreddit": "BodyAcceptance"}
{"post_id": "e8rr10", "created_utc": 1575990456, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "e8wlu8", "created_utc": 1576011498, "title": "I've been bullied for being flat", "author": "cristinave", "self_text": "First of all, sorry if I make any mistake, but English isn't my first language. \nSo, it all started when me and my \"friends\" started puberty \nTheir boobs and butt grew up, my boobs started growing too, but my butt was still flat af. \nSo of course, everyone made jokes about it\nNow, my butt is still flat, and I live at a  dorm. \nOne of my roomates keeps making jokes about my flat butt almost every day.\nI have a boyfriend and he always says it doesn't matter how my body looks but I'm still insecure\nMy classmates make jokes about it too \nI'm not feeling enough at all\nMy face isn't that beautiful, to be honest I'm pretty ugly \nI've been considering plastic surgery, but I'm too scared to\nI did exercices and it didn't work\nI look at my body every morning and I'm ashamed of it, I wish I was curvy and beautiful, but I have a weird-shaped body and an ugly face. \nI look at the girls around me and they're beautiful, and have perfect bodies\nWhile I look like a complete trash", "subreddit": "BodyAcceptance"}
{"post_id": "e988zr", "created_utc": 1576076891, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "e9gvdq", "created_utc": 1576115140, "title": "I'm starting to hate boobs and my body", "author": "korra102", "self_text": "So I'm a women and I kinda hate boobs. I'm not trans, I've actually liked feminine things all my life and only ever had thoughts of wanting to a boy to escape how women are seen and the roles we are expected to play in this messed up world.  I definitely don't want to have a dick, I think they are one of the ugliest and most disgusting things to ever exist in this world and I feel this way despite being straight and 20 now.(maybe im ace sexual).  I've hated having boobs ever since puberty, to the point that I prayed to have small boobs.\n\n Unfortunately for me I hit puberty at 10 and it was a nightmare. Not only was I having painful period cramps but every time I looked in the mirror and saw my chest getting bigger I felt disgusting. I would try very hard not to look down at my body in the shower. Now that I'm older it's gotten better but my disgust with breasts is still there. They are so pointless to me, especially because humans are the only mammals where the females have breasts even before pregnancy. I read an article that discussed why females have breasts and the conclusion they came to is that it was just to attract males which just made it that much more disgusting to me. I also hate that i'm short and small framed so everyone underestimates me and If they see me standing up for myself  i'm described as \"feisty\" or \"sassy\"(i really hate those words now). It's like I can never be seen as powerful or strong or dominant and If i try it's just \"look at the tiny girl being feisty\". It seems like this world and everything in it was created by a cruel  God that only made it for men and as women we are forced to be in roles we can't escape. I know people will likely say that I shouldn't hate my body just because of society's mindset but when is that going to change? The world has always been like this for women and feminism only gave us rights it didn't give us  much respect or change the way men see us. I think it's  only natural for me to hate my body given the world we live in.\n\n I guess I just wanted to rant about this and maybe look for some advice. There's not really anyone in my life I can talk to about this who will understand.", "subreddit": "BodyAcceptance"}
{"post_id": "e9oqdi", "created_utc": 1576163270, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "ea4bv6", "created_utc": 1576245608, "title": "How do I begin accepting how my body looks as it is now? I’ve hated myself for years, and I honestly just want to give myself a break.", "author": "RedheadVenus", "self_text": "I’m 22 years old, and for as long as I can remember I’ve had a very low opinion of how I look. I can even remember being 5/6 years old and feeling somehow different in a bad way. Almost slightly deformed looking. I’m honestly absolutely sick of hating myself now. I have always been focused on my appearance. Please please please could somebody give me some tips on how to become a bit more neutral about my appearance? Body positivity seems a little unrealistic for me at the moment, and body neutrality seems more attainable. My biggest problem is comparing myself to other women and feeling inferior. I simply do not know how to stop myself! I know that there is not going to be an overnight cure for literally years of hatred towards myself, but I would really like to start now. My life is ticking away and I’m stopping myself from wearing the clothes I want to wear, doing the things I want to do, and behaving like the “real me” because I feel as though I do not look as I should. Plastic surgery seems like a quick fix, I don’t know if it would help me or not, what I do know is learning to overcome these feelings and stay as I am physically would be a lot cheaper for sure!\nThank you so much", "subreddit": "BodyAcceptance"}
{"post_id": "ea55vg", "created_utc": 1576249873, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ea6x7s", "created_utc": 1576257880, "title": "Sometimes I am worried whether I am too short to be concidered attractive", "author": "catacomb_gurl", "self_text": "I need to stop watching kpop videos... I am what I would describe as an ''aesthetical  nihilist'', which  means that I do not believe in an actual concept of beauty or in it's value (at least on humans) but I still feel like I want to be  attractive because it was a big part of my identity for too long. I do not know if I have too shor tlegs or if long  les the way mainstream beauty standards want them even exist in the first place. Maybe my legs are fine or maybe I will grow taller. I do not believe in beauty but I still feel like I want it. But hey? Who needs to have beauty when they can create it? Sometimes people tell me that i look like a latin american even tho i am from greece and in some cases people stare at me/smile at  me and tell me that I am beautiful and lots of people have told me that my body is attractive but yeah the human brain is shit. Dysmorphia sucks folks. Maybe short girls are cute too.", "subreddit": "BodyAcceptance"}
{"post_id": "eakrfk", "created_utc": 1576336024, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "eavi0d", "created_utc": 1576390690, "title": "I'm struggling with my body image due to comparing myself to my identical twin.", "author": "SpareFrame", "self_text": "This comparison is really only coming from my mind directly, no one in my family has pointed out our physical difference (yet that is, more on that in the second paragraph). I am 5'3 and 110lbs. Been struggling with a some health issues related to an autoimmune diagnosis and endometriosis diagnosis recently. This has led to me being at my lowest weight in years (some weeks I am at 100-105lbs). I feel very weak due to a signficant loss in muscle mass over the last 2 years (I was an athlete pre-diagnosis). Anyways, I've been on my own journey recently in terms of coming to terms with what my body is able to do and how different I look in the mirror now than I did two years ago. Two years ago I was 125lbs and about 16% body fat. I don't know what my body fat % is now but I know most of the muscle I had is gone.\n\nNow that it is the holidays I will be around my identical twin more. We are the same height but at very different weights. I am much smaller than her weight wise and I am so afraid that our family members are going to say something. Many of them don't know the extent of my health issues and seeing us stand side by side I think might trigger them to make rude comments towards both of us. I love my sister and I don't want my family members to make any distasteful comments towards her or me. A lot of people in my family don't have a filter. This is something I've kept to myself and I'm not sure if I should bring it up to my sister before we have to see family. My plan is to shut down the comments if there any but tbh I'm worried if I'll have enough energy to do that.\n\nOverall I think I have been subconciously comparing myself to my twin in that I'm afraid that my sickness is becoming more \"visible\" instead of \"invisible\" and that people are going to say something. This has been leading to more anxiety about how I view my body.", "subreddit": "BodyAcceptance"}
{"post_id": "eba7je", "created_utc": 1576470791, "title": "Today my coworkers kept commenting on my weight", "author": "HeatherFaerber", "self_text": "Back story, my senior year of high-school I had to have my gallbladder and appendix removed. For about a year, every time I ate my gallbladder would have a seizure, causing immense pain and/or puking, they removed the appendix just because they were already removing one organ. Due to that, I was down to 110 ish lbs, and being 5’11” I looked rough. My hair was falling out, skin and bones, etc. I absolutely hated the way I looked, I wanted to be at a healthy weight again. It took me years, until I was 21, to get back to a healthy weight, and I felt a lot better, and also conflicted. To spend so much time underweight and then to gain that weight (birth control and some of my meds, so it was quick when it started) was a but of a shock, to say the least. \n\nNow, the day before Thanksgiving, I had to have my tonsils removed. I was off work for almost three weeks, and it was miserable. I was in constant pain, swallowing was hell, and a liquid only, required, diet. I’ve lost weight again, about 10 lbs. I’ve been back to work for a few days, and today my coworkers kept commenting on my weight, and when I’d try to say that I was trying to gain it back, because I hate having a thigh gap, they got upset. To them, I can’t be upset with my weight because I’m skinny, regardless of the health behind it, but they can complain about theirs. Then their comments were more “You look so much better now”. I was about 160lbs before this surgery. I was at a healthy weight and finally happy about it. \n\nI’ve had body image issues before, with my weight among other things. I also have crippling depression and anxiety, and honestly this has sent me into a depressive episode. I’m already really impatient about gaining my weight back, but I’m still on dietary restrictions, as my throat isn’t completely healed yet and I still get pain from eating. \n\nI spent weeks in a painful, only eating (barely) to survive, and now I’m back at work in a burger restaurant where my coworkers are commenting and opinionated on my body, and I can’t eat 99% of the food there, despite the fact I get a free meal every shift.", "subreddit": "BodyImage"}
{"post_id": "ebanv6", "created_utc": 1576473293, "title": "I really HATE my body", "author": "Justendmealready_23", "self_text": "(15F turning 16 in Jan) I know this is pretty cliché for a teen to hate their body but here I am. I just hate everything about my self. From head to toe. I weigh about 195 and I’m 5’6 ish. So I’m more on the fat side. I get told all the time how I’m “Thicc” and that I shouldn’t put myself down, but I can’t help to think that I look like a goblin. Also not only do I hate my body, I hate my face. I have chubby cheeks, a round face, and lots of freckles (I also wear the classic nerdy geek glasses). The only thing I “like” about my self are my eyes. I don’t know what to do. Im self conscious about everything on me. My chest size, Butt size, Hip, waist, arm, legs, etc. You name it, I hate it. My family has called me fat for years. So I have REALLY low self esteem. So it’s hard to wake up every morning and look at myself in the mirror without wanting to cry. I just need help.Im sorry if this was a messy paragraph. (I‘ll be fine to answer any questions you have if you need a better idea of what I look like)", "subreddit": "BodyAcceptance"}
{"post_id": "ebcl3d", "created_utc": 1576485678, "title": "Stereotypes in fashion stores", "author": "Kleinig_keit", "self_text": "Went shopping with my boyfriend yesterday and wanted to try on a dress. It's typical for a new years eve, so it's glittery and suuper tight. I usually don't wear that. I don't even liked the dress but I thought it would be fun to wear it once. So I took it to the fitting rooms put it on and I was shocked. I don't have any problems with my body, I started accepting my body but this dress wasn't made to wear. I looked like I have a thicker belly than everyone else and it wasn't comfortable at all with the glitter and the fabric. This dress is definitely just made for stereotypical models who eat way too less. The dress gave me real body issues once I had it on. So please guys and girls out there:\n\nBe proud of your body and wear whatever you want to wear and feel comfortable in. Everyone's beautiful by his/her own. Love yourself!", "subreddit": "BodyAcceptance"}
{"post_id": "ebk1f7", "created_utc": 1576525440, "title": "Treatment Research Study for BDD", "author": "zflmgh", "self_text": "Hi everyone!\n\nI work at [Massachusetts General Hospital](https://www.massgeneral.org/) (Boston) in our body dysmorphic disorder clinic. We deliver cognitive behavioral therapy for people with BDD and treat many people each year. Over the years, we have seen a need for flexible and accessible therapy that people can use from the convenience of their own home.\n\nWe have therefore created a smartphone-based treatment, *Perspectives*, that delivers digital cognitive behavioral therapy for BDD. Over the course of a 12-week program, the app helps users gain skills to target BDD symptoms through CBT exercises on their phone. Users are also paired with a coach who offers support throughout the program and answers any questions or concerns they may have.\n\nWe are conducting an ongoing research study to test how well *Perspectives* works in terms of improving BDD symptoms and related mental health symptoms.\n\nAfter an initial pilot trial, we are now opening the study up to more people to further test the app’s potential benefits. We hope that developing and testing this CBT for BDD app will give many more people access to treatment.\n\nWe are looking for people with BDD in the United States who might benefit from this smartphone-based therapy, to use the app in our clinical trial, at no cost to them.\n\nIf you are interested in learning more, you can find the details on our website: [https://perspectives.health/](https://perspectives.health/)\n\nAlternatively, you can always email me directly at [bdd@partners.org](mailto:bdd@partners.org).\n\nI hope it can be of some help!!", "subreddit": "BodyAcceptance"}
{"post_id": "ebmidv", "created_utc": 1576536157, "title": "hot dog down a hallway", "author": "[deleted]", "self_text": "i was violently raped several years ago and ever since my vaginal canal has felt way too loose. i feel like with other body imperfections, you can still feel confident that if someone can get past that then you have a lot to offer them, but with this even if you have physically redeeming qualities it is all kind of a lie. what is the point of someone finding you attractive if there is nothing in it for them afterwards ?", "subreddit": "BodyAcceptance"}
{"post_id": "ebt5yv", "created_utc": 1576571275, "title": "I have a booty problem", "author": "Depressed_peeps", "self_text": "I know this is going to sound so stupid but this really has been a big problem for me and it would really help if other people knew what I was going through\n\nI was gifted with a proportional body. I have b cup boobs, curved waist but my only issue is my butt and hips. I was given the Square butt shape ( when you turn around your butt kinda looks like a H ). I used to not even pay attention to my body and was really unhealthy with her. I didn't bathe, brush my teeth, wash my face, or do excercise. The only reason I'm been able to maintain a good shape over the years is due to fast metabolism.\n\nI used to weigh in about 120-124. That's my ideal weight. I used to think I was fat but looking back on it I would rather be that weight than my current. Summer 2019 came and I became a whole new person. I became more booty centered. I wanted my curves to show more than anything. It was good in June - July but then I started to rapidly lose weight when I didn't want too. I went from 120 to 116 to 112. I was getting more and more depressed every time I went to the doctor. \n\nI started working out doing butt exercises in September and I was happy with how my body was looking but then with working out your butt to be round, you get the not so good \" tight \" butt. The guy that I was having sexual relations couldn't grab or smack my butt like he used to when I used to weigh 120-124. \n\nNow I get depressed in the mirror when I look at my butt and it doesn't show in my pants or dress. I can't help but stare at other people's butt and compare them to mine. I can't go anywhere without looking and getting sad when someone has a better butt. I try not to sit down that much in fear that my butt could flat, and I try to eat more tho I never keep the weight and I do lunges every other day to maintain shape. \n\nI just wish I didn't care like I used to me and maybe everything could go back to normal and I wouldn't be so butt crazed.", "subreddit": "BodyAcceptance"}
{"post_id": "ebui5r", "created_utc": 1576580932, "title": "Parents who are overly strict with their kids' diets?", "author": "Pugshugpugs", "self_text": "Am I the only one who hates seeing kids put on super strict parental diets even when they are healthy and active already?! Like I used to be a nanny for this one 7 year old whose idiot mom wouldn't let him eat anything except like produce basically. If he was hungry after dinner he had to tough it out because of the \"no snacking\" rule. That drove me crazy. I can get behind the no sugar thing but the whole \"limiting healthy food\" thing for a kid who was already rail thin and malnourished was messed up!\n\nIt also drives me up the wall when parents in larger size bodies who aren't starving or dieting themselves, force their kids to be on constant dietary restriction. Tiny quarter-cup portions of everything and the kids are always hungry when the parents are eating freely. It's like why do you force your kids to eat this way if you don't want to eat this way yourself? Don't you have empathy for your kids?!?! \n\nI think that parental dietary restrictions plant seeds for body distortion issues and eating disorders later in life. It also makes kids obsessed with food and so whenever they are around forbidden foods they will gorge themselves. It's sad! My mom was always food shaming me and putting me on diets as a kid and it screwed me up mentally for life! In more ways than I can count. Sorry if this rant seems stupid to anyone lol. Sometimes I just seethe about things.", "subreddit": "BodyAcceptance"}
{"post_id": "ebwy09", "created_utc": 1576595265, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ebzexp", "created_utc": 1576606182, "title": "The Holidays are here and so is the body shaming! any advice?", "author": "Nuzman11", "self_text": "I've always been the big person in my family. I was once 320LBS and and currently 257LBS, but for some reason a select group of family members always comment on my weight and how I look even after some weight loss. Does anyone have some tips to deal with these people? I'm getting sick of fake laughing it off or just shrugging it off. I'm going to try very hard not to lash back at them...Thanks!", "subreddit": "BodyAcceptance"}
{"post_id": "ec10ix", "created_utc": 1576612750, "title": "I’m 22 years old and hate my body", "author": "[deleted]", "self_text": "Hello everyone. This is my first post here! \n\nI’m 22 years old, male. I’m 5’10 and weigh around 200. I have depression and anxiety as well. \n\nI’m athletic, can run a mile in under 6 minutes, do 100 pushups a day, and most times never eat. \n\nMy body is what the internet would call “pear” shaped. I have bigger thighs, love handles, but toned arms, chest, calves. \n\nEveryday i look at myself with pure disgust. I hate how my shirts fit. I hate that no matter what diet I’m on, how often I work out, I’m still stuck in my worthless overweight body. \n\nI hate my body. \n\nThe internet tells me my BMI considers me “obese” and I can’t stop thinking about this. I hate the way I look no matter what. My body is disgusting, and a lot of the time I don’t treat it well enough to “quicken” change. \n\nNo matter what I do, I hate my pear shaped body.\n\nAny advice? I’m tired of feeling like this..", "subreddit": "BodyAcceptance"}
{"post_id": "ec2nc5", "created_utc": 1576619526, "title": "I used to be incecure about being fat but know I'm worried that I'm too 'thin'", "author": "invisible_nbdy", "self_text": "About a year ago I used to be a bit heavier than I am now(about 25lbs/12kg). After I lost the weight I was still incecure that I was fat. I still kinda am but not as much. Now I tend to be more worried about not having as much weight on me.\nI think that's because since I'm in high school everyone is developing. Especially girls. Most of them gain weight but in all the right places and have a more womanly body.. with bigger b00bs.. and butt.. ° and here I am, losing  losing weight/staying the same.. Ughh", "subreddit": "BodyImage"}
{"post_id": "ec5on0", "created_utc": 1576633247, "title": "Body Image and Media Use Survey for Grad School", "author": "krizzo1120", "self_text": "Hi everyone! I’m doing research on body image and media use for school. This topic is definitely one very important to me personally (as it is for many others)! If you have the time, please consider taking my survey, I’d really appreciate it!\n\n[Body Image and Media Use Survey](https://pace.az1.qualtrics.com/jfe/form/SV_6ohc4YOflTCFUAR)", "subreddit": "BodyImage"}
{"post_id": "ecc9oh", "created_utc": 1576673764, "title": "Feel like everyone around me looks better", "author": "LuHut", "self_text": "Now I know that I shouldn't compare myself to others, but I feel like even the most classically unattractive people around me are prettier than me. \n\nI don't want to be mean by saying these people are unattractive, I personally think that everyone is pretty in their own way. Except me. \n\nI'm not even insecure about my weight, I just hate my body. I hate it's shape, the fact that I have weird boobs, my height... \n\nWhen anyone compliments me, I just think they're doing it out of pity. I work out, but it doesn't help at all.", "subreddit": "BodyAcceptance"}
{"post_id": "ecdt0m", "created_utc": 1576681702, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "ecuf3w", "created_utc": 1576768069, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "ed6fkt", "created_utc": 1576824114, "title": "Blow to self esteem", "author": "Queenxxxxx", "self_text": "Today my dad called me fat and I quote “so ugly u don’t even look human from the side”. He said it over and over again too. I was just sitting on the couch minding my own business when this happened. I feel so upset, whatever self esteem I had is gone. I’ve been crying for the past couple hours and feel horrible", "subreddit": "BodyAcceptance"}
{"post_id": "edbem6", "created_utc": 1576854684, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "eddme5", "created_utc": 1576864977, "title": "Body image and pregnancy", "author": "althly89", "self_text": "I am thinking more and more about getting pregnant, wanting to start a family, but I have these hurdles and I don’t know what to do. I was hoping someone can help me with me some of the below issues. I am going to be very honest with my worries, and I’m sure a lot of it will sound stupid and vain, but I need to consider these things because I want don’t want to have resentment towards others for a mistake I made or didn’t take seriously enough beforehand.\n\nI have body image issues that are tied to my self worth. I’m always told in various ways I’m nice to look at and due to imposter syndrome struggles I feel this has given me a good portion of my value to society (whether or not it’s true is irrelevant if anyone has gone through imposter syndrome). I have an accomplished and successful career that I love and consider myself a smart person who brings a lot of good to the world (I work in nonprofit), but when people talk about me, that’s not what they mention, or not the first thing at least. It has made me feel that a lot of my value and success is tied to how I look. I worry how my body will change and how it will look after pregnancy. I’m worried I will hate myself and how I look. I don’t want to have resentment because of it. Has anyone dealt with these body issues and how did you over come them? This is not just related to pregnancy, I have an intense fear of getting older and no longer being a value to society because of this as well. Btw, this is something that I’ve been working on with counseling and medication, it’s not something I know I struggle with but refuse to work on.\n\nAlso, I am very sexually active with my SO. I’m worried about not being able to have sex as much when pregnant, and I worry about losing intimacy with my SO when a child is part of the equation in the household, that the spontaneity will be gone, or I just won’t have the energy to do it, or because I won’t feel attractive anymore. My sex drive is higher than his, so I think this is mainly a concern for me.\n\nAgain I know this probably sounds vain and silly, but I would rather confront and acknowledge these issues now before it’s something I can’t go back from.\n\nThank you 😥", "subreddit": "BodyImage"}
{"post_id": "edpou9", "created_utc": 1576933420, "title": "(18M) People say I’m skinny, but I just can’t see it", "author": "telbu1", "self_text": "Yeah I may be thin. I’m 183/6’0 tall, about 62 kg. I know I’m almost underweight, but I have a hard time seeing myself as thin. Especially my legs. Gosh, I hate my legs the most. They look like balloons (thighs, calves) in the mirror I think... yet, in photos and videos they look skinny? I don’t know what to believe anymore. I prefer being skinny because my prefered body type is tall and lanky, but I almost want to lose more weight because I hate the way I look. Any tips for what I could do? Get a new mirror? This is more of a quick rant btw because I’m about to head outside and I have a hard time going outside rn.", "subreddit": "BodyAcceptance"}
{"post_id": "edqwls", "created_utc": 1576940812, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "eedexi", "created_utc": 1577064105, "title": "Sometimes friends don't know how hurtful they are.", "author": "holga_pataki", "self_text": "I'm a 31 year old lady who has been doing battle with my body image for a long time. When I was a teenager, I was an elite athlete, and then I stopped competing and learned how to exercise for the joy of it. Nowadays I do it all - running, weight lifting, yoga, Pilates, pole dancing, HIIT, whatever feels good on any given day. Over the past year, my bra size and pants size changed, and it really threw my body image for a loop, as a lot of my clothes no longer fit. I've been working on my attitudes around this, and I'm in an OK head space about it.\n\nLast week I had two friends over to help me Kon-Mari my clothes. A lot of stuff had to go. We were discussing the perils of having big boobs and wearing button down shirts, and one of my friends made some weirdly dismissive comments. She was like \"Why don't you keep complaining about your perfect porn star boobs and firm athletic butt, wow, what a horrible thing to have to deal with! Your boyfriend must HATE it!\" \n\nI know she meant it as a joke, but it really bummed me out and got into my head. I'm 5 foot 2 and a 32F bra size, so I'm already self-conscious about my bust. But also, I think I just naturally gain muscle easily when I work out. And I don't work out to \"make that booty pop,\" as it were; compound lifts like squats make my body strong and make me feel accomplished and proud. \n\nI don't think my friend realizes that I've had a rough go of it with my attitude about my body. When I was at my fittest competing in triathlons, my body wasn't good enough unless it was winning races. It was literally just a victory vehicle and if I wasn't winning and getting PRs all the time, I HATED myself. Also all the girls who were *really* good were tall and thin gazelle types, not petite and muscular. It took me a really long time to develop a healthy relationship with fitness and body image after quitting that sport.\n\nI also realize that my friend may be feeling some weirdness about herself because she's been going through a lot of changes with her body. She had a baby earlier this year. But it also really bums me out that she's taking any of it out on me.\n\nThose comments cut a lot deeper than I think she understood. It made me feel really awkward and made me question all the body-acceptance progress I've been making lately.", "subreddit": "BodyAcceptance"}
{"post_id": "eeme20", "created_utc": 1577116840, "title": "Holiday Progress Pictures", "author": "maybesaydie", "self_text": "Post your  progress picture here. \n\nPlease, no pictures of children,  no nudity.\n\nHappy holidays from r/fatlogic.", "subreddit": "fatlogic"}
{"post_id": "ef0pyp", "created_utc": 1577190245, "title": "Feeling sad.", "author": "sticcsandsnaccs", "self_text": "I'm sick of feeling like I'm only allowed a certain amount of food every day or that I have to obsessively analyze every food choice I have in my head . I feel sad because my brain continually reminds me that I'm \"fat\" , despite reassurance from people around me , bearing in mind a lot of people I am friends with are pretty honest in that they'll say what they think , that I don't have an issue with my weight. It really upsets me because my friend went to London a few days ago and we met up yesterday and when I asked her what she had for lunch she said she had had a toasted sandwich, a packet of crisps , a hot chocolate and a cake.  Which if this was a few years ago , I would have been able to eat all that without feeling like shit about myself but on the contrary when we went to a coffee shop yesterday all I had was a small box of fruit (literally about 5 small pieces of melon, 2 pieces of pineapple and 3 grapes) and a bottle of diet soda, whilst my friend is sat there with a creamy chocolate drink and a packet of crisps.  It also upsets me because the way I see it is that everyone views me as a weak, low motivated, pity-seeking human, but no one understands how difficult it is to let yourself eat what your heart wants you to eat not what your head is telling you to eat. I know I'm chubby/chunky , sure , but people like bodyposipanda and Tess Holliday , are both quite significantly larger than me in body size and although I'm sure they have lots of days when they feel like shit and feel insecure , I'm sure on other days they try and remain positive and they don't stay at home all day because they feel too disgusting to leave the house . So if they are larger than me and are trying to get the most out of what they have to use it to inspire and motivate others , why can't I have a good emotional quality of life? I also feel panicky because it's nearly Christmas , hence meaning that there is a tonne of less than healthy food in our kitchen and I feel like I'm not going to be able to control myself , even though I think I can have good control over food choices sometimes . The last thing is that I feel that if I express my concerns about possible having an eating disorder to someone , they'll laugh in my face because I'm simply too fat to possibly have any chance of suffering an eating disorder . Why is my life so fucked ? Plz I just want to die", "subreddit": "BodyAcceptance"}
{"post_id": "ef2hkk", "created_utc": 1577200061, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ef3ncx", "created_utc": 1577205510, "title": "HELP! How can I accept being so fucking short?", "author": "baharrrr11", "self_text": "So I'm (almost) 17(f), I'm literally only 4'11\nNot 5'2, not 5'0\nLiterally 150 cm. I've been short my whole life and I never was THIS insecure about my height. I just didn't care and sometimes even liked being small until I entered high school and everybody got a LOT taller even the ones who were around my height.\nAnd it just clicked that I'm in fact not just short anymore I'M TOO SHORT.\nBelieve me I was not asking for much. Never expected to be tall. My mom is 5'2 and I think it's absolutely fine and normal.\nI do not feel normal. I don't feel insecure because I can't find a date or something, I don't really care about dating and looking 'hot enough' but hot enough to myself\n\n\nThe issue is I do not feel normal. I'm in my teenage years and I should be prepared to enter adulthood \nBut I feel like no one will treat me like an adult nor i would feel like am adult when i can't even reach the shoulders of a very normal man. My dad's 5'6 I still barely can reach his shoulders.\n\nI feel like my body's so weird and out of norm \nI hate that I can't reach the ground when I'm sitting.\nI hate that I should buy in the kid's section.\nI hate that my grandma's almost my height.\nI hate that I feel like a child and people gonna mistake me for a middle schooler.\nI hate feeling not normal and like an adult when I'm struggling myself to enter adulthood.\nI know there will be(and there were) some assholes that will tease me for something I had no control over.\nI'm super short and I have a baby face people automatically expect me to act a certain way that I absolutely am not.\nI just feel like a clown I'm sorry\nAnd you know what makes me so upset? The fact that there's no actual surgery to 'fix' myself, I wish It was as simple as losing weight (oh did I mentioned no matter how much I lose weight I always look chubby?) \nBut I REALLY DO want to accept and love myself because why tf not? Who's gonna love me instead?\n\n\n\nBut I really do need help I have no idea where to start the body accepting and self love journey, especially when lots of girls don't share the same insecurities as me.(hallelujah it's awful)\nMy short kings I feel you though..\nYa'll sorry if I rent too much nobody else wants to hear it", "subreddit": "BodyAcceptance"}
{"post_id": "ef63sx", "created_utc": 1577216748, "title": "Any books geared specifically towards men?", "author": "rinnska", "self_text": "Hello! Can anyone recommend any self-love/body image/body acceptance books that are geared toward men? The books I've (23F) read tend to speak to women. Not saying that men can't learn and use the tools offered in those books! But I have someone in mind that would just respond better to a man's point of view you know?", "subreddit": "BodyAcceptance"}
{"post_id": "efhh7r", "created_utc": 1577286494, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "efwg4z", "created_utc": 1577372861, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "efxbvf", "created_utc": 1577377260, "title": "I just really really really hate pictures", "author": "BiAndUhhReadyToDie", "self_text": "I’m really sorry if this is in the wrong subreddit, I figured it fit here though. Also sorry for weird formatting, I’m on mobile \n\nI’m not too sure how to cope or set boundaries when it comes to getting pictures taken of me. I hate how I look so much, in fact the only good qualities I have are my eye color, eyelashes, hair color, and lip color. Everything else is too ugly for me to feel confident in. My self hatred runs so deep that looking in mirrors or seeing any pictures of me (whether taken or selfies) makes me feel disgusted. I can just stop taking selfies, and I really only need mirrors for brushing my hair and teeth and washing my face. But pictures??? They’re harder to get around. \n\nMy dad is a photographer and always wants to take pictures of everyone, myself included. I don’t know how to say I don’t want a picture because my parents know that I’m not confident, but if they knew how deep it ran they’d be shocked. So I let him take pictures of me and I cringe every time it has to happen. It’s been like this for years, too.\n\n Every yearbook picture has been from the waist up, which only adds insult to injury since I hate my entire torso. Every group picture I’ve been in I have hated. Most of the time, if I’m in a group picture with my class, I’ll hide. The order is tall people in the back and I’m 5’10 so I go to the back, and once there are enough people in front, i duck so I won’t be seen. \n\nOne time, my friend took a picture of me. I started crying because I looked disgusting so I asked him to delete it. He didn’t. (Yeah He was an asshole and I haven’t talked to him in years now) \n\nRecently, I went to volunteer at a food bank with my class, it was really nice and i loved it. My teacher who I hate, walked up to me and my two friends and asked to take a picture. I set a boundary. I spoke up for myself and said “I don’t like pictures” A clear no. It was clear as day that I was uncomfortable with the notion. Guess how this leech responded??? She said “awww come on, I have to get pictures though.”  I hesitated, but seeing as I have anxiety and didn’t wanna cause a scene, I reluctantly hesitated and she took a picture of me. \n\nThis just brings me here. I hadn’t set boundaries on pictures and didn’t want them taken of me, but since I was saying yes to pictures, I couldn’t blame the person taking them for taking them. But the one time I’ve ever set a boundary on pictures, it got disrespected and thrown away and I got an unwanted picture taken of me anyway. How am I supposed to say that I don’t want pictures taken of me??? Especially when people ignore it and take a picture against my will anyway???? I mean, my self hatred is so bad that I show visible distress when seeing a picture of me. I get panic attacks when I randomly see how I look when I’m not ready to. It’s so bad and no one understands just how bad my self hatred is. I just really need to figure out how to set boundaries because if I get another hideous unwanted picture of me, I’ll cry and have a mental breakdown :( Thanks for reading this long post, any advice is helpful just don’t be mean because I will also cry.", "subreddit": "BodyAcceptance"}
{"post_id": "eg837l", "created_utc": 1577431542, "title": "Body Image, Penis Size, and Attraction", "author": "anarcho_nerd", "self_text": "Hi all, long time lurker on my main account, but I made a separate one to post here. \n\nAs you can see from the title, I'm (29m) here to talk about my body image, penis size, and attractiveness concerns. I've struggled with all of the above for a long time, and have been receiving professional help. Despite the weekly therapy, and a very loving wife (29f) I still struggle mightily with these issues. I find myself easily triggered into worrying about them, and it affects my overall quality of life quite a bit. \n\nWe've been together for going on 9 years now and married for 6 months, and have known other since freshman year of college. Despite that, I still sometimes slip into the fear that she'll leave me for someone with a more desirable body, larger penis, and overall attractiveness. Or even if she doesn't, that she actually wants someone with these qualities despite telling me she doesn't. \n\nI'm relatively fit: I grew up boxing and transitioned to weight lifting and now cycling and climbing, and work out at least 4 times a week. Despite that and a good diet, I'm not really toned or muscular, just athletic and healthy looking, and I'm only 5'7. For lack of a better descriptor, I look fairly stereotypically Jewish (which I am) and have a large nose. While I know it's the low end of average, my penis is only 5ish inches erect, and not terribly girthy. \n\nI hate my body and always find things wrong with it. When I see myself in the mirror (or another guy in the locker room or in porn), I compare myself unfavorably, and judge my own looks against theirs, especially in regards to penis size. I worry frequently that she wants someone larger, even if she says mine is good enough for her. I know how dumb it sounds, but I worry that \"good enough\" isn't \"best\". The fact that she works incredibly long weeks, and our sex life is currently slow doesn't help. Nor does the fact that to her knowledge she's never had an orgasm (which I feel awful for her about because I know it bothers her sometimes). \n\nIt's crazy to think that after previous sexual partners, and the long relationship with my now-wife, I'm still so hung up on this. \n\nCan I get some input from other posters? Sorry for bothering you all with this.", "subreddit": "BodyAcceptance"}
{"post_id": "eg9mcs", "created_utc": 1577442615, "title": "I want plastic surgery but I'm too young", "author": "pcflamingo", "self_text": "Hello. I'm very insecure about my boobs. I gained a lot of weight when I developed my boobs at around 9-11 years therefore they grew to hang. I feel very bad about them and I always hide my boobs as much as I can, nobody has seen them. Except for my boyfriend yesterday. I sent him a picture of me and said that I am very insecure still, and we talked several times about it in the past. And all he said was \"it's alright\". After a little discussion he said smth along the lines of \"well if I said they were the most beautiful boobs I've seen in my life i'd be lying\" which is true, but it hurt. He realized that it was mean and apologized, he also told me that it doesn't matter to him but it just crushed me. I'm really in love with him so I told him that I won't be sad tomorrow, but now I am here, trying to study and I'm breaking out into tears. I really want plastic surgery and I also plan to apply a job so I can safe money but until then I need to accept them. I really need to talk to people about it, but my friends will only say \"dump him\" which is the last thing I want to do. He's just not the best with words and sometimes a little too honest.", "subreddit": "BodyAcceptance"}
{"post_id": "egc9c3", "created_utc": 1577459462, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "egrqt2", "created_utc": 1577545650, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "eguccb", "created_utc": 1577558343, "title": "Coaching/Classes", "author": "nococonut", "self_text": "One of my Xmas presents was $ for a gift for myself so I'm looking at online or in person coaching for body positivity and acceptance. I've listened to Summer Innanen and have really like some of her guests (esp Lydia Knight and Christy Harrison) so looked at the them and will do an intro, but wondered what experience y'all have with any of these coaches or other coaches and programs?\n\nI'm also reading haes, which I love, but still am consumed by my weight, so think I need something extra.\n\nThanks for any insight!", "subreddit": "BodyAcceptance"}
{"post_id": "egxos0", "created_utc": 1577573936, "title": "I'm feeling really lost.", "author": "lcrow99", "self_text": "I'm recovering from 7 year eating disorder. Anorexia was really agressive and about 10 months ago I was hospitalized for treatment... (I'm not proud of any of it but I do really miss my sick (what we called in in treatment) body. I've gained weight and my body isn't shutting down any more. But I am not coping well with it. I want to start going back to my behaviors. Any advise for body acceptance? Or hopefully body love?", "subreddit": "BodyAcceptance"}
{"post_id": "eh10xz", "created_utc": 1577591143, "title": "Time periods when...", "author": "bbird-is-the-word", "self_text": "women had a body image to be more curvier/heavier/fat/voluptuous/plump to be beautiful?\n\nI had heard questions about this topic in comparing the times to today. Even though today is more body positive than 10 and 15 years ago, women still have to be a certain type of curvy to be accepted. People have brought up the renaissance with paintings and the 1950s with Marilyn Monroe and I agreed from looking at paintings and old ads.\n\nI feel like my body is more similar to women in historical paintings than on instagram. I'm a slim thick girl who have thicker thighs and a semivisible belly (standing up it looks flat, but sitting or laying down you see it). Probably should go to more museums for self-confidence in the new year, many of them are free to me in my city lol\n\nDo you guys know any more times in history when having more fat was seen as more attractive? Elaborate more the Renaissance and the Golden Age of Hollywood? I'm interested in how body image changes through history and why it does.", "subreddit": "BodyAcceptance"}
{"post_id": "eh2mef", "created_utc": 1577600466, "title": "Trying to accept my adult body", "author": "lleigh201", "self_text": "I’ve had major ups and downs in my body acceptance journey (26f). Historically, I was naturally “thin”- 5’8 tall, weighing 115 lbs in high school and around 130 in college. I ate what I wanted and exercised for fun, but never had to fret. I didn’t LOVE my body, but I was fine staying the way I was. I dropped back down to 118lbs at age 22 and had to be hospitalized for complications related to malnutrition (I was taking TONS of adderall to survive student teaching and lost my appetite for months). At the weight of 118lbs (size zero), I remember thinking and feeling: “I LOVE this body.” Which is so sad, because I almost died in the process of unintentionally attaining it. Fast forward the next 3 years, and I was able to maintain a weight of about 125lbs with serious diligence. While I loved the way I looked, I hated the stress I put myself under to maintain it. Since I turned 25, I’ve gained 23 pounds and now weigh 148 and can barely fit into size 8 jeans. I’m physically healthy and enjoying life but have had an impossible time accepting my “new body.” It’s a DRASTIC difference. I know I should be grateful to be healthy, but I’m struggling. The level of diligence it requires to maintain my “ideal body” isn’t doable with my life (or any life), and honestly, probably not even healthy. I want to accept my new, more mature physique, but I feel like I’ve lost an old piece of my identity and the body of my youth.", "subreddit": "BodyAcceptance"}
{"post_id": "ehonp4", "created_utc": 1577725417, "title": "Meta Monday", "author": "GetOffMyLawn_", "self_text": "The new year and new decade is almost upon us. I hope everybody had a good one, and if you didn't let's hope for new beginnings. \n\nWhat's on your mind?", "subreddit": "fatlogic"}
{"post_id": "ehpw1e", "created_utc": 1577730638, "title": "My Mom body shamed me and I am really struggling", "author": "Maxwell979797", "self_text": "My whole life, I was athletic and lean. I am 5’10” with huge boobs and wide hips, and for much of my life I weighed about 145-155 pounds and looked rail thin given my build. With that being said, I’ve never been smaller than a size 6 or 8 (US) \n\nIn the past couple of years I got into a super happy relationship and have put in some weight. I try not to weigh myself, because psychologically it really affects me negatively. However, I would guess I probably weigh around 185 pounds now and I wear a size 12 mostly everywhere. \n\nMy mom told me that my weight gain has been “dramatic” and “extremely concerning” and that she is worried for my health. I admit I have been eating more late night snacks and drinking more beer than I used to, but otherwise my diet is relatively healthy and I am happy. It has taken work for me to accept my new body, but I was doing well until she came after me. She even went as far as to say that I should be embarrassed to go to public functions and see people from high school because of my weight. She thinks I would be happy if I dropped 20 pounds. \n\nHow do I move past this? I have a loving and supportive boyfriend who loves me at any weight, and good friends who understand how important body acceptance is. My thoughts about hating my body as a result of my mother’s comments have become all-consuming and the idea of buying a dress for new year’s Eve is making me feel sick. I feel like I can’t even look in the mirror without seeing cellulite and an imperfect tummy that used to be toned and fit. How do I get past feeling like I’ve let myself go?", "subreddit": "BodyAcceptance"}
{"post_id": "ei04nf", "created_utc": 1577780339, "title": "Has anyone gotten smaller tits just by exercising?", "author": "skskskanon", "self_text": "Like seriously, did your boobs like look exponentially firmer with just exercising? breast lifts are awfully expensive and this problem is literally ruining my romantic life.", "subreddit": "BodyImage"}
{"post_id": "ei3zsk", "created_utc": 1577804909, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
