{"post_id": "bjbxdh", "created_utc": 1556676733, "title": "New mom, new body", "author": "lifethrowinglemons", "self_text": "I gave birth 6 months ago to a beautiful healthy baby boy and I am struggling to accept my body. I feel like I am very bothersome when i have to dress up because nothing fits me like it used to, even with new clothes I bought or wearing a bathing suit because I am covered in stretch marks. It usually results in crying or frustration to the point where I decide that it’s worth going. Any advice?", "subreddit": "BodyAcceptance"}
{"post_id": "bji9lj", "created_utc": 1556723730, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bjj9el", "created_utc": 1556728595, "title": "Billie razor commercial", "author": "PM_ME_KITTYNIPPLES", "self_text": "One small detail I noticed is they actually showed a model shaving her toe. I don't feel alone with my hobbit feet.", "subreddit": "BodyAcceptance"}
{"post_id": "bjkfgk", "created_utc": 1556734295, "title": "I'm struggling with unintentional weight loss. (TW: weight loss, medical issues)", "author": "Rottenboy22", "self_text": "I am a 22 year old female. My whole life I have always been bigger. I had some weight to lose, but not a lot and I also had a lot of muscle. I was happy with my body. Then, I had to get my wisdom teeth removed. Not a big deal. I had never had surgery before, but I wasn't even worried about it, because of how routine the procedure is. I am stubborn and went to work the day after my wisdom teeth removal, which led to me developing dry sockets. I was so sick and in so much pain that I lost 20 lbs in a week and a half. I started to recover from that when toward the end of February the rapid weight loss caught up with me, and my gallbladder became inflamed, infected and full of stones. I ended up losing 25 lbs overall, which was 15% of my body weight. It happened so fast, and while it was happening I was just trying to stay alive, and keep up with my job and graduate school. (When I came back to work after my gallbladder removal my manager even commented \"look at your new skinny body\") Now, months later, the weight is still off. I am smaller now than I have ever been. I hardly recognize myself. I constantly look at my body and all the parts that are much smaller and different now.  People keep commenting on how good I look, and how they've noticed my weight loss. It's a compliment, but it feels like a 'congrats on almost dying.' When I tell people about how I lost the weight, they comment 'maybe I should get my gallbladder removed.\" It's like they see it as a good thing, but it wasn't a good thing. If I had lost the weight slowly, and in a healthy way I would be celebrating. It's just been a tough year so far, and sometimes I forget everything that happened, until I look in a mirror, or get dressed. I don't know why this is so hard for me, but I have been struggling so much lately. Thanks for reading, I really just needed to vent.", "subreddit": "BodyAcceptance"}
{"post_id": "bjkmdx", "created_utc": 1556735226, "title": "Too ashamed to go to therapy", "author": "castlecat32", "self_text": "I’m not really sure how to put this, but I’ve had pretty severe body dysmorphia for my entire life. Most specifically, it’s my face that I have issues with. I feel hideous; the best description I could give is that it feels like I’m wearing a Halloween mask 24/7 and I can never take it off. \n\nIt’s gotten to the point where I have trouble making eye contact with people. Even my boyfriend. It has made me agoraphobic.\n\nI’ve known for a long time that I would benefit from therapy. So I actually made an appointment to see a counselor about it.\n\nAt the counselling session, I started crying when talking about my face and I just put my hands up to hide my face. I felt like the counselor was staring at me. I was so self-conscious about how I looked while crying that I couldn’t even open up fully.\n\nI cancelled my next appointment because I honestly feel so ugly that I don’t want anyone to look at me. Not even a counselor. I know I would really benefit from talking about my issues with a counselor but I’m so ashamed of how my face looks that I can’t bring  myself to ever go back. Even the smallest things make me self conscious - the way my mouth moves when I talk. My smile, the shape of my nose, the way I walk and cross my legs when I sit down. Everything. \n\nI feel like I’m going crazy and I don’t know what to do.", "subreddit": "BodyAcceptance"}
{"post_id": "bjmx33", "created_utc": 1556746971, "title": "struggling with insecurities", "author": "Rose-lemonade", "self_text": "I’m a 21 years old female who has been struggling with insecurities for a long time. It started when I was around 15 years old and I started eating as little as possible in order to lose weight. Even though I'm doing much better now, it is still on my mind every day and I still struggle with accepting my body the way it is. Besides this, I also care a lot about being pretty and beautiful. I always worry that I’m not pretty enough and that other girls are prettier than me. I really hate myself for caring so much about this because I feel like it's very superficial but I can't get it out of my head. These insecurities are mainly related to my boyfriend in the sense that I care a lot about what he thinks and that I am afraid he thinks other girls are prettier than. He keeps telling me that I don't have anything to be worried about and that it's not even that important whether I am pretty or not and that he loves me anyway but it's so hard for me to believe that. \n\nSo I could really use some advice on how to stop comparing myself to others, how I can stop caring so much about being pretty and how I can accept the way I am and eventually starting loving myself.", "subreddit": "BodyAcceptance"}
{"post_id": "bjnysz", "created_utc": 1556752799, "title": "Is accepting that I'm not a pretty girl and focusing on something else easier?", "author": "nomoreghosts", "self_text": "Instead of going through these ups and deep lows about trying to feel like I'm beautiful -- maybe it would be more freeing to just accept that I'm not. That beauty isn't for me. I just wasn't meant to be a pretty girl. A girl who's known for her other qualities as a person, maybe, but not someone who makes other people feel they're around someone attractive. I've just been so caught up on how for women, beauty matters whether it's moral or not, and how attraction as a whole gives people (unfair) advantages in life. And I really wanted to be a part of that. I really wanted to experience what it's like to be a beautiful woman, what it's like to get those advantages. But perhaps I should stop trying. I don't know. Has anyone here ever considered this, or has fully adopted this way of thinking? Is it working for you?", "subreddit": "BodyAcceptance"}
{"post_id": "bjtdpi", "created_utc": 1556793134, "title": "I don’t know how to get to a place of acceptance. Bout to just cut em off and be forreal flat chested 🙃", "author": "SerrahBetrippin", "self_text": "So I was pregnant at 22 and had my son almost two years ago. I always breastfed until he was 8 months or so. After I breastfed I notice it was like someone took the meat out of my breast. My breast always slight sagged because I’m human. But after the pregnancy I tried to take my health into my own hands. I dropped 60 pounds through diet and exercise. But my breast still greatly sag almost down to my stomach. As a 23 year old young women fit in all the right places but one this is a nightmare. I never though at 23 my breast would look like almost empty water balloons. And I know women have there stories ohh well I’ve been with a bunch of guys and they all loved my blah blah. Well good for you sis I did not have the same lovey journey as legit I was with 2-3 guys after my relationship ended. It was a nightmare the first guy felt my breast and as legit wide eyed at the amount of emptiness of my chests. The 2nd guy took one took at them and said And I quote “ oh it doesn’t matter that your chest super sag I have appropriation for a mother’s body” he blocked me directly after that encounter guys and I wanna say it other reason but uhh he didn’t say that speech until after he felt my chest...3rd guys literally laughed at me and told me to leave because he doesn’t chuck old ladies...and I don’t even like douchebags I mostly date nerd or fellow parents so this is hella depressing..so um what do I do I’ve looked at the boobs gallery it didn’t help and at this point I’m just like duck it saving up for a boon job first and then a car later in life. I know that’s so fucked up but I don’t even know how to look in the mirror with out being greatly saddening by the saggin 😞", "subreddit": "BodyAcceptance"}
{"post_id": "bjw1fd", "created_utc": 1556809711, "title": "I've accepted my curves, but struggling accepting the amount of cellulite.", "author": "0seagirl", "self_text": "I've struggled with eating most of my life. I'd been very thin most of my life, until my late 20s when I started binge eating to a lot bigger, then restricting again, and then getting bigger again.. Now at 32 I'm happy with my curves. It's my cellulite that's getting to me now though. I understand everyone has it, and that's cool, but the amount I have looks excessive and noticeable. It covers my butt, covers my thighs and upper legs, covers my upper arms, and a little of my lower legs too. It makes me feel so bad and it's triggering feelings of wanting to lose weight again, solely to try to lose the cellulite.\n\nAnyone else in this place? I could use some help, advice, or anything. I really want to stop myself falling back into restricting and obsessing over trying to lose weight when I don't need to. I have no idea what to do really. I'm struggling with this.", "subreddit": "BodyAcceptance"}
{"post_id": "bjw32t", "created_utc": 1556809964, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bk0zx1", "created_utc": 1556835840, "title": "Feeling Stuck", "author": "MysteriousInterest1", "self_text": "Over the past few years, I've felt stuck in terms of my body image. I'll feel bad about my tummy, and lose 10lbs, just to gain it back after I stop caring. I'll obsess about the size of my ears until I move onto my nose, and then the redness on my skin, and then my dark circles, ect. It feels like I'm playing an endless game of catch-up, where I'm always just out of reach to feel happy with the way I look. Can anyone relate?", "subreddit": "BodyAcceptance"}
{"post_id": "bk2pne", "created_utc": 1556846298, "title": "A promise to myself!", "author": "206Linguist", "self_text": "Hey y’all!\n\nSociety has done a good job of dictating what I ought to wear. A really good job. I think I’ve finally gotten the gumption to kick that to the curb though!\n\nI’ve decided I’m going to wear my stomach out ALL summer!\n\nI’m going on a small vacation soon. I bought a bikini. A high waisted bikini,  but a bikini nonetheless.\n\nI’m looking at new sports bras. When i go out walking around this summer, shirts are optional.\n\nI bought waist beads for the hell of it.\n\nJust bought a new crop top to wear when it gets chilly.\n\nY’all, I’m excited. My body is my own. Going against the norm makes me a little nervous, but I’m so very tired of neglecting to fully live in my body. Let’s hope that changes this summer!", "subreddit": "BodyAcceptance"}
{"post_id": "bk876g", "created_utc": 1556888344, "title": "I hate my body even when I try to tell myself I’m pretty...I just wanna cry", "author": "J_Bond98", "self_text": "I keep telling myself that beauty comes in all shapes and sizes, that being skinny is not the only beauty \nI keep looking at myself saying “you’re good” “you rock” \nThen I look around and see that beauty is only skinny strong arms, tight waits...and then I feel like shit \nMy family are all sport addicts, but me ...\nSports is so overwhelming for me \nNow I feel like crying \nMy arms are chubby \nI don’t have a tight waist\nI have a chubby waist\nNow I’m ditching good food, eating less \nI just \nI wanna cry", "subreddit": "BodyAcceptance"}
{"post_id": "bk9ksz", "created_utc": 1556896345, "title": "Anyone get “red face” when they are nervous?", "author": "little_lita11", "self_text": "I’ve had “red face” for as long as I can remember. Anytime I’m nervous, or feel any strong feeling really, my face and neck get red splotches and then turns solid red (if I’m really nervous). \n\nDoes this happen to anyone else? How do you cope?\n\nI hate doing job interviews because of it (I immediately get nervous in interviews) and I’m so tired of people asking if I’m alright. I don’t know if there is even anything that can be done about it, but if you know anything that helps, please share!!", "subreddit": "BodyAcceptance"}
{"post_id": "bk9la0", "created_utc": 1556896422, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bkc6mn", "created_utc": 1556910364, "title": "Trying to learn to love me", "author": "jrdnhpk", "self_text": "So I (24F) went through a lot of stressful things at the beginning of last year and I ended up putting on a lot of weight, now I am left with stretch marks and fat galore. I am having a hard time loving myself and feeling confident. Especially when my BF grabs on to my fat or makes some comments about my stretch marks. He also gained a lot of weight and has stretch marks, but I always just tell him that he looks great and I love him. \n\nAre there ways for me to get rid of stretch marks sooner than exercising would rid me of them, and how do I gain my confidence back?", "subreddit": "BodyAcceptance"}
{"post_id": "bkliw0", "created_utc": 1556979085, "title": "Learning to love myself after weight gain, but can't accept this stupid belly!!!", "author": "glitterqueenbee", "self_text": "Hi all. About 2 years ago I gained about 30 lbs over less than 2 months due to a new medication, and ever since I've had significant body image problems. It took me a long time to even accept it as fact and buy larger pants. This weight went mainly to my stomach, love handles, and waist/thighs. I also developed stretch marks in those areas, which was entirely new to me. \n\nPrior to that, my weight had been fairly stable for as long as I can remember. Over this time, I've slowly accepted my body again, even the stretch marks - except for my tummy. It sticks out so much, my grandma asked me if I was pregnant (which was devastating to hear in the midst of these body image issues). \n\nI don't know why so much fat congregated there, and I don't know how to get rid of it. Crop tops are really popular right now, and I am far too self conscious to wear them. I know truly flat tummies aren't real, and I'm not asking for that. I just don't want it to look so distended, like I just ate an entire cake or like I'm 3 months pregnant.", "subreddit": "BodyAcceptance"}
{"post_id": "bkm3dl", "created_utc": 1556982648, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bkq015", "created_utc": 1557005053, "title": "I look like a freak.", "author": "gucci_fridge", "self_text": "I'm 13 years old, male, and going through puberty. I am tall (mostly legs) and have long arms but a super short torso. My arms are probably almost twice the size of my arms. I don't know what to do about it, especially since I'm only two inches below my Dad, who is about 5'8. Also my mom is 5'2 so I don't think I'll be growing more. Excersising hasn't really helped even though I play lacrosse and hockey all year round, and started playing since I was about 7.", "subreddit": "BodyAcceptance"}
{"post_id": "bkqg53", "created_utc": 1557007758, "title": "My boyfriend loves my body - but I don’t. How do I change my way of thinking?", "author": "psychoweeb", "self_text": "I have the typical hourglass figure.. I have wider hips, bigger butt, a smaller waist and broad shoulders/big chest. My boyfriend is obsessed with my body because it’s “thicc” or whatever, but I hate it. I have an eating disorder and I used to be anorexic.. I’ve always had a curvier body type, even when I was anorexic my curves were visible but I was completely flat. I find myself missing my old body, and I don’t know what to do about it? I don’t know how I can accept the way I look. Sometimes I think I look fine as hell and I’m a thicc goddess, and other times I hate myself. Does anyone else relate to this? What do I do?", "subreddit": "BodyAcceptance"}
{"post_id": "bkqp9h", "created_utc": 1557009363, "title": "People keep telling me to lose weight", "author": "marybbad", "self_text": "Hello! I've been a positive person overall about my body. I don't love it but I'm trying to change it (for so long...). Today I was having dinner with some family members and everything was going well. I was happy no one mentioned my weight (people always do and I tend to believe that people who do that aren't the most intelligent... Or they don't even think about others.)\nSo my uncle was telling me goodbye and he told me \"you need to walk because I'm not enjoying what I'm seeing.\" I just nodded and smiled after. And now I got really sad. I'm not that fat for my height. Yes I need to lose a little weight but not like 40 or 50 kg.\n What do you do when people talk to you about your weight? \nI need some happy thoughts because I'm really feeling down.  Thanks in advance.", "subreddit": "BodyAcceptance"}
{"post_id": "bkrqd5", "created_utc": 1557016033, "title": "My Shadow Is My Worst Enemy.", "author": "frenchie555", "self_text": "Does anyone else have issues comparing the size of their shadow to others, and getting upset when yours is bigger than theirs? I find this can trigger me to hating my body almost immediately.", "subreddit": "BodyAcceptance"}
{"post_id": "bkudkx", "created_utc": 1557035059, "title": "How long is it going to take for me to feel fantastic about myself?", "author": "Alexisiscool25", "self_text": "Ever since I was in 6th grade (I’m 22 now), I have been insecure about every aspect of myself. 8th grade-11th grade I would go home from school and cry over my looks. I was skinny and between weights of 117-120. When I graduated high school I got a little better about not focusing so much on my looks. But around summer last year I started gaining weight, and at first I was feeling good about it because it was just weight I needed to gain (like butt, boobs, thighs) I looked and felt healthy. But I gained 35 pounds within 3 months and I’m between 152-155 now. I can’t stand how big my arms look &amp; my stomach.. I feel so terrible about that. Whenever I have sex with my boyfriend he tells me I have such a sexy body and that I’m perfect &amp; I can’t even smile or feel good about it because I don’t agree. :( \nI’m tired of not feeling good about myself and I know that superficial stuff shouldn’t be so focused on compared to other problems. I just want to be proud and feel great in my own skin. \nI’m gonna start making changes and doing cardio. But I really had to vent :(", "subreddit": "BodyAcceptance"}
{"post_id": "bky7ps", "created_utc": 1557065967, "title": "[2019 Edition] r/fatlogic \"International No Diet Day\" 24-Hour Fast Check-In Thread.", "author": "CubicSlime", "self_text": "**[LATEST] This event is now officially over!!! Thanks everyone, for your wholehearted participation and support~~~ :D**\n\n&amp;nbsp;\n\n&amp;nbsp;\n\nGreetings to everyone here on r/fatlogic!!! :D\n\n&amp;nbsp;\n\nSo, 6 May is upon us all again. Apparently, this day is also some so-called \"International No Diet Day\", which many of those HAES/FA cultists venerate, and go all out to avoid \"being on a diet\" on this day. Though, then again, \"avoiding diets\" is an everyday occurrence for them, but this day is symbolically more important to them, so... o.o\n\n&amp;nbsp;\n\nAnyway, using an idea that I came across on this sub years ago, for the past few years, every time 6 May comes around, I have decided to join in the festivities, by going on a 24-hour fast on this day every year! I too, am going \"no diet\" on this day as well! This, as the word \"diet\" refers to the foodstuff one consumes in their daily lives, hence, wouldn't \"no diet\" equals to no food consumed at all? &gt;:D\n\n&amp;nbsp;\n\nHad been \"promoting\" this for the past few weeks on and off on this sub, but, if anyone wants to, feel free to join me on this fast, from 0000 Hrs on 6 May, until 0000 Hrs on 7 May, based off your local timezone? Please take note of the important caveats listed below if you intend to join before \"checking-in\" in this thread, and I wish you all the best in your 24-hour fast today. :)\n\n&amp;nbsp;\n\nImportant caveats:\n\n* THIS EVENT IS COMPLETELY VOLUNTARY.\n\n* DO NOT JOIN THIS EVENT IF YOU EVER HAD A MEDICAL DIAGNOSIS OF ANY EATING DISORDER. Instead, please use this day to focus on your recovery. Take care!\n\n* IF YOU ARE NOT FEELING WELL, PLEASE DO NOT JOIN AS WELL. There is a risk of aggravating any current illness you might have, which is a risk I will rather avoid. Please rest well!\n\n* \"Starvation mode\" does not exist, at least, in the manner that those HAES/FA cultists put it. \"Dehydration mode\" however, does exist, and is potentially lethal! Please ensure adequate water consumption, but don't go overboard and end up with \"electrolyte imbalance mode\", which could be lethal as well...\n\n* If you are not feeling well during the course of the 24-hour fast, please stop your fast, and if needed, seek medical attention. Your safety and well-being is of utmost importance!\n\n&amp;nbsp;\n\nThat being said, to everyone who will be joining, welcome~ :D\n\n&amp;nbsp;\n\nP.S. Last year's thread on this event can be found [here](https://www.reddit.com/r/fatlogic/comments/8h92i9/official_rfatlogic_internation). :3", "subreddit": "fatlogic"}
{"post_id": "bkyhn3", "created_utc": 1557067445, "title": "I'm glad I got fat", "author": "Gameboy_Connoisseur", "self_text": "When I was little, I was rather skinny. Everyone commented on how they could count every bone in my body. I was pretty indifferent. Starting at about age 9, I slowly started getting chubbier, until hitting a peak of about 120 pounds with a height of about 5 feet at age 11. At this point, I didn't really like my extra chub, but I didn't completely hate it. That would come later. It was at this time that we found out I was allergic to a lot of different foods, the hardest to avoid being gluten and corn. I was on a rather restrictive diet for about a year, not to lose weight but to get over my allergies. Not only did I get over those for the most part, I lost 20 pounds in the process. I did lose most of my chub, but I still thought of myself as just as fat. Seeing pictures from a year ago really shocked me, since it hadn't registered in my mind that I was any thinner.\n\nStarting middle school at age 12, I was off the restrictive diet and over the course of a year, I gained 60 pounds. Seeing as how puberty was just starting, I doubt it was all fat, but a significant amount surely was. Regardless, it was a very difficult transition, since I was quickly outgrowing clothes and worried about what people would say. At this point, I actually stole a few of my Mom's sweatshirts, all of which I can still wear today amazingly enough. I was fearing people would give me snide comments regarding my bulk, but most of it was just neutral observations regarding my stature, like my Mom calling me a big guy (these still upset me, but it's better than getting it rubbed in my face.)\n\nOver the course of the next few years, I would gain more weight at a much slower and healthier rate. I am now 17, 5 foot 8, and weighing about 240ish pounds. I've gained about 20-30 pounds since middle school, but not very much of this appears to be fat, so my body size has been pretty stable thankfully. I've gotten used to being bigger since that massive spike in my weight at age 12, but I still wished to lose my weight, especially since I thought it would help with my gender dysphoria since my transition goals were to be rather petite. After reconnecting with my body and loving her, I've come to appreciate my body fat, not only for what the experience has taught me, but also because it's just fun to jiggle around and play with. I feel at home in my body for the first time in my life, and I love every last subatomic particle that makes her up (even the ones that make up my masculine features, they deserve love too).", "subreddit": "BodyAcceptance"}
{"post_id": "bkzqy4", "created_utc": 1557073887, "title": "My best friend idolizes the “instagram body”", "author": "fuckupsomesmahtkids", "self_text": "I’ve had a really unhealthy relationship with the gym. I would work out obsessively for 3 hours a day, every day, until I got very ill for that exact reason. Since then, I’ve been scared to go to the gym and only recently begun working out at home and limiting myself to an hour. \n\nMy very best friend works out several hours a day, every day, and while I support that, she’s very critical about people’s bodies. We’ll watch YouTube videos together and she’ll criticize them, calling them “chubby” or pointing out that “she has a belly,” when in fact, their bodies are fairly normal. I should add here that she’s never criticized my body. \n\nWhen I confronted her about it, she said the only reason that she’s critical of others is because she is critical of her own body. “Why would I want a man who’s not on the same level as me?” were her exact words. I can see the logic in this, but as someone who has always struggled with their body and self-image, it bothers me.\n\nHow do I deal with this?", "subreddit": "BodyAcceptance"}
{"post_id": "bl623c", "created_utc": 1557107827, "title": "my self confidence is plummeting help", "author": "--jjulie", "self_text": "my body is really strange. my legs are super skinny and my build is really narrow and kinda lanky ig except i’m not that tall. at the same time i’m really “flat” and my waist is kinda wide. at least nowhere near as skinny as you’d expect it to be when you consider what all the other parts of my body look like. basically i’m a rectangle. anyways, a few months ago i decided to start exercising and eating super healthy to try to build confidence and i’ve seen some difference but i don’t feel any better, possibly worse.  \n\nlast year i was super insecure but i liked shopping for myself and i wore makeup. i actually despise wearing makeup but  occasionally, besides my body, it made me feel kind of pretty. a while ago i stopped wearing makeup because it stopped making a difference in how i felt about myself, and not in a good way. i also tried to go shopping today for the first time in a while because i lost weight and i don’t have a lot of clothes that fit anymore, but I couldn’t buy anything bcs when i looked at myself in the fitting room my heart literally sank. i’m convinced that it’s unacceptable for me to pay to wear the clothes with the body i have (and i’m talking things like shorts and even some t-shirts). i literally have 3 outfits that i feel comfortable leaving the house in and if their not available i panic. there’s more but this is long and irrelevant.", "subreddit": "BodyAcceptance"}
{"post_id": "bl6zq4", "created_utc": 1557113509, "title": "I've (22m) have gained so much weight because of my medication and since I broke up with my girlfriend, I felt more ashamed than usual today", "author": "screwseven", "self_text": "I weigh 235 pounds, and I'm 5\"6'. I know that's a lot. I've gained mostly in my belly and I look pregnant. I've been trying to love myself but it's hard. Today my mom said something to me, not intending to hurt me, but it made me feel so low. I just feel so alone, I'm surrounded by in-shape people. My two roommates are in great shape and attractive. I am interested in someone but I doubt she'd be interested in me. Ever since my ex and I broke up I just gave up. And I'm on a medication that makes you gain a lot of weight, but I need it.\n\nCan anyone out there relate? Does anyone out there weigh as much as me? Does anyone out there feel like I'm feeling? I just don't want to feel alone", "subreddit": "BodyAcceptance"}
{"post_id": "bl9e2n", "created_utc": 1557130702, "title": "Meta Monday-No Stupid Questions", "author": "maybesaydie", "self_text": "Take this opportunity to ask to the community any weight related questions you may have. No rants please.\n\n\nOur next selfie post will be May 27 so get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "blgdlp", "created_utc": 1557170313, "title": "Anyone deal with body dysmorphia also? If so maybe you can give me some tips.", "author": "Creamy-_-Ebola", "self_text": "So basically all my life I've been a heavy guy, no girls liked me before, I ate my feelings, etc. Basically an Incel. A girl even said \"Eww, no he's fat!\" Back in high school when a buddy of mine told her that I liked her (so no, \"no\" isn't the worst they can say. Lol)\n\nAnyways basically my entire life I've basically had zero self esteem. Cut to now (25 years old) I've been working out for about 3 years, went from 284-295 down to 209-212. I've put on some muscle but my genetics sucks so even after 3 years I still don't look like a Chad, but people tell me that i look like I lift. \n\nNow I've had 3 girlfriends in the past but even after that and having gone on some dates, I still don't think I'm even the slightest bit attractive and still feel like I'm 284+ when I look in the mirror or see myself in pictures. I still constantly suck in my gut when I walk around in public because I feel like my stomach sticks out past my chest and whenever a girl looks in my direction I feel like she's thinking about how disgusting my body looks. I can't even bring myself to ask a girl out on a date in person because I'm just constantly thinking that she's looking at my \"fat\" and then I just basically give up in my mind before I even get close to asking. And if by some miracle I do end up dating them the entire time I'm just waiting for then to find someone that's obviously more attractive than I am and dumps me or cheats on me.\n\nI used to think I was gay because I always admired other mens bodies/faces, but I came to understand that I just really wish I could BE them. Because I hated being myself, I hated the way I look. I feel like no matter what I do, I'll always look hideous.\n\nI guess a silver lining is it made me a kind person, because I know what it's like to be made fun of because of the way you look or have insecurities.\n\nAnyways, sorry for the long post I'm just kind of wondering if anyone else currently feels or has felt this way before. And if so what did you do to overcome it?\n\nEdit: Sorry if it's a weird post. I'm not used to admitting that I have this issue. I know it's super annoying when people post about their problems online. At least people always tell me they get annoyed by it. Also I'm a 25 year old Male, I forgot to add that.", "subreddit": "BodyAcceptance"}
{"post_id": "blh0hx", "created_utc": 1557173503, "title": "Please help me", "author": "RayneBlack97", "self_text": "I, 22m, am in a relationship with  girl, 19f, and she has days where her image of her own body is fucked.  To say the least, anyway.  I need tips on how to help her, because as of right now no matter what I do it doesn't work.  \n\nHow should I handle this?", "subreddit": "BodyAcceptance"}
{"post_id": "blrukt", "created_utc": 1557241846, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "blsnd9", "created_utc": 1557245892, "title": "Reflecting insecurities on others", "author": "unidentified_pancake", "self_text": "Story time!\n\nI in no way, shape, or form, condemn nor condone, the actions of my friend. This friend is actually a pretty cool person, and is considered conventionally attractive. What I failed to realize before, was despite this, conventionally attractive people can have low confidence regarding their image. In some cases this is even worse than those who are a) not conventionally attractive and/or b) actively bullied for their looks. It began with easily ignored signs such as an obsession with blemishes, then it progressed to restrictive diets (a cucumber, some lettuce, an apple, and a yogurt), then eventually to plastic surgery plans. The incident today (and a few times before) is an indicator (to me) that she still struggles with her self-imposed standards, this friend of mine is an artist and she was drawing 'cats' that represented people, now of course (if you've seen my previous post, you'd know I wear a loose uniform), she drew my 'cat' as obese, with distorted facial features, and an obscenely large chest area. Ordinarily this would offend me, and I wouldn't say we are close enough for me to know this is a joke not at my expense, but for some inexplicable reason, I feel like this expresses her feelings towards her own body. I am not really asking for anything here aside from thoughts, and of course this is my opinion which may be wrong (hope it isn't offensive &gt;-&lt;).", "subreddit": "BodyAcceptance"}
{"post_id": "blyn22", "created_utc": 1557275839, "title": "I want to love my body, but it's hard feeling like I have to do it on my own", "author": "EstrogeNitroglycerin", "self_text": "I've struggled with my body image ever since I was 12. As a trans woman, I've dealt with a ton of gender dysphoria related to the broader shape of my body, to the hairs I've lost before starting my hormonal therapy, to the coarse hairs on my body. For years on end, I told myself that I would never be loved or desired. I was convinced that my destiny was to die alone and unwanted, as if it was some sort of biological fact: I was ugly, nothing more to it.\n\nEver since those days, I've started my transition, I've gone to therapy for my depression and suicidal thoughts and have even got a wonderful, loving boyfriend. I feel happier than I ever have.\n\nBut I still feel ugly. I can pretend I don't for a little longer than I used to, but my feelings still remain the same. It's not as if I don't make efforts to change my body image, I follow everything that my therapist tells me to do to better my perception, but still, I feel trapped, and I think I've figured out one of the reasons why.\n\nIt's because all my life, Ive been the only person who's ever made me feel pretty. My boyfriend, , being completely asexual, has no physical or sexual attraction to me. He's with me for my personality and nothing else. So even though I know he loves me more than anything, I still feel undesirable, like no one could ever want my body.\n\nEven before, I've never been called pretty, ever. I've never been hit on, I've never been complimented on my appearance, not even by my parents. \n\nAnd I feel so greeding for feeling this way. After all, it should be enough for me to just try and love myself, right? No one owes me attraction. And, besides, I shouldn't limit my worth to how I look or how others feel about me.\n\nBut I'm realizing that's not how it works. Self-love is important, but so is feeling outside love, and there's no escaping it.\n\nSo, for now I'm feeling stuck. Undesirable.\n\nI want to work on it though, and I'd love any piece of advice.\n\nThanks for reading &lt;3", "subreddit": "BodyAcceptance"}
{"post_id": "bm6fvk", "created_utc": 1557328343, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bmfop4", "created_utc": 1557377484, "title": "Knowing that my partner watches porn makes me self-conscious", "author": "HeavyAlps0", "self_text": "I know he is entitled to do whatever he wants to do during his own time and that I shouldn't tell him what to do with his own body, so I don't tell him those things, and avoid talking to him about it. But I get very insecure at the idea of him climaxing at the sight of another woman. I worry that it subconsciously causes him to get used to seeing a beautiful woman to finish, and then the sight of me is disappointing in comparison. Obviously porn is almost going to have attractive women in it, and under my assumption that I'm unattractive, that means whoever he is watching does not look like me, because I don't exist in any of those genres. Even when considering that there are some less popular categories that feature women that aren't conventionally attractive, I don't fit in any of those either. None of them describe me. I don't want to describe what I look like, but trust me when I say that I would never be hired for any kind of those videos. Girls like me do not exist in the porn industry. It hurts to know that he'd much rather have sex with them than me. They serve as a reminder that I can't satisfy him with my physical body nearly as well as the girls he watches, and that he must be itching to have sex with one of those girls after seeing so many videos. And I've been told that it's possible for people to like different kinds of bodies simultaneously, but why would he like mine if he has seen so many better bodies. It makes me feel like I am on the lower end of girls that he likes, and that he is indifferent about having sex with me but still has to watch porn to get the experience he truly wants. I don't think he's satisfied with me. I'm scared he likes porn more than me.\n\nI've received advice on how to personally deal with him watching it, but I don't think they understand the experience I'm having, their advice will only work for people who are conventionally attractive. How does someone who isn't conventionally attractive accept that their partner watching porn is not something to worry or feel hurt/ insecure about?", "subreddit": "BodyAcceptance"}
{"post_id": "bmkypo", "created_utc": 1557414657, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bmlvsz", "created_utc": 1557419330, "title": "Curve-less", "author": "natalie098", "self_text": "So it seems as if men are interested only in women with curves and a full figure. I’m dying to have that. I feel like my boyfriend would much rather be with someone who has big breasts and a big butt than me. It makes me feel undesirable and like i’m disappointing him. I just want to be able to love my body despite the fact that I have a chubby stomach and not much else. All I want is personal self-love and acceptance :)", "subreddit": "BodyAcceptance"}
{"post_id": "bmthvh", "created_utc": 1557459797, "title": "Victoria’s Secret", "author": "cruisinandconfusin", "self_text": "I got my first bra at Victoria’s Secret, I’ve been shopping there for years. But these last few years it’s come to my attention that they don’t cater to plus size or have very inclusive sizing at all. My best friend has stopped shopping there because they do not represent, advertise, or cater to her body type. And honestly, not mine either. I  am done shopping there,and wanted suggestions on were else to shop for some quality lingerie", "subreddit": "BodyAcceptance"}
{"post_id": "bmzhxm", "created_utc": 1557501235, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bn2hh1", "created_utc": 1557515871, "title": "I feel like all my problems would go away if I had bigger boobs", "author": "somethingfunidk", "self_text": "I hate my boobs. I've always hated my boobs. Or more correctly, lack of them. I have convinced myself that just IF I had big boobs all my other complexes would go away. \n\nThey are both too hangy and too firm at the same time. Too small to make me satisfied with my body, but too large to fit good in clothes.\n\nMy bra size is 75G, so my logic side knows that they probably are big. It just seems that people who have even 75C has much larger boobs than me. I ask my boyfriend every day if he is satisfied with them, and he always says that he loves them. But not a single hour goes by without me wishing them to be bigger", "subreddit": "BodyAcceptance"}
{"post_id": "bnd2fc", "created_utc": 1557587394, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bnmyeq", "created_utc": 1557651011, "title": "One of the worst things about being short is how you have to always be careful about talking about it or you will be labeled as someone with Napoleans complex", "author": "[deleted]", "self_text": "I'm about 5 ft 7 to 5 ft8 and while that isn't too short it's still slightly below average where I live. I feel like there are very few places to truly be able to talk about being short as a dude. Many people think it's okay to deride someone for talking about and god forbid you ever say that being short has had a negative impact on your life. Even small spaces like r/short are frequently accused of being bad people for talking about how their height has hurt them. It just sucks how it's acceptable to deride and ridicule someone for talking about a physical characteristic that has negatively impacted their life. And people constantly bring up famous figures to try and prove that height doesn't matter but the truth is many actors in Hollywood wear lifts and movies frequently make actors appear around the same height and try to avoid height discrepancies (this is especially true in superhero films). I hope society not only allows short guys to talk about their issues but starts to accept them.", "subreddit": "BodyAcceptance"}
{"post_id": "bnq39a", "created_utc": 1557674580, "title": "I hate my stomach, my body, myself(ED TW)", "author": "dievybe", "self_text": "I will turn 18 in a few weeks, im 175cm and 57-58kg... I have an ED and had one from when i was 13, I went from 74kg to 54 and now i gained as well... i try to eat under 1k calories,  i feel like to be pretty i need to be 54-56kg. but at the same time i want to just be happy and eat, i want to love myself. I want to be happy at any weight..  but i am terrified of it, of eating. I dont know what to do. Whenever i eat anything my stomach expands, even eating a banana or oatmeal makes my stomach look so chubby, it starts spilling out of my pants, at the end of the day i am pregnant. I never see anything like this happening to others. I feel hideous because of it.  At the start of the day my waist is 64cm, at the evening its probably close to 70, i go from hourglass to a square. I hate having proper fitting tops on in front of other people or naked next to my boyfriend especially. I always have to flex my stomach... i feel like he deserves someone pretty, someone skinny, someone with long hair and someone without an underbite... my mom just tells me to flex it always and it will become a habit? Idk if thats true? Docs didnt find anything, im lactose intolerant, i never eat it though. I just want to cry whenever i look at myself, i hate even looking at my instagram and i feel ashamed that i have kinda a lot(for a boring,basic girl) followers... i feel so unworthy of everything, i feel like im lying to everyone there. do you guys have any advise on how to stop digging into myself so much? How to logically stop obsessing over things like this? I feel so dumb writing this but I’m really really lost...", "subreddit": "BodyAcceptance"}
{"post_id": "bnslby", "created_utc": 1557687343, "title": "Debilitating social anxiety and body acceptance", "author": "theDuckandtheChick", "self_text": "I have to wonder if my social anxiety would tamp down if I were happy with my looks. I have keratosis pilaris on my arms and legs. I’m overweight, and worst of all, I’m losing my hair from the hairline—and I’m a woman. I’m approaching 40, I have pretty much no friends, and I don’t work or interact with anyone. I leave the house maybe every 6 weeks. I’m terrified of being judged on my appearance. I get so nervous when I try to hang out with my one friend at functions she’s invited me to that I end up crying in my car and going back home.\n\nEverything I see online is people ripping women to shreds based on their looks. How can I ever live a normal life?", "subreddit": "BodyAcceptance"}
{"post_id": "bnx5ix", "created_utc": 1557712489, "title": "high school sucks :(", "author": "eclipseseok", "self_text": "i’m a teenager, 14 years old and a freshman in high school. all throughout middle school and even fifth grade, people were telling me i just needed to appreciate my body and that nobody actually had the ideal body type that people on instagram have. \nevery girl at school seems to wear crop tops that show off their stomachs, and their stomachs are actually flat. i’ve tried working out, but it’s never been effective. i just really don’t know how to feel good about myself in this environment that is telling me to do the exact opposite. \ni’m about 5’1”- 5’2” ish and about 130 pounds, and i’m ashamed to tell anybody my weight. how do i even begin to love myself?", "subreddit": "BodyAcceptance"}
{"post_id": "bo1uc7", "created_utc": 1557744006, "title": "I'm so scared that I'm destroying my body", "author": "queer_artsy_kid", "self_text": "I've struggled with eating disorders since I was 11, and developing severe anorexia that early in life stunted my growth to the point where I ended up losing an inch. I'm 20 now but I'm small and frail and my whole life I thought that getting to this point would make me happy but I'm not. I fucking hate it because I finally realize the amount of irreparable damage I'm doing to my body. I bruise extremely easily, so my legs are covered in bruises and my bones and my joints hurt and I've been losing a lot more hair than usual when I shower. I used to not care about the long term effects of my disordered eating because I figured that I'd probably end up killing myself before I turned 25. But since I started getting actual help and been able to go to DBT, for the first time in my life I don't want to die I actually want to live, and for as long as I can. This meant that I needed my body to last a lot longer than 5 more years, which honestly terrified me because of the countless times my nutritionist told how important your early 20's are for your final stages of growth and development which ultimately impacts your heath throughout the rest of your life. I feel like I've cheated myself out of being the strongest version of myself, instead I'm a frail and weaker version of myself who'll now have to deal with way more health problems later on in life because I starved my body for so long that I don't even know how to eat normally, I feel so pathetic. Restrictive eating has even become a go to coping mechanism for me to feel more in control of my life, whenever things are getting too stressful. This is a very hard cycle to break and I just feel overwhelmed with it all.", "subreddit": "BodyAcceptance"}
{"post_id": "bo4fdo", "created_utc": 1557759008, "title": "MetaMonday: Complaints, Questions, Conversation", "author": "maybesaydie", "self_text": "Use this opportunity to ask questions you may have for the mods or just converse among yourselves.\n\nWe are looking for mods from Asia, Australia, New Zealand and Hawaii. Weekend availability important. Community membership is required. If you're interested send us a modmail message.\n\nSelfie Sticky arrives on Monday May 27, so get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "bo7r97", "created_utc": 1557774670, "title": "Scared to be me", "author": "contributingquietly", "self_text": "I’m really struggling to come to terms with my body. I’ve recently gained around 1.5 stone (from stress) and am living in a city centre where I don’t really feel safe. \n\nI am okay with my body, but don’t weigh myself. I went to the doctors today and they made me and now I just am so self conscious. I can’t stop feeling like I’m hideous and don’t know how I got this way, I am starving but can’t bring myself to eat. \n\nI’m really just stuck - any tips for accepting being a bit chubby rather than falling into unhealthy patterns of trying to throw up food/ not eating at all?", "subreddit": "BodyAcceptance"}
{"post_id": "bo9zjo", "created_utc": 1557785097, "title": "Malls are unhealthy places for people with low self esteem", "author": "maddiokii", "self_text": "The changeroom is like my worst enemy. I have so many flaws and not small itty bitty ones. But big ugly ones. And they don't just stop me from feeling sexy and my age they stop me from being able to do things. 💔 I just wished a car would hit me after leaving the mall.", "subreddit": "BodyAcceptance"}
{"post_id": "bocbid", "created_utc": 1557797450, "title": "Question", "author": "minecraftgamecool", "self_text": "i made this account just for the purpose of asking kind of private things, with full privacy. so that’s what’s with the username\n\ni would love to love my body, but i just can’t seem to find a reason to. no matter how much people try to tell me that weight doesn’t matter, looks don’t matter, it’s about the inside, it just goes through my head and out my ear. because, everyone, yes you, even if by a bit, definitely takes looks into factor of attractiveness. everyday i see boys with abs, muscles, and perfect faces. i have flabs, no muscles, and a lack of eyebrows, almost to the extent of no eyebrows. i started using eyebrow pencils and other things to combat that insecurity, but it was met with being called homophobic names (i’m straight). plus, i’m below average in “length.” everyone else i know is above me, and if just makes me wonder, for all the reasons listed above, why i should love my body.", "subreddit": "BodyAcceptance"}
{"post_id": "bodvo3", "created_utc": 1557806616, "title": "Tips to appreciate my body (especially my boobs)", "author": "musical_fanatic", "self_text": "Everyone around me is \"filled out\" and \"thick\" meanwhile I'm still skinny, small and thin. My bra size is 32A l. I've been the same weight (80 to 85 lbs.) for years and even my best friends has a better bodiea than me (she just keeps gaining weight...)\n\nI want to start to appreciate my body more, especially with summer around the corner.\n\nAny tips?\n\n(Also posted to r/smallbooblove)", "subreddit": "BodyAcceptance"}
{"post_id": "boin2c", "created_utc": 1557838914, "title": "Thank you for being a great support system", "author": "theDuckandtheChick", "self_text": "I just want to say, I’ve only just started posting here and this is the kindest, most supportive, most helpful sub I’ve visited on Reddit. Thank you so much. I wish I had friends like you IRL. *hugs*", "subreddit": "BodyAcceptance"}
{"post_id": "boipen", "created_utc": 1557839274, "title": "Fatlogic is looking for a few good mods", "author": "GetOffMyLawn_", "self_text": "We are looking for some additional mods, preferably in in the Pacific-Asia time zones.\n\nMod duties will include \n\n- Reviewing the Unmoderated Queue and Approving or Removing posts.\n- Reviewing the Modqueue and responding to reports and Automoderator actions. Both of these queues need to be checked multiple times a day.\n- We expect that you will install the r/Toolbox extension to perform these duties. We have customized Toolbox for our sub.\n- Responding to Modmail.\n- Communicating with the rest of the mod team as necessary either via Slack or Modmail.\n- Familiarity with Automoderator configuration or CSS is a plus but not a requirement.\n- Experience is not necessary, we have a wiki that describes mod duties in detail.\n\nIf you're interested please fill out and submit an [Application form](https://forms.gle/RLfgC3WRK7nRYGqz8) to be considered.", "subreddit": "fatlogic"}
{"post_id": "bok5k1", "created_utc": 1557846667, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "boz4gq", "created_utc": 1557933113, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "boz8bl", "created_utc": 1557933631, "title": "I was able to see my body as beautiful for the first time ever", "author": "sabaping", "self_text": "Small tw for talk of an eating disorder\n\nI've had self confidence issues quite literally for as long as I remember. 7 years old is the youngest age I can remember thinking that no one will ever love me because I'm fat and ugly. \nI made myself throw up for the first time in 7th grade after having spaghetti at my grandma's house. This only went on for a week, but it made me addicted to disordered eating and behaviors. I was constantly looking up pro-ana \"\"diets\"\" and such, but my attempts always failed. \nThen last year, after graduating from high school, I started cutting out foods. First red meats, then soda, then cutting down on bread and such. Swearing off fries and candy. This escalated into me starting the \"IU diet\" in august.(small fact, IU actually had/has an eating disorder, self admitted, so this diet is literally what a woman going through hell ate daily) Since then, I have been deep in an eating disorder. I've spent the last 9-10 months restricting to extremely low amounts of calories and purging often. \nI know I didn't have the most drastic weight loss, and I haven't been battling an active eating disorder for years like others. But today I was able to look myself in the mirror, naked, and think, \"There is my body. And I think it looks amazing.\" I truly felt that I had a wonderful, nice, beautiful body. This is the first time I have thought this in my entire life. Never once as a kid did I have any ounce of confidence. And that makes me insanely happy. \nI'm still not ready to recover or stop restricting, but baby steps. Although, this baby step feels GIANT.", "subreddit": "BodyAcceptance"}
{"post_id": "bpdqn2", "created_utc": 1558019473, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bpk7bx", "created_utc": 1558051847, "title": "I hate my body despite being “skinny”", "author": "tinycurlie", "self_text": "When it comes to this topic, people never understand or believe me, they end up attacking me saying “it’s not a real issue”, but to me it is very real. \n\nI am naturally very skinny, no eating disorders or anything. I’v heard so many negative comments about my body, I hate it now. I was called anorexic, unattractive, unpleasant to look at, not curvy enough.... I am also constantly pressured to eat more, even when I’m obviously full and can’t keep going. \n\nPeople say I should not complain since i’m skinny, but the comments I hear made me hate my body and what I am. Gaining weight is a struggle for me. I wish it was as easy as people think.", "subreddit": "BodyAcceptance"}
{"post_id": "bproox", "created_utc": 1558101931, "title": "Really dislike my body. It’s so abnormal", "author": "cool_bananaa", "self_text": "I’m 6 ft talk but I carry weight in my arms and tummy and have kinda broad shoulders and upper body but narrow hips and no waist. \nMy boobs are pointy and very small and I have big areola which makes them look even weirder. My bum literally looks like my back,it’s so flat and it’s very square from the back and I have pretty big hip dips. \nIv been doing weights for over two years now and have been working on trying to grow my glutes but they just don’t change size no matter how hard I work out and how heavy I lift Or how many bulks I do the weight never ever goes to my hips or bum. My mum has a pancake bum too so it must be genetics. \n\nThe thing I find so hard about this is that I’m trying my hardest to change my bum and working out to try and improve it but it’s just not working and it kills me! It’s not like I’m sitting around wishing I had a perky bum and not doing anything about it, I’m actually actively trying to improve myself but it’s just not working. \nThe only way I will be able to change it is with surgery and I don’t have the money for that atm. I just can’t deal with looking like this, it makes me want to kill myself, I don’t know what to do :( \nDoes anyone else struggle with a flat ass and square hips? I feel so abnormal cause so many women I see in public and online don’t look like me and most have some sort of an ass and hips.", "subreddit": "BodyAcceptance"}
{"post_id": "bpsi96", "created_utc": 1558106024, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bpu6o3", "created_utc": 1558114304, "title": "Everyone in my family has curves except for me.", "author": "roseauraqz", "self_text": "I really want to learn how to accept my body. Everyone in my family gains weight on their hips and thighs, and they have a small waist and wide round hips with almost no hip dips and heart-shaped butts, except for me. I am an inverted triangle, with no waist, narrow hips, and 20-inch shoulders despite being just 15, and 5’4. At least if I was tall like the rest of my family, everything would be more stretched out and look more proportionate, but I look short and stout because of my shape. My 14-year-old sister is 5’10, my mom is 5’11. All of my cousins are 5’7 to 5’10 also. I gain all of my weight on my tummy so I look 3 months pregnant all the time while having super skinny lower legs and naturally muscular thighs, despite being extremely sedentary. My 36DD boobs paired with my shoulders give me a V shape, which is the opposite of what I want. I look like a man, while everyone else in my family has beautiful curves. How can I accept my body when I’m the only person in my family without a nice one? Please help!", "subreddit": "BodyAcceptance"}
{"post_id": "bq4zli", "created_utc": 1558192193, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bqmqqy", "created_utc": 1558303432, "title": "Disgusting", "author": "lizah206", "self_text": "My family consists of 3 average sized people.  My sister recently told me it disgusts her to watch me eat. My mother and sister will both remove food from my hand and plate and throw it in the garbage.  I get that they are being helpful since i am obese, but why does it hurt so much.", "subreddit": "BodyAcceptance"}
{"post_id": "bqnnpc", "created_utc": 1558308449, "title": "I love my body, but i can't believe someone else could", "author": "fixrella", "self_text": "Anyone else feels like this? Is really contradictory and makes me feel great a moment and disgusting the next. \n\nI don't think there's a lot more of clarification for this except to add some context. I'm 19 and I've struggled with my appearance a lot. I either look at my body in the mirror and love what i see and touch or undress looking at the floor before showering because i feel like i might cry if i catch a glimpse of myself. It's really exhausting.\n\nBut even when I'm feeling great about myself there's a little voice in my head that tells me how long I've struggled to feel this good and that no one else feels like that. It's hard to explain, but sometimes I feel like the (positive) perception of myself is completely fabricated in a effort to feel okay. \n\nThis makes me incredibly insecure in everything I do and makes me question people's attitudes with me. For example, if i feel like someone likes me (and even more if I do something about it, like talk to them), the next day I'll \"scold\" myself for being delusional. But again, at the same time i kind of like how i look? As i said, contradictory as hell.", "subreddit": "BodyAcceptance"}
{"post_id": "bqvu1z", "created_utc": 1558360530, "title": "Ongoing stress with appearance, I dislike my stomach so much ! I just want peace with my body", "author": "Foxwood2212", "self_text": "I have an growing hate for my body appearance, it has always been there since I was old enough to compare myself.. maybe 10 or 11, I fear it won’t go away ever.\n\nThe trouble is outwardly I am tall and have the illusion of being thin with clothes on. So when I complain everybody is like shut up you could model, and invalidate my feelings and worries.\n\nBut they don’t see that I am skinny fat, my stomach sticks out especially after eating and my belly looks ugly. \nI just want to flaunt my stomach occasionally like other girls do but I hate that I am not thin enough and don’t have an elongated belly button? Mine seems to be hooded making me look fatter. \nIf that makes sense probably doesn’t. \n\nI have attempted modelling twice just to try it out. Each time I wasn’t good enough and was dropped. \n\nI have been told to slim down which I couldn’t as I have naturally large hips (38 inches is the smallest I can go) and waist can be 25 if I go on a bare minimum diet.  And all these models fit in size 8 I really just can’t. That and I am not as photogenic as they thought sad but lol.\n\nSo there’s a voice in my head telling me I should go back to being this thin , as right now I am not on a diet. \nI just want to live!\n\nNot worrying about what I eat every meal and to not feel guilty because I’m not exercising or restricting myself in any way. But as soon as relax I look myself in the mirror and see that I have ballooned and see a bloated not very summer ready body ! It’s a cycle.\n\nI have an upcoming holiday with uni friends and I am fearing they will all be wearing bikinis and I want to but I can’t I have never done so because my body is an embarrassment. \n\nAlso I always have dark arm pits for some reason so can’t flap my arms about too much...\nI just find it so hard to live myself when so much needs fixing. \nAnd these things don’t seem to be issues for entertainers I see in the media or anyone else, everyone has it good, flawless.\nIt is all so petty ! over thinking my problems till I’m sick but it’s really affecting my happiness and confidence, I can’t stop thinking about it. \nI am on the waiting list for body issues and eating disorders since that has been in my life.  \n\nI just want to know if anyone else struggles: how are you trying to overcome your obsession.", "subreddit": "BodyImage"}
{"post_id": "bqwr7o", "created_utc": 1558365008, "title": "Meta Monday", "author": "GetOffMyLawn_", "self_text": "Next Monday will be Selfie Monday! So get ready to post your pics.\n\nToday is the usual Meta Monday, so rants, raves, pet pics, questions, whatever. Have a good one.", "subreddit": "fatlogic"}
{"post_id": "br19n2", "created_utc": 1558386012, "title": "Quick little bedtime note y’all", "author": "CadaverCrossing", "self_text": "Just wanted to remind every single person here, whoever might be reading this, that **you** are deserving. You deserve love. You deserve happiness. You deserve life. You deserve everything good thing imaginable. You are strong and you deserve to be accepted for who you are, how you look, and how you choose to live.\nHave a good night, y’all :)", "subreddit": "BodyAcceptance"}
{"post_id": "br6t96", "created_utc": 1558419056, "title": "How do I get over this extreme insecurity?", "author": "lailamajnu617", "self_text": "Hey guys, I’m at a point where I can’t even watch TV anymore, I can’t enjoy things people normally do. The idea of going to movie with a boyfriend terrifies me. I’m insecure about my body but even more insecure about my face. My ex boyfriend once told me I’m jealous of celebrities ( when all I said was “can we talk about something else?” ) which made me feel like he thinks they’re better than me. I know it’s my insecurities and not his fault but I just wanted to give some context. Btw, I’m sure I’m still in love with him and we’re actually on good terms, but I’ll never forget what he said to me unfortunately. It’s been four years and every time I see a celebrity, that comes to mind. And we are constantly surrounded by celebrity culture so I know I can’t even ignore this. I deleted my instagram account but I’m already homeschooling and don’t have a social life. So I do want to get back on insta, does anyone have any clue how I could be more normal and less insecure about myself ?:/", "subreddit": "BodyAcceptance"}
{"post_id": "br97f2", "created_utc": 1558437937, "title": "Art Show for Fat People not Advertised Well Enough Because of Fatphobia", "author": "7i1i2i6", "self_text": "Body Positive Drama https://imgur.com/gallery/qmAU2Pb", "subreddit": "fatlogic"}
{"post_id": "brbkcu", "created_utc": 1558451430, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "brettr", "created_utc": 1558467443, "title": "Anyone diagnosed with BDD?", "author": "[deleted]", "self_text": "I was diagnosed after starting therapy after having my third child. I do weekly therapy and I’m working on some baby steps my therapist recommended to help me accept my body. I have severe scoliosis (had spine surgery) and so my body is disproportionately squat (I basically have no waist, my spine/torso didn’t grow post surgery). Has anything helped you besides therapy? Supplements, etc for anxiety? I know about medication but trying to hold off on that.", "subreddit": "BodyAcceptance"}
{"post_id": "brfw64", "created_utc": 1558472703, "title": "Does anyone else feel that changing room mirrors are just the worst?", "author": "universallyglo", "self_text": "I’ve been feeling good about my body for a while now. I’m curvy, have stretch marks and cellulite, my thighs jiggle a lot, and I have come to appreciate all of that. I even suggested to my friends that our next holiday be a beach one, so I can take the next step of unapologetically wearing a 2-piece in public.\n\nBut today, I stepped into the changing room. I pulled down my trousers and my god, the feeling I had, looking in the mirror, was overwhelming. I don’t know what it is about changing room mirrors that makes everything so *vivid*. Maybe the lights are brighter, or the are mirrors cleaner, I don’t know. But in that moment, I saw ‘imperfections’, everywhere. I am not going to go into detail, but what I saw in my reflection, particularly of my legs, was grotesque. A lot worse than I ever thought they looked like in my mirror at home. I wanted to cry. I felt myself transitioning back to hating myself. In that moment, I saw a monster. And I know my brain is playing tricks on me. I know the hatred I have for my body is due to the false societal beauty standard we have been conditioned to believe in. But that feeling in the changing room today was so intense. So overwhelming.\n\nI came home and cried and cried. I just couldn’t stop crying. Everything I had learnt, every part of my body I had grown to love over my body-positivity journey, was gone, just like that. I was back to hating myself. I was back to wanting to starve myself. I haven’t been on a diet for 6 months - 6 whole months of nourishing and looking after my body. But today I told myself I am not allowed to eat. For the rest of the day I didn’t eat anything. I’m starving. I’m doing my finals rn and I have so much studying to catch up on, but right now I can’t because I’m starving and dizzy. At this moment, I’d rather be skinny a month down the line than pass my exams.\n\nAnd this holiday I planned with my friends? I’m going to tell them I can’t go. I’m going to tell them I don’t have the money, or I’m just too busy to go. I just don’t think it’s fair to subject the people on that beach to look at my grotesque body. And I know that feeling of self-consciousness will be intensely awful. I’d rather stay in the comfort of my own home.\n\nIn the space of a day I’ve fallen right back into my old habits. The hatred I had for myself before my bopo journey is back in full force. I feel so lost. I feel hurt, both physically and mentally. All of this because I decided to step into a brightly lit changing room today. I don’t know what to do. The only thing I *know how* to do is not eat.\n\n\nEDIT: Thank you so much for the responses guys. They really helped to reassure me. It’s bittersweet because it sucks that we’re all made to feel like shit in the changing room, but it’s nice that so many people feel the same, meaning it is probably the fault of the changing room and not us 💕💕", "subreddit": "BodyAcceptance"}
{"post_id": "brge16", "created_utc": 1558475216, "title": "Born with Extra Nipples", "author": "WVJeepee", "self_text": "I’m a 23 year old guy that was born with 2 extra nipples right below the usual 2. They are smaller in size (about the size of a pea) and are symmetrical with each other. I know it’s not uncommon, but I can’t come to accept them. \n\nI won’t take my shirt off infront of anyone, besides my girlfriend. The thought of being in public without a shirt on just gives me the heeby jeebies. \n\nMy girlfriends family and I are taking a week long beach vacation here shortly, and I’m about to the point where I don’t care about hiding them anymore. It gets tiresome and I dwell on it worse. \n\nShould this be something I’m ashamed of, or should I just let it go?? I’ve talked to my dermatologist about getting them removed, and she said that there would be a scar left over if I did. \n\nAny help, insight, or opinions about this would be appreciated!!!\n\nThanks!", "subreddit": "BodyAcceptance"}
{"post_id": "bri70e", "created_utc": 1558485618, "title": "Mom won't stop commenting on my weight", "author": "AnAnnoyingcoconut", "self_text": "I'm 16 and my mom won't stop commenting on my weight. Really no one else comments on my weight, but my mom keeps on doing so and it really frustrates me. I can't just live my life without being bombarded with how fat I am and how I need to lose weight. She just does it so casually and it really hurts. Like sometimes I would be in my room studying or doing something and she would come in and touch my stomach and tell me that it's getting big and that I need to lose weight. And sometimes she would say something like \"do you really want to go out like that during the summer? You would be alot prettier if you lost weight.\" What's worse is that once I went to the doctor(not related to weight. It was because I have asthma) and during the check up the doctor asked me to step on the scale and he said that my weight is ideal for my weight and height. But my mother was there and responded with \"no she needs to lose weight.\" I also remember that once I went to ask my mom if I was fat and she said \"yes have you seen how huge your thighs are?\" It's really frustrating. I can't breathe without my mom commenting on my weight although I'm perfectly healthy and I think that I look fine. But my mom constantly telling me that i look bad is just really starting to get me.", "subreddit": "BodyAcceptance"}
{"post_id": "brj3bl", "created_utc": 1558491066, "title": "Decreased sex drive", "author": "Background_Cheetah", "self_text": "Does anyone else feel when their image issues spike it damages their sex drive? It used to be much higher but now it's almost nonexistent. I'm super lucky to have a partner who doesn't hold that against me or judge me for it.", "subreddit": "BodyAcceptance"}
{"post_id": "bro1jq", "created_utc": 1558527250, "title": "My friends are dieting and I feel guilty for not joining.", "author": "mcwychbitch", "self_text": "So I tried many diets, ended in bad mental health, so I stopped dieting and tried to accept myself.\n\n&amp;#x200B;\n\nMy best friends go to a diet club, and one text me saying that they had gained weight and were really upset. I comforted them cause I'm a fucking doormat, and I said I would try not to lecture them about diet culture. They responded saying they would appreciate if I didn't because they felt very vulnerable after gaining. They then went back to the class and won an award for losing the most weight, or whatever the fuck, and now I'm like 'Oh so YOU'RE vulnerable, GOD your life is so HARD!'\n\n&amp;#x200B;\n\nIt made me think how I feel vulnerable all of the time, but still encourage them to talk about their recipes and weight loss, because they are excited about it! It honestly felt like a fucking slap in the face. So now I'm sitting at work getting emotional thinking about how maybe if I miss dinner tonight then I'll feel better, because I don't deserve to eat becuase I'm a chubby bitch.\n\n&amp;#x200B;\n\nI constantly feel vulnerable, I guilt myself constantly about not trying to get thinner. And I thought I could at least rely on my friends. I just need a rant, feel free to join in.", "subreddit": "BodyAcceptance"}
{"post_id": "brpp71", "created_utc": 1558536560, "title": "New body image/acceptance project on Instagram called \"Vitruvian Women\" with daily stories and portraits (link in description)", "author": "aandthe", "self_text": "This new project, Vitruvian Women, highlights the many shapes, sizes and proportions of the female form. This includes women of different ages, ethnicity, skin tones, and physique. Underneath each print is a statement from the woman about the image - her thoughts about that part of her body, the changes that have occurred, her struggle, her acceptance, or other body image/positivity message or story. The purpose is to give voice to these women, provide a platform for these stories, and encourage social engagement. https://www.instagram.com/reveal_mission/", "subreddit": "BodyAcceptance"}
{"post_id": "brpysc", "created_utc": 1558537918, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "brt9tr", "created_utc": 1558554470, "title": "I have 2 things I don't like about my body and they're pretty glaring", "author": "peepocho", "self_text": "My straight waist (and I get badly bloated most days). I would look like a regular girl if I didn't look as weirdly Frankensteined together as I do. I have broad shoulders and a straight waist (when most girls have a waist). It looks like a bigger person is growing out of a smaller person and I barely hear about anyone else having this body type, making me feel alienated.\n\nI recently gained weight too", "subreddit": "BodyAcceptance"}
{"post_id": "brv974", "created_utc": 1558564380, "title": "I still feel slightly fat", "author": "ARandomHamiltonFan01", "self_text": "I'm slightly underweight at 107 pounds for 5'4, 18 years old (F) and I don't want to loose weight,(maybe just a few pounds though). I started a low carb diet 5 months ago and it helped me to lose some of my skinny fat in my belly. (i don't exercise often due to frequently being injured so I rely on diet). I'm still not satisfied with how my stomach looks, but I can finally tolerate it. another thing is that my lower calves are fat, in other words, I have cankles. Even when I was a runner I still had fat ankles. It may be due to my genetics, but I still hate how my an les look. I see girls who weigh more than me and they have slimmer calves than I do. back in my cross country days, I always felt ashamed seeing all the other girls with their nice calves and skinny runner ankles while my ankles were chubby despite me running the same amount as them and being underweight. I had worse body image problems then so I restricted to 1800 calories while running 5-6 miles a day. Now I recovered for the most part and eat 1600-1700 calories with a sedentary/low impact exercise lifestyle. I just still can't get over how my calves look fat, I really want slimmer ankles.", "subreddit": "BodyImage"}
{"post_id": "bs44dg", "created_utc": 1558624237, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bsb7by", "created_utc": 1558662805, "title": "Mom still comments on my body hair (24F). Not sure how to respond.", "author": "miphyspice", "self_text": "Called my mum for her birthday. She told me to not forget to shave my legs. Asked her why she was telling me this. She said so that I would remember. I said it was not her business. Then we ended the call and I cried. I know it’s her thoughts and words, but they still hurt. How would y’all respond?", "subreddit": "BodyAcceptance"}
{"post_id": "bsc8t8", "created_utc": 1558669539, "title": "Accident", "author": "maddiokii", "self_text": "Anyone here had an accident that left their body damaged/deformed? Did you ever recover from the accident/injuries?", "subreddit": "BodyAcceptance"}
{"post_id": "bsga0z", "created_utc": 1558700650, "title": "Body Acceptance/Body Positivity research seeking participants", "author": "Mirandy-42", "self_text": " Hello /r/BodyAcceptance! I have a few questions to ask,  \n\nDo you regularly use this subreddit or other online Body Acceptance/Positivity Communities?  \n\nWould you like to see increased awareness of Body Positive Ideas? \n\nWould you like to contribute to research into Body Positivity?  \n\nAre you a woman aged over 18?  \n\nDo you live in the UK (especially the South East of England)?  \n\nIf you answered yes to these questions, then I would really like to hear from you! \n\nAt the moment there is little research looking at the psychological impact of Body Positivity and the online communities where the ideas are promoted. I want to change this!  \n\nAs part of my training as a Clinical Psychologist I am running a Doctoral research project and interviewing people like you about their experiences within online Body Positivity communities. This project will delve into what you are taking from the ideas and the community, and lay the foundations for this to be used in future psychological research and clinical practice.  \n\nI hope this sparks your interest!  \n\nIf you are interested in taking part please contact me, Miranda Samuelson, at [m.a.samuelson987@canterbury.ac.uk](mailto:m.a.samuelson987@canterbury.ac.uk) for further information.", "subreddit": "BodyAcceptance"}
{"post_id": "bshuaz", "created_utc": 1558709448, "title": "One inverted nipple", "author": "idccccccc", "self_text": "I have one inverted nipple and this bothers me a lot.  Does anyone else have this? What do you do?", "subreddit": "BodyAcceptance"}
{"post_id": "bsi3z7", "created_utc": 1558710826, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bsjv7z", "created_utc": 1558719760, "title": "Feeling insecure again...", "author": "blemishedcucumber", "self_text": "I have times where my self esteem is worse than others &amp; right now it's not good again.\n\nI'm feeling insecure about my breasts, I feel like since they are smaller I'm not much of a \"woman\". I know this isn't true, because I see women with smaller breasts and still think of then as a lady, but to me I feel insecure about it because I would prefer to have bigger breasts (and symmetrical breasts too). I feel like my proportions are are off since I have smaller boobs, I feel like my shoulders are a bit broad, but idk for sure about that and my hips and thighs are bigger. I also have stupid hip dips so fuck me right?! Haha. I just feel like a mess of a body today...", "subreddit": "BodyAcceptance"}
{"post_id": "bsn7xw", "created_utc": 1558736790, "title": "I am insecure to a ridiculous, painful degree. I don't know what to do.", "author": "enough-throwaways", "self_text": "Let me give you guys some background. I never really struggled much with physical insecurity before. I recognised features of me that were subpar, but just sent them to the back of my head. This does not mean I viewed myself as gorgeous or anything, but I did think I was decently good-looking. Anyway, I didn't really think about it much.\n\nI have turned 17 this year, and perhaps this is why this has begun... but I've faced how ugly I am. Or how I perceive myself to be. I don't know. But my perception is my reality right now. And it happened all at once in the beginning -- I stared at the mirror and tallied up every single thing that was wrong. It was a fresh, unique kind of sting and hurt. Because I wasn't just sad that I was ugly. I was sad that I wasn't as pretty as other girls are, I was sad that my personality wasn't as well-interpreted as it could be because of the subconscious impression we *all* make of people based upon their looks. I was sad and horrified and embarrassed that I look like I try too hard. I love showy clothes, and when there's an event, I love going all out with dresses, makeup and heels. And I was sad that I looked like a clown trying to fit in.\n\nIt is very difficult for me to full convey the degree and nature of my insecurity – partly because it is extremely nuanced, and partly because it is composed of so many thoughts, feelings, behaviours and experiences that I cannot describe all of them in one post.\n\nBut what I really want to ask for help in is this. I've gotten to a point that when I see a pretty girl, I feel really jealous and sad. I remember all my shortcomings, I remember all the things I mentioned above and more. It cuts into me. And I stay sad and jealous and insecure and weighed down all day. Today was such a day. It's been hours since I saw that girl (and of course, my eyes scanned to every other girl, and I managed to find so much that was better in them than in me). And it's just fucking pathetic. Jealousy, envy and insecurity are really ugly features. They're horrible. They are the hallmark of low self esteem. And I really want to stop feeling that way. I can't cry whenever I see someone prettier than me. I can't do this. And I don't know how to stop. I'm trying to distract myself and focus on other things – I've been studying a lot (and yet, I saw that girl in my goddamn exam hall). I'm trying to better myself physically – eat healthy, go to the gym, take care of skin and my hair – and tell myself I'm trying to achieve the best version of myself which I can given my genetics right now. It's not working. Or it does for a while, and then I see someone and let it shatter me. I think also, the second way of trying to better myself isn't going well because I'm finding it really hard. I fall off the bandwagon a lot in all of those things because I'm in the middle of exams. I also used to fall off the tracks when I wasn't in the middle of exams, but I'm trying to better my discipline. I just find all of those things so hard. And I guess if I'm not doing them well enough, I have no right to complain. I don't know. I feel pathetic for finding basic self care things so taxing.\n\nSo... yeah. Maybe someone relates, or has some advice. I don't know. Thank you for reading.", "subreddit": "BodyAcceptance"}
{"post_id": "bsrdaj", "created_utc": 1558764852, "title": "I HATE my boobs", "author": "bye_bye_love", "self_text": "I’ve always had body confidence issues, but my main point of self consciousness is my breasts. Ever since I was around 14/15 I noticed my boobs weren’t perky, and my areolas are a lot bigger than most. Now I’m 18 and my breast are around a D/DD but I hate them and they leave me SO self conscious, they seem so saggy to me and I don’t like going braless in public or even wearing certain bathing suits. I’m scared to show anyone, or if I’m ever intimidate with a guy. I’m scared he’ll think they’re extremely unattractive and that would kill me, I’m also not confident with my lower area. Getting surgery would not be plausible at the moment and I obviously don’t have money for it. I know I’m beautiful the way God made me and there’s MANY others like me, but how can I learn to love myself?", "subreddit": "BodyAcceptance"}
{"post_id": "bst24p", "created_utc": 1558780111, "title": "Why do people feel like they have the right to tell me I look gross?", "author": "sowachowski__", "self_text": "\nYou know, after some time without getting comments about my weight I was starting to think that maybe my body doesn't look THAT bad. And then yesterday at school this classmate comes up and randomly says:\n\"oh my god. You're so skinny. Look at your arms... You seriously need to eat more.\"\nI awkwardly brushed it off and wanted to die for the rest of the morning.\nIn the evening I had dinner with family friends. We were sitting on the couch and I was wearing earphones but I still heard this woman talking to my mom about me. \n\"Has she lost any weight? She looks skinnier than ever. Literally a skeleton.\"\nI just went to the bathroom and cried and then cried myself to sleep on the other couch because if I stayed awake any longer my sadness would turn to anger. It always does. I start by hating myself and then hating everyone that is around me.\nEverything was going so well, I even decided that maybe I should go to the beach this year. Fuck that, I'm not even going to wear shorts and t shirts. After school is over I'll just stay home until it begins again. and maybe eat until I almost puke to make people happy.", "subreddit": "BodyAcceptance"}
{"post_id": "bsvjf1", "created_utc": 1558797029, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bsx1if", "created_utc": 1558805000, "title": "Found my first stretch mark and it's freaked me out", "author": "megana25", "self_text": "I've always grown up super skinny, due to a bunch of things from fast metabolism to eventual eating disorder. I'm thankfully recovered from that, and never really cared how much I ate, as according to my bmi I was constantly underweight anyways. However in the past two months or so, I've started going to the gym and as an effect to that, eating more for strength. Except this morning, my boyfriend ended up finding stretch marks on my bum. This completely freaked me out because theyre the first I ever found on me and while I  understand that I've probably put up weight and gained muscle pretty quickly in the past two months, but I've been on edge all day over it. I guess growing up, all people would ever say to me is how skinny I am and I see stretch marks and even though I know they're nothing to be ashamed of, the only thing thats in my head is that I'm getting fat, im scared that people aren't going to look at me anymore and tell me how skinny I am but how I've put on weight. Has anyone else experienced this? Or have any advice on how to get myself out of this stupid mind set?", "subreddit": "BodyAcceptance"}
{"post_id": "bszzxa", "created_utc": 1558820433, "title": "So disgusting", "author": "[deleted]", "self_text": "God my body is horrible. Fucking trash. Unattractive. I just want to add scars and make it uglier. Might as well go the whole way. What a fucking hideous monstrosity. Shouldn’t be called a woman, or a human being. Fucking horrible. Disgusting. Fucking horrible trash. My face is so bad. Disfigured and unattractive. Ugly so ugly. Everything about me is ugly. No matter how much makeup or hair products or clothes I put on it cannot hide how fucking pitiful and vomit inducing piece of fucking shit I look.", "subreddit": "BodyImage"}
{"post_id": "bt4vuk", "created_utc": 1558853023, "title": "How do I love my body when I’m constantly surrounded by people who don’t? [20F]", "author": "throawhy", "self_text": "Lately I’ve been struggling with my body and accepting it for what it is. Summertime is my least favorite time of year because I usually prefer to cover up. Not only is my body weirdly shaped, but I’m very pale (Irish redhead), and I feel like I always look awful in comparison to my family. \n\nMy sisters inherited the body shape of my mother, and I look more like my father, who comes from a family of football players. I’ve seen my body at a range of weights, and have come to realize that there’s nothing I can really do about the unfortunate shape of my body. I have wide shoulders, a large rib cage, and narrow hips. Even at an above-ideal BMI, my individual ribs are visible. \n\nBoth of my sisters (one older, one younger) have a more or less ideal build. They are both athletic, have tight stomachs, muscular thighs, and have at least some skin pigmentation. In general, I try to avoid giving attention to people who have “ideal” bodies (in magazines, on Instagram, etc.), but it’s difficult to avoid giving attention to my own family. \n\nWhenever we take pictures, I feel like I stand out in a very negative way. I’ve tried talking about my insecurities with my mother, but all she suggests is losing weight or using tanning lotion. Whenever my sisters comment on how I look, it’s usually some form of backhanded compliment. \n\nAs much as I don’t want to care about how other people look in comparison to me, I do. I want advice on how to love myself, or even where to begin. I feel lost and like I have no one who understands my body and that I can’t do much to change it.", "subreddit": "BodyAcceptance"}
{"post_id": "bt9s30", "created_utc": 1558887498, "title": "One guy said it is my fault to be shorter than average", "author": "minisoya", "self_text": "I live in a country where men select tall women. \nHe said I could grow taller if I had done some exercises and had taken some growth pills. He said I have no right to complain about height and mens preference for tall women. How could he think like that? Height is %90 genetic. Enviriomental things effect but it can only make me reach my maximum height my genetics let. \n\nI should note that my father is 5'9\" and my mother is 5'6\". I have a sisted who's height is same as me. I slept well and eat good when I was teen.", "subreddit": "BodyAcceptance"}
{"post_id": "btcmcv", "created_utc": 1558901700, "title": "Feeling bad about my body shape", "author": "greeneyedpinguin", "self_text": "I'm 16 and I feel pretty insecure about my body shape - my skeleton is more of a square shape but I store fat mostly in my thighs, arms and back, which makes me really dislike the way I look. Especially since I'm short and every girl my height around me is skinnier, curvier or sometimes both. I know that I'm still a teen and my body can still change but the thing is that I am an early bloomer and I stopped growing at 11-12 years old, so I feel like I'll be stuck with this awkward body forever. \n\nAt the end I just wanted to say that I usually feel better about my body, tonight is just a bad day. Also, sorry for any mistakes, English is not my native language.", "subreddit": "BodyAcceptance"}
{"post_id": "btgnq2", "created_utc": 1558924765, "title": "10 years of me trying to accept myself...", "author": "Infinitexpo-end", "self_text": "Between all the shapes and sizes.. God chose this fucking mess to be me. \nI hate every single thing of myself. It's not that I want to hate me but everytime I try to overcome it and accept who I am I get bombarded by hurtful comments. Everytime I try to feel good about Myself people start showing me all the reasons  to feel bad.\nAnd having attractive parents makes everything worse.. People look at you as a disappointment, as a mistake, as a freak of nature.\nI always told myself that each person is so busy in himself to actually find time to criticise or care about other people's imperfections.. I can't believe how people find time to get out of their own way and just slap Me with their cruelty..\nMe a freak of nature. I have nothing good in me. I look dead. Im bones and skin.. my face is sunken, my eyes are hallow and my heart is empty.. I wish there could be one nice person who would lie to me. . Tell me that I'm pretty. \nMy own mother never says a thing .. my mother. My own mother doesn't think im good enough.. never said a nice thing to Me.. only after I cry and beg her to know what is so wrong with Me. \nI hate everything ..\nIm afraid to get out show my hideous figure to the world... \nIm so tired of crying every night before I sleep.. wishing I'll die . Im so tired of my life .. \nI want to live . I don't want to keep dwelling om how I look but whenever I try.. People pull me down .. down down ...\nIm 21.. I just want to.. accept who I am.", "subreddit": "BodyAcceptance"}
{"post_id": "btix4v", "created_utc": 1558940831, "title": "New Mentality has Helped", "author": "BetterThan40", "self_text": "I’ve recently been thinking and traveling and adventuring and meeting new people. And I’ve kind of come up with a few thoughts that help me out and thought I’d share:\n\n1. This is the only body I come in. I might not like it, hypothetical people might not like it, but I only come in one size and it’s what I’ve got right now in this moment. If you want more, check in tomorrow to see if anything’s changed but in the mean time, this is me and I don’t get anywhere imagining myself as “better.”\n\n2. This is the body I have when I feed my body what it wants and exercise how much it wants. I had a “better” body when I starved myself, I had a “better” body when I purged with exercise and vomiting, but that isn’t what I’m doing anymore. This is how my body looks when I say “fuck you, eating disorders” and even if I don’t like it every day, that’s something to be proud of. This body weighs more in pounds than I ever have but it’s also the first body I’ve had that says “I refuse to listen to the voice in my head.” And that makes it *better* than all the skinnier bodies I’ve had, even if the rest of the world can’t see it.", "subreddit": "BodyAcceptance"}
{"post_id": "btj87j", "created_utc": 1558943206, "title": "Invitation: new sub /r/MadAtWork is a community managing mental illness in the workplace", "author": "AltitudinousOne", "self_text": "Thanks to the mods of this sub for permission to post the following\n\n&amp;#x200B;\n\n/r/MadAtWork is a positive, forward-facing community for managing the challenges of mental illness at work. Focusing on strategies and sharing insider knowledge. May appeal to anyone with an interest in sharing lived experience managing workplace challenges with mental illness.\n\n&amp;#x200B;\n\nAs we are a very new sub, please post something to help us get started!\n\n&amp;#x200B;\n\nSome possible topic starter suggestions\n\n&amp;#x200B;\n\nDisclosing mental illness\n\nManaging managers\n\nGetting in on bad days\n\nDifficult workmates\n\nWorkload survival\n\nSpecific situations\n\nSelf-care\n\nManaging psychiatrists, doctors, and other support services\n\nWork/life balance", "subreddit": "BodyAcceptance"}
{"post_id": "btmfz1", "created_utc": 1558966456, "title": "It's Selfie Monday!", "author": "GetOffMyLawn_", "self_text": "You can submit your selfies here in this thread.", "subreddit": "fatlogic"}
{"post_id": "btnz83", "created_utc": 1558974337, "title": "My body haunts me everywhere I go", "author": "grvvygrl", "self_text": "TD;LR this post is basically a vent about me hating myself. \nI'm currently at a family gathering for my boyfriend and I'm crying in the bathroom over shorts. I feel so fucking disgusting. I hate my body and I have since I could comprehend any sort of body image, it's always been negative. It sucks being this terrible negative person who always ruins every single fun event bc my whole quality of life revolves around this shell I'm stuck in. I don't want to be here I don't want to eat or play games or laugh or do anything I want to cry and not have to look at me body. Summer is the worst time ever bc it's so hot and I want to be comfortable in my own skin buy every pair of short I own I hate. I hate all my clothes and I look terrible in anything. I'm so fucking top heavy and it makes me feel worse than any other person in the world, I mean who fucking wants a person who has all stomach and no ass or thighs. To top it off my boyfriend is mad bc I do this a lot, but it my defense that last time I got pissed at a family event was bc he was hiding/ deleting messages with any other girl. I'm so stressed out in stuck here all day and the only thing I can think of is smoking and sleeping the pain away. The only time my body isn't on my mind is when I'm sedated or asleep. I feel extremely suicidal. I keep going on off again on again diets and why just why can't I stick with one I wish I could eat like 0 calories a day bc at least then I'd know id be safe from gaining anymore weight. I know I'm rambling right now but I just can't go out there and fake a smile when I feel like I could tear out of my skin and start screaming and breaking down any second. I hate pretending to be happy, the stupid fake laugh and smile like I'm not debating on ending my life as we speak. I hate the body I was put in and I wish i could just have the self control to be perfect", "subreddit": "BodyAcceptance"}
{"post_id": "bto4io", "created_utc": 1558975071, "title": "I cant pass the idea if a guy shows interest to me its because he cant get a tall girl", "author": "Leyylas", "self_text": "I dont forget the time one of my guy friend (!) told me \n\n\"If a guy shows interest to a short girl it is because he cant get a tall girl\"\n\n\nI cant pass this idea whole my life so maybe another reason I struggle in dating is that. If a guy shows interest to me (rarely) I just assume it is because he cant get a tall girl and I am his last option. I dont know how many of you have this feeling but I just cant pass it. It has been years to have a relationship but I have always thought if a random tall girl shows a slight interest, my bf will leave without second thought. \n\nMaybe I am too greedy to want guys \"preference\" rather than their better than nothing option. But it is it.", "subreddit": "BodyAcceptance"}
{"post_id": "btp3iw", "created_utc": 1558979929, "title": "Wanna talk?!", "author": "Yacineben1912", "self_text": "Hi everyone!\n\nI’m working on a project that will help people lose weight and get fit without starving themselves, abandoning the foods they love, or living in the gym, and I would love to get your opinion if you’re someone who wants to lose weight and improve their physique or if you’re interested in fitness in general.\n\nIf you’re available for a quick 20-30 minute call or video chat, I’d love to talk with you. If you’re interested and want to help out, you can securely submit your contact information in the link below, and I’ll be in touch shortly.\n\nSubmit your contact information here: https://yacinebenlebna.typeform.com/to/JLXeO2\n\nThanks again!", "subreddit": "fatlogic"}
{"post_id": "btvfyq", "created_utc": 1559016104, "title": "Struggling to love myself", "author": "Hotbitch27", "self_text": "I am a mom of three in my late twenties. I have three beautiful girls that I teach to love themselves no matter what... but I hate myself. I know its hypocritical but it's the truth. In a world where sexy is being recognized in small and large what is you arnt \"slim\", \"thick\" or \"slim thick\"? What if you aren't shaped like the girls that are plastered all over the internet? I want my husband to look at me and think I'm sexy after having our three children. I just want him to fantasize about me like he used too. What happends to those of us that give our bodies to create life and and don't bounce back? I used to love myself. But no matter how hard I try I feel stuck.... will I ever be welcomed in to the MILF category or will I be left to die as weird shaped mom that bakes way too much for the holidays while her husband gets off to the girls of pornhub? I didn't chose this body... it was what I was given...", "subreddit": "BodyAcceptance"}
{"post_id": "bu166s", "created_utc": 1559056244, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bu211e", "created_utc": 1559060616, "title": "How to feel confident in my own body that is not perfect?", "author": "puglover1992", "self_text": "I have had chest Keloid Scars for years now. Due to that, I have never felt comfortable in my own body. I don't remember that last time I wore anything like a v-neck. I feel so disappointed in myself for being able to not care about what others might think when they see my scars.\n\n&amp;#x200B;\n\nHow do others i guess deal with this?", "subreddit": "BodyImage"}
{"post_id": "buaznh", "created_utc": 1559109642, "title": "Are weddings a big trigger for anyone else? How do you stay centered, selfless, and relaxed at image-focused events?", "author": "lovelylefthander", "self_text": "First of all, I love weddings. Beautiful dresses, emotional speeches, and reuniting with those I haven't seen in a long while. I'm a hopeless romantic but events that have a lot of pictures involved always stress me out.\n\n*In Fall 2017*, I was at a best friend's wedding. All I could think about was weight.  I had just started dating my boyfriend. I had a blossoming eating disorder. I remember stressing about the food there, stressing about the pictures after, crying in the car for hours with my patient boyfriend. I was determined to lose weight and despite his protests, I was convinced that I just needed to lose more weight to keep his affection. This fueled a lot of drama.\n\n*In Summer 2018*, I went to several weddings. It was the year for all of my close friends to get married. My boyfriend and I had broken up, after months of him patiently dealing with my destructive eating disorder, but then me self-consciously cheating on him. Although I had plus-oned him to two weddings, I went alone to all of them. I was very thin, I had to alter my bridesmaid dress.  I had so many compliments, but I had gotten to the dream weight by losing everything. I remember reflecting on the \"love is..\" passage of scripture (1 Corinthians 13) and thinking about all the things that love is...they are all character related, none image related. I was skinny, but I had become unfaithful and self-focused. I was determined to be better.\n\n*In Spring 2019,* my boyfriend and I were back together. I went to his brother's wedding. It was amazing the amount of forgiveness I received. I was a bridesmaid, despite everything.  I had gained back so much, including weight. But I was happy. The night after the wedding rehearsal I took out my stressed boyfriend to eat at a McDonald's and he was just in awe of how I wasn't embarrassed eating in front of him anymore. He told me it was insanely sexy.  I put my heart and soul into helping things run smoothly. I felt so loved.\n\n...but after it was over, anxious thoughts begin to creep in again. I felt self conscious about everything in retrospect, from the speech the bride asked me to do last minute, to the pictures that were released. One in particular haunted me. The photographer caught me off guard and asked me to pose with my boyfriend. Instead of sitting up straight I kind of melted into his arms, slouching and my stomach is sticking out. I spent hours staring at that photo. I'm in a ballgown but I look like a total slob. I don't have many fancy photos with my boyfriend (he never dresses up) and it made me wish that I still had my skinny figure. His brother's wife is a fashion-designer and looks like a supermodel. Image and posing are a part of her career.\n\nI know if I saw that photo when I was heartbroken last summer I would have been so elated to know I was at the wedding, back together with my boyfriend, and had earned back the trust of his family. But I keep slipping back to obsessive thinking.\n\nNow it's summer and I'm starting to get obsessive thoughts again about losing weight in time for the next wedding I have scheduled a month from a half and now.  I want to be thin again but I am worried about losing myself. But I also want to look good next to my boyfriend, his brother, and his fashion designer sister-in-law.\n\ntldr: my eating disorder/self-focused behavior ruined my relationship with my bf, but I looked good in wedding photos as a bridesmaid. Then i recovered and we got back together and attended another wedding (also a bridesmaid) but now I want to lose weight after seeing those wedding pictures so I can be skinny for the next wedding we attend together.", "subreddit": "BodyAcceptance"}
{"post_id": "budowe", "created_utc": 1559130719, "title": "Accepting big boobs.", "author": "PerseveranceSmith", "self_text": "An odd one some people might think, but how do I learn to accept my big boobs?\n\nI'm a 32F and a size 8 (UK). I know a lot of women would like bigger boobs but they're just causing so many issues.\n\nBeyond the vapid (but kind of important to feel good) stuff of never finding attractive underwear and clothes not fitting, they have brought so many more problems.\n\nBras in this size cost a bomb and can only bought in specialist places, until recently I wasn't on a great income so buying underwear was genuinely a struggle.\n\nI also have a joint disorder which means the pressure from them really affects my shoulders and posture (I'm like a busty hunchback these days).\n\nAnd lest we forget that absolutely everyone likes to comment on them. I recently posted an innocent photo of me at dinner in a tank top and all the comments were literally 'omg look at your tits'. Again, some may find this complimentary, I find this depressing, as I'm literally being reduced to these two milk sacks.\n\nNB: I would not consider getting them reduced. I've had enough non elective surgery in my life to not want more unless it's life threatening.\n\nSo how does everyone else cope?", "subreddit": "BodyAcceptance"}
{"post_id": "bufv4p", "created_utc": 1559142716, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bug32o", "created_utc": 1559143815, "title": "How do you people do it??", "author": "littlenerd916", "self_text": "I'm 27f, and i just completely hate myself... I have never been able to look at myself in the mirror ever, and i just hate everything about myself. I'm not that big.. i'm chubby, but i hate looking at my potbelly. i hate looking at the very thing that just makes me ugly as hell. I've never been loved and never will be. i don't know how you guys are just ok with what you have...", "subreddit": "BodyAcceptance"}
{"post_id": "bugoe8", "created_utc": 1559146720, "title": "Is anyone else attracted to their body type on other people, but not on themself?", "author": "d4rkside96", "self_text": "I’m a guy, 22, and I’ve struggled with my weight all of my life. In primary school, I was overweight. In high school, I was obese. Then when I started uni I made some drastic changes and got down to a more normal weight, still with some extra kgs to lose but I was significantly smaller than I had ever been. Then I started going to the gym, and gained a bunch of muscle. I’m now what you would I guess call “thicc”, I’ve got muscle but it’s covered in a bit of fat that’s still there so I don’t have a six pack or anything, my stomach still bulges out a bit, and I have thick thighs and a big round butt. \n\nNow, I’m bi, and I have a great boyfriend who constantly reassures me of how much he loves my body and thinks I’m so attractive etc etc, but I just can’t stand my body most of the time and feel so ugly. I rarely even take my shirt off in front of him because of how ugly I feel like my body is. But the thing that I find strange is, I actually find other guys with my body type so hot sometimes. I’m an absolute sucker for a “thicc boy” with a nice big ass and thick thighs and all round just some meat on his bones. But I find that same body type absolutely disgusting to look at when I’m looking at *myself*, and I just don’t understand why. \n\nHow can I be attracted to a certain body type on other people, but hate it on myself and actually find myself ugly? Has anyone else experienced this?", "subreddit": "BodyAcceptance"}
{"post_id": "bungyl", "created_utc": 1559181497, "title": "I Wish I Looked Like A Pornstar", "author": "natalie098", "self_text": "The reason i’m saying this is because my boyfriend used to watch a lot of porn. I didn’t find out about this until months into our relationship. I told him how much it bothered me and he stopped (as far as I know.) The problem is that I can’t shake the feeling that he wants me to look like the women in porn. He obviously watched it to get off, and I feel like they do that better through a screen than I can right in front of him. He tells me he loves my body but I genuinely believe that he wants more. I wish I looked like a porn star with big boobs, a tiny waist, and a big ass. I know that’s practically unachievable without surgery but it still haunts me.", "subreddit": "BodyAcceptance"}
{"post_id": "buohh5", "created_utc": 1559187824, "title": "How can I make my boyfriend with one eye feel handsome?", "author": "fortyfivetablespoons", "self_text": "I wasn’t sure where to post this, but this sub seemed to fit. My boyfriend lost his eye after someone threw an axe can in a fire when he was 16/17. He’s 20 now and he still struggles with feeling insecure about his eye. To me, and a lot of other people, he is still extremely handsome. He has one beautiful blue eye, a great face shape, nice full lips, etc. It breaks me to see him upset over his missing eye. To most people, its barely noticeable, and just looks like he’s winking all the time (he doesn’t wear his glass eye- he doesn’t like the way it looks). He’s also been in a lot of pain due to the fact that they didn’t remove his optic nerve in hopes that maybe one day it can be repaired. When he breaks down I try to remind him of not only how handsome I think he is, but also of his good qualities. He’s hardworking, funny, caring, and the best boyfriend I’ve ever had. He’s very selfless, and treats his mother so well (a quality i always look for in my partners). I feel like no matter what I tell him, it won’t change the way he feels. I know he has to make the changes himself to feel better, but how can I encourage him and support him along his journey. He means so so so much to me, and it absolutely tears my heart to shreds to see him so upset over something that he can never change. Any advice is appreciated.", "subreddit": "BodyAcceptance"}
{"post_id": "buubtd", "created_utc": 1559229059, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "buvu4l", "created_utc": 1559236678, "title": "Are there any support meetings of Body dysmorphic disorder?", "author": "ParkerBleu", "self_text": "My girlfriend is really having a very difficult time with her body. She is in therapy, but the therapist isn't able to meet her weekly, mostly bi-weekly.  \n\n\nI want to give her the options of other support for her BDD. Her mental health has really suffered the last month.  \n\n\nI am trying to find a online support group meeting like AA or something like that. I have been searching, but found a very small amount of any kind of support regarding BDD.", "subreddit": "BodyAcceptance"}
{"post_id": "buzda0", "created_utc": 1559254690, "title": "Working on body acceptance has improved, but I still find myself obsessing over small details (i.e. calorie counting, pants size, how much I should be exercising every week according to google)", "author": "erkullurrkul", "self_text": "I've gotten better about accepting my body and telling myself \"I want and deserve to feel better\" as opposed to \"I need to lose at least 30 pounds\" has made it easier for me to make better choices in my diet and has even motivated me to exercise even if its only 3 times a week. However, I still find myself looking in the mirror, mostly at my belly, which at this point has swollen quite a bit thanks to a few years of heavy drinking (which I'm proud to say I've cut down on as well :)). As a type 1 diabetic and hypothyroid patient, it's harder for me to shake off any excess weight I've gained over the past few years, sooo as you can imagine my fitness journey has been...frustrating to say the least. \n\n&amp;#x200B;\n\nNow that I'm finally starting to find a good balance between diet, exercise, mentality and self acceptance, this journey doesn't feel like much of a burden anymore. But this belly....these muffin tops.....the fact that a lot of my old clothes don't fit anymore...it still bothers me. I'm not sure if I'll ever reach a point where I'm 100% happy in my own skin and I'm wondering if I'm not alone in feeling this way.", "subreddit": "BodyAcceptance"}
{"post_id": "bv17a1", "created_utc": 1559265150, "title": "It looks to me like my body keeps changing its appearance every single day.. so odd", "author": "Alexisiscool25", "self_text": "I don’t understand how this is a thing, I either think I look good and sexy or I think I look fat and weird.\nI used to be really skinny, and I gained some weight-some in my butt, boobs, and stomach.\nI gained about 35 pounds.\nI was starting to get used to looking at my body, &amp; kinda liking what I saw.. but now whenever I look it seems my proportions are always different. Some days I feel like my boobs look small and some days I feel like they look big or somedays I feel like I’ve lost weight or some days I feel like I still look the same.. it’s the weirdest thing. How am I supposed to feel confident or comfortable with my body when it keeps fluctuating (or at least in my eyes) :(", "subreddit": "BodyAcceptance"}
{"post_id": "bv5z9h", "created_utc": 1559299453, "title": "Photos versus mirror", "author": "mearaowl", "self_text": "Hi,\nIve come to a point where i am fairly okay with how I look in the mirror. I feel like i have come to terms with my body and how it looks, by knowing that I see in the mirror. \nIn pictures however, I look totally different and I feel so much larger in a photograph than in the mirror. At this point I hate being photographed, because I hate the way I look in them. I don’t think I have seen a photo in which I liked myself in many months. Its starting to make me doubt the way I should feel about myself: does the mirror lie? Am I actually that much larger than I perceive myself in the mirror? It stresses me out so much, but I also feel that obsessivily staring at my reflection is not the way to go here.\n\nI cant be the only one; How do you deal with pictures and your reflection? How can I come to terms with the differences in what I look like in them?", "subreddit": "BodyAcceptance"}
{"post_id": "bv8r8i", "created_utc": 1559315689, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bjbxdh", "created_utc": 1556676733, "title": "New mom, new body", "author": "lifethrowinglemons", "self_text": "I gave birth 6 months ago to a beautiful healthy baby boy and I am struggling to accept my body. I feel like I am very bothersome when i have to dress up because nothing fits me like it used to, even with new clothes I bought or wearing a bathing suit because I am covered in stretch marks. It usually results in crying or frustration to the point where I decide that it’s worth going. Any advice?", "subreddit": "BodyAcceptance"}
{"post_id": "bji9lj", "created_utc": 1556723730, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bjj9el", "created_utc": 1556728595, "title": "Billie razor commercial", "author": "PM_ME_KITTYNIPPLES", "self_text": "One small detail I noticed is they actually showed a model shaving her toe. I don't feel alone with my hobbit feet.", "subreddit": "BodyAcceptance"}
{"post_id": "bjkfgk", "created_utc": 1556734295, "title": "I'm struggling with unintentional weight loss. (TW: weight loss, medical issues)", "author": "Rottenboy22", "self_text": "I am a 22 year old female. My whole life I have always been bigger. I had some weight to lose, but not a lot and I also had a lot of muscle. I was happy with my body. Then, I had to get my wisdom teeth removed. Not a big deal. I had never had surgery before, but I wasn't even worried about it, because of how routine the procedure is. I am stubborn and went to work the day after my wisdom teeth removal, which led to me developing dry sockets. I was so sick and in so much pain that I lost 20 lbs in a week and a half. I started to recover from that when toward the end of February the rapid weight loss caught up with me, and my gallbladder became inflamed, infected and full of stones. I ended up losing 25 lbs overall, which was 15% of my body weight. It happened so fast, and while it was happening I was just trying to stay alive, and keep up with my job and graduate school. (When I came back to work after my gallbladder removal my manager even commented \"look at your new skinny body\") Now, months later, the weight is still off. I am smaller now than I have ever been. I hardly recognize myself. I constantly look at my body and all the parts that are much smaller and different now.  People keep commenting on how good I look, and how they've noticed my weight loss. It's a compliment, but it feels like a 'congrats on almost dying.' When I tell people about how I lost the weight, they comment 'maybe I should get my gallbladder removed.\" It's like they see it as a good thing, but it wasn't a good thing. If I had lost the weight slowly, and in a healthy way I would be celebrating. It's just been a tough year so far, and sometimes I forget everything that happened, until I look in a mirror, or get dressed. I don't know why this is so hard for me, but I have been struggling so much lately. Thanks for reading, I really just needed to vent.", "subreddit": "BodyAcceptance"}
{"post_id": "bjkmdx", "created_utc": 1556735226, "title": "Too ashamed to go to therapy", "author": "castlecat32", "self_text": "I’m not really sure how to put this, but I’ve had pretty severe body dysmorphia for my entire life. Most specifically, it’s my face that I have issues with. I feel hideous; the best description I could give is that it feels like I’m wearing a Halloween mask 24/7 and I can never take it off. \n\nIt’s gotten to the point where I have trouble making eye contact with people. Even my boyfriend. It has made me agoraphobic.\n\nI’ve known for a long time that I would benefit from therapy. So I actually made an appointment to see a counselor about it.\n\nAt the counselling session, I started crying when talking about my face and I just put my hands up to hide my face. I felt like the counselor was staring at me. I was so self-conscious about how I looked while crying that I couldn’t even open up fully.\n\nI cancelled my next appointment because I honestly feel so ugly that I don’t want anyone to look at me. Not even a counselor. I know I would really benefit from talking about my issues with a counselor but I’m so ashamed of how my face looks that I can’t bring  myself to ever go back. Even the smallest things make me self conscious - the way my mouth moves when I talk. My smile, the shape of my nose, the way I walk and cross my legs when I sit down. Everything. \n\nI feel like I’m going crazy and I don’t know what to do.", "subreddit": "BodyAcceptance"}
{"post_id": "bjmx33", "created_utc": 1556746971, "title": "struggling with insecurities", "author": "Rose-lemonade", "self_text": "I’m a 21 years old female who has been struggling with insecurities for a long time. It started when I was around 15 years old and I started eating as little as possible in order to lose weight. Even though I'm doing much better now, it is still on my mind every day and I still struggle with accepting my body the way it is. Besides this, I also care a lot about being pretty and beautiful. I always worry that I’m not pretty enough and that other girls are prettier than me. I really hate myself for caring so much about this because I feel like it's very superficial but I can't get it out of my head. These insecurities are mainly related to my boyfriend in the sense that I care a lot about what he thinks and that I am afraid he thinks other girls are prettier than. He keeps telling me that I don't have anything to be worried about and that it's not even that important whether I am pretty or not and that he loves me anyway but it's so hard for me to believe that. \n\nSo I could really use some advice on how to stop comparing myself to others, how I can stop caring so much about being pretty and how I can accept the way I am and eventually starting loving myself.", "subreddit": "BodyAcceptance"}
{"post_id": "bjnysz", "created_utc": 1556752799, "title": "Is accepting that I'm not a pretty girl and focusing on something else easier?", "author": "nomoreghosts", "self_text": "Instead of going through these ups and deep lows about trying to feel like I'm beautiful -- maybe it would be more freeing to just accept that I'm not. That beauty isn't for me. I just wasn't meant to be a pretty girl. A girl who's known for her other qualities as a person, maybe, but not someone who makes other people feel they're around someone attractive. I've just been so caught up on how for women, beauty matters whether it's moral or not, and how attraction as a whole gives people (unfair) advantages in life. And I really wanted to be a part of that. I really wanted to experience what it's like to be a beautiful woman, what it's like to get those advantages. But perhaps I should stop trying. I don't know. Has anyone here ever considered this, or has fully adopted this way of thinking? Is it working for you?", "subreddit": "BodyAcceptance"}
{"post_id": "bjtdpi", "created_utc": 1556793134, "title": "I don’t know how to get to a place of acceptance. Bout to just cut em off and be forreal flat chested 🙃", "author": "SerrahBetrippin", "self_text": "So I was pregnant at 22 and had my son almost two years ago. I always breastfed until he was 8 months or so. After I breastfed I notice it was like someone took the meat out of my breast. My breast always slight sagged because I’m human. But after the pregnancy I tried to take my health into my own hands. I dropped 60 pounds through diet and exercise. But my breast still greatly sag almost down to my stomach. As a 23 year old young women fit in all the right places but one this is a nightmare. I never though at 23 my breast would look like almost empty water balloons. And I know women have there stories ohh well I’ve been with a bunch of guys and they all loved my blah blah. Well good for you sis I did not have the same lovey journey as legit I was with 2-3 guys after my relationship ended. It was a nightmare the first guy felt my breast and as legit wide eyed at the amount of emptiness of my chests. The 2nd guy took one took at them and said And I quote “ oh it doesn’t matter that your chest super sag I have appropriation for a mother’s body” he blocked me directly after that encounter guys and I wanna say it other reason but uhh he didn’t say that speech until after he felt my chest...3rd guys literally laughed at me and told me to leave because he doesn’t chuck old ladies...and I don’t even like douchebags I mostly date nerd or fellow parents so this is hella depressing..so um what do I do I’ve looked at the boobs gallery it didn’t help and at this point I’m just like duck it saving up for a boon job first and then a car later in life. I know that’s so fucked up but I don’t even know how to look in the mirror with out being greatly saddening by the saggin 😞", "subreddit": "BodyAcceptance"}
{"post_id": "bjw1fd", "created_utc": 1556809711, "title": "I've accepted my curves, but struggling accepting the amount of cellulite.", "author": "0seagirl", "self_text": "I've struggled with eating most of my life. I'd been very thin most of my life, until my late 20s when I started binge eating to a lot bigger, then restricting again, and then getting bigger again.. Now at 32 I'm happy with my curves. It's my cellulite that's getting to me now though. I understand everyone has it, and that's cool, but the amount I have looks excessive and noticeable. It covers my butt, covers my thighs and upper legs, covers my upper arms, and a little of my lower legs too. It makes me feel so bad and it's triggering feelings of wanting to lose weight again, solely to try to lose the cellulite.\n\nAnyone else in this place? I could use some help, advice, or anything. I really want to stop myself falling back into restricting and obsessing over trying to lose weight when I don't need to. I have no idea what to do really. I'm struggling with this.", "subreddit": "BodyAcceptance"}
{"post_id": "bjw32t", "created_utc": 1556809964, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bk0zx1", "created_utc": 1556835840, "title": "Feeling Stuck", "author": "MysteriousInterest1", "self_text": "Over the past few years, I've felt stuck in terms of my body image. I'll feel bad about my tummy, and lose 10lbs, just to gain it back after I stop caring. I'll obsess about the size of my ears until I move onto my nose, and then the redness on my skin, and then my dark circles, ect. It feels like I'm playing an endless game of catch-up, where I'm always just out of reach to feel happy with the way I look. Can anyone relate?", "subreddit": "BodyAcceptance"}
{"post_id": "bk2pne", "created_utc": 1556846298, "title": "A promise to myself!", "author": "206Linguist", "self_text": "Hey y’all!\n\nSociety has done a good job of dictating what I ought to wear. A really good job. I think I’ve finally gotten the gumption to kick that to the curb though!\n\nI’ve decided I’m going to wear my stomach out ALL summer!\n\nI’m going on a small vacation soon. I bought a bikini. A high waisted bikini,  but a bikini nonetheless.\n\nI’m looking at new sports bras. When i go out walking around this summer, shirts are optional.\n\nI bought waist beads for the hell of it.\n\nJust bought a new crop top to wear when it gets chilly.\n\nY’all, I’m excited. My body is my own. Going against the norm makes me a little nervous, but I’m so very tired of neglecting to fully live in my body. Let’s hope that changes this summer!", "subreddit": "BodyAcceptance"}
{"post_id": "bk876g", "created_utc": 1556888344, "title": "I hate my body even when I try to tell myself I’m pretty...I just wanna cry", "author": "J_Bond98", "self_text": "I keep telling myself that beauty comes in all shapes and sizes, that being skinny is not the only beauty \nI keep looking at myself saying “you’re good” “you rock” \nThen I look around and see that beauty is only skinny strong arms, tight waits...and then I feel like shit \nMy family are all sport addicts, but me ...\nSports is so overwhelming for me \nNow I feel like crying \nMy arms are chubby \nI don’t have a tight waist\nI have a chubby waist\nNow I’m ditching good food, eating less \nI just \nI wanna cry", "subreddit": "BodyAcceptance"}
{"post_id": "bk9ksz", "created_utc": 1556896345, "title": "Anyone get “red face” when they are nervous?", "author": "little_lita11", "self_text": "I’ve had “red face” for as long as I can remember. Anytime I’m nervous, or feel any strong feeling really, my face and neck get red splotches and then turns solid red (if I’m really nervous). \n\nDoes this happen to anyone else? How do you cope?\n\nI hate doing job interviews because of it (I immediately get nervous in interviews) and I’m so tired of people asking if I’m alright. I don’t know if there is even anything that can be done about it, but if you know anything that helps, please share!!", "subreddit": "BodyAcceptance"}
{"post_id": "bk9la0", "created_utc": 1556896422, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bkc6mn", "created_utc": 1556910364, "title": "Trying to learn to love me", "author": "jrdnhpk", "self_text": "So I (24F) went through a lot of stressful things at the beginning of last year and I ended up putting on a lot of weight, now I am left with stretch marks and fat galore. I am having a hard time loving myself and feeling confident. Especially when my BF grabs on to my fat or makes some comments about my stretch marks. He also gained a lot of weight and has stretch marks, but I always just tell him that he looks great and I love him. \n\nAre there ways for me to get rid of stretch marks sooner than exercising would rid me of them, and how do I gain my confidence back?", "subreddit": "BodyAcceptance"}
{"post_id": "bkliw0", "created_utc": 1556979085, "title": "Learning to love myself after weight gain, but can't accept this stupid belly!!!", "author": "glitterqueenbee", "self_text": "Hi all. About 2 years ago I gained about 30 lbs over less than 2 months due to a new medication, and ever since I've had significant body image problems. It took me a long time to even accept it as fact and buy larger pants. This weight went mainly to my stomach, love handles, and waist/thighs. I also developed stretch marks in those areas, which was entirely new to me. \n\nPrior to that, my weight had been fairly stable for as long as I can remember. Over this time, I've slowly accepted my body again, even the stretch marks - except for my tummy. It sticks out so much, my grandma asked me if I was pregnant (which was devastating to hear in the midst of these body image issues). \n\nI don't know why so much fat congregated there, and I don't know how to get rid of it. Crop tops are really popular right now, and I am far too self conscious to wear them. I know truly flat tummies aren't real, and I'm not asking for that. I just don't want it to look so distended, like I just ate an entire cake or like I'm 3 months pregnant.", "subreddit": "BodyAcceptance"}
{"post_id": "bkm3dl", "created_utc": 1556982648, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bkq015", "created_utc": 1557005053, "title": "I look like a freak.", "author": "gucci_fridge", "self_text": "I'm 13 years old, male, and going through puberty. I am tall (mostly legs) and have long arms but a super short torso. My arms are probably almost twice the size of my arms. I don't know what to do about it, especially since I'm only two inches below my Dad, who is about 5'8. Also my mom is 5'2 so I don't think I'll be growing more. Excersising hasn't really helped even though I play lacrosse and hockey all year round, and started playing since I was about 7.", "subreddit": "BodyAcceptance"}
{"post_id": "bkqg53", "created_utc": 1557007758, "title": "My boyfriend loves my body - but I don’t. How do I change my way of thinking?", "author": "psychoweeb", "self_text": "I have the typical hourglass figure.. I have wider hips, bigger butt, a smaller waist and broad shoulders/big chest. My boyfriend is obsessed with my body because it’s “thicc” or whatever, but I hate it. I have an eating disorder and I used to be anorexic.. I’ve always had a curvier body type, even when I was anorexic my curves were visible but I was completely flat. I find myself missing my old body, and I don’t know what to do about it? I don’t know how I can accept the way I look. Sometimes I think I look fine as hell and I’m a thicc goddess, and other times I hate myself. Does anyone else relate to this? What do I do?", "subreddit": "BodyAcceptance"}
{"post_id": "bkqp9h", "created_utc": 1557009363, "title": "People keep telling me to lose weight", "author": "marybbad", "self_text": "Hello! I've been a positive person overall about my body. I don't love it but I'm trying to change it (for so long...). Today I was having dinner with some family members and everything was going well. I was happy no one mentioned my weight (people always do and I tend to believe that people who do that aren't the most intelligent... Or they don't even think about others.)\nSo my uncle was telling me goodbye and he told me \"you need to walk because I'm not enjoying what I'm seeing.\" I just nodded and smiled after. And now I got really sad. I'm not that fat for my height. Yes I need to lose a little weight but not like 40 or 50 kg.\n What do you do when people talk to you about your weight? \nI need some happy thoughts because I'm really feeling down.  Thanks in advance.", "subreddit": "BodyAcceptance"}
{"post_id": "bkrqd5", "created_utc": 1557016033, "title": "My Shadow Is My Worst Enemy.", "author": "frenchie555", "self_text": "Does anyone else have issues comparing the size of their shadow to others, and getting upset when yours is bigger than theirs? I find this can trigger me to hating my body almost immediately.", "subreddit": "BodyAcceptance"}
{"post_id": "bkudkx", "created_utc": 1557035059, "title": "How long is it going to take for me to feel fantastic about myself?", "author": "Alexisiscool25", "self_text": "Ever since I was in 6th grade (I’m 22 now), I have been insecure about every aspect of myself. 8th grade-11th grade I would go home from school and cry over my looks. I was skinny and between weights of 117-120. When I graduated high school I got a little better about not focusing so much on my looks. But around summer last year I started gaining weight, and at first I was feeling good about it because it was just weight I needed to gain (like butt, boobs, thighs) I looked and felt healthy. But I gained 35 pounds within 3 months and I’m between 152-155 now. I can’t stand how big my arms look &amp; my stomach.. I feel so terrible about that. Whenever I have sex with my boyfriend he tells me I have such a sexy body and that I’m perfect &amp; I can’t even smile or feel good about it because I don’t agree. :( \nI’m tired of not feeling good about myself and I know that superficial stuff shouldn’t be so focused on compared to other problems. I just want to be proud and feel great in my own skin. \nI’m gonna start making changes and doing cardio. But I really had to vent :(", "subreddit": "BodyAcceptance"}
{"post_id": "bky7ps", "created_utc": 1557065967, "title": "[2019 Edition] r/fatlogic \"International No Diet Day\" 24-Hour Fast Check-In Thread.", "author": "CubicSlime", "self_text": "**[LATEST] This event is now officially over!!! Thanks everyone, for your wholehearted participation and support~~~ :D**\n\n&amp;nbsp;\n\n&amp;nbsp;\n\nGreetings to everyone here on r/fatlogic!!! :D\n\n&amp;nbsp;\n\nSo, 6 May is upon us all again. Apparently, this day is also some so-called \"International No Diet Day\", which many of those HAES/FA cultists venerate, and go all out to avoid \"being on a diet\" on this day. Though, then again, \"avoiding diets\" is an everyday occurrence for them, but this day is symbolically more important to them, so... o.o\n\n&amp;nbsp;\n\nAnyway, using an idea that I came across on this sub years ago, for the past few years, every time 6 May comes around, I have decided to join in the festivities, by going on a 24-hour fast on this day every year! I too, am going \"no diet\" on this day as well! This, as the word \"diet\" refers to the foodstuff one consumes in their daily lives, hence, wouldn't \"no diet\" equals to no food consumed at all? &gt;:D\n\n&amp;nbsp;\n\nHad been \"promoting\" this for the past few weeks on and off on this sub, but, if anyone wants to, feel free to join me on this fast, from 0000 Hrs on 6 May, until 0000 Hrs on 7 May, based off your local timezone? Please take note of the important caveats listed below if you intend to join before \"checking-in\" in this thread, and I wish you all the best in your 24-hour fast today. :)\n\n&amp;nbsp;\n\nImportant caveats:\n\n* THIS EVENT IS COMPLETELY VOLUNTARY.\n\n* DO NOT JOIN THIS EVENT IF YOU EVER HAD A MEDICAL DIAGNOSIS OF ANY EATING DISORDER. Instead, please use this day to focus on your recovery. Take care!\n\n* IF YOU ARE NOT FEELING WELL, PLEASE DO NOT JOIN AS WELL. There is a risk of aggravating any current illness you might have, which is a risk I will rather avoid. Please rest well!\n\n* \"Starvation mode\" does not exist, at least, in the manner that those HAES/FA cultists put it. \"Dehydration mode\" however, does exist, and is potentially lethal! Please ensure adequate water consumption, but don't go overboard and end up with \"electrolyte imbalance mode\", which could be lethal as well...\n\n* If you are not feeling well during the course of the 24-hour fast, please stop your fast, and if needed, seek medical attention. Your safety and well-being is of utmost importance!\n\n&amp;nbsp;\n\nThat being said, to everyone who will be joining, welcome~ :D\n\n&amp;nbsp;\n\nP.S. Last year's thread on this event can be found [here](https://www.reddit.com/r/fatlogic/comments/8h92i9/official_rfatlogic_internation). :3", "subreddit": "fatlogic"}
{"post_id": "bkyhn3", "created_utc": 1557067445, "title": "I'm glad I got fat", "author": "Gameboy_Connoisseur", "self_text": "When I was little, I was rather skinny. Everyone commented on how they could count every bone in my body. I was pretty indifferent. Starting at about age 9, I slowly started getting chubbier, until hitting a peak of about 120 pounds with a height of about 5 feet at age 11. At this point, I didn't really like my extra chub, but I didn't completely hate it. That would come later. It was at this time that we found out I was allergic to a lot of different foods, the hardest to avoid being gluten and corn. I was on a rather restrictive diet for about a year, not to lose weight but to get over my allergies. Not only did I get over those for the most part, I lost 20 pounds in the process. I did lose most of my chub, but I still thought of myself as just as fat. Seeing pictures from a year ago really shocked me, since it hadn't registered in my mind that I was any thinner.\n\nStarting middle school at age 12, I was off the restrictive diet and over the course of a year, I gained 60 pounds. Seeing as how puberty was just starting, I doubt it was all fat, but a significant amount surely was. Regardless, it was a very difficult transition, since I was quickly outgrowing clothes and worried about what people would say. At this point, I actually stole a few of my Mom's sweatshirts, all of which I can still wear today amazingly enough. I was fearing people would give me snide comments regarding my bulk, but most of it was just neutral observations regarding my stature, like my Mom calling me a big guy (these still upset me, but it's better than getting it rubbed in my face.)\n\nOver the course of the next few years, I would gain more weight at a much slower and healthier rate. I am now 17, 5 foot 8, and weighing about 240ish pounds. I've gained about 20-30 pounds since middle school, but not very much of this appears to be fat, so my body size has been pretty stable thankfully. I've gotten used to being bigger since that massive spike in my weight at age 12, but I still wished to lose my weight, especially since I thought it would help with my gender dysphoria since my transition goals were to be rather petite. After reconnecting with my body and loving her, I've come to appreciate my body fat, not only for what the experience has taught me, but also because it's just fun to jiggle around and play with. I feel at home in my body for the first time in my life, and I love every last subatomic particle that makes her up (even the ones that make up my masculine features, they deserve love too).", "subreddit": "BodyAcceptance"}
{"post_id": "bkzqy4", "created_utc": 1557073887, "title": "My best friend idolizes the “instagram body”", "author": "fuckupsomesmahtkids", "self_text": "I’ve had a really unhealthy relationship with the gym. I would work out obsessively for 3 hours a day, every day, until I got very ill for that exact reason. Since then, I’ve been scared to go to the gym and only recently begun working out at home and limiting myself to an hour. \n\nMy very best friend works out several hours a day, every day, and while I support that, she’s very critical about people’s bodies. We’ll watch YouTube videos together and she’ll criticize them, calling them “chubby” or pointing out that “she has a belly,” when in fact, their bodies are fairly normal. I should add here that she’s never criticized my body. \n\nWhen I confronted her about it, she said the only reason that she’s critical of others is because she is critical of her own body. “Why would I want a man who’s not on the same level as me?” were her exact words. I can see the logic in this, but as someone who has always struggled with their body and self-image, it bothers me.\n\nHow do I deal with this?", "subreddit": "BodyAcceptance"}
{"post_id": "bl623c", "created_utc": 1557107827, "title": "my self confidence is plummeting help", "author": "--jjulie", "self_text": "my body is really strange. my legs are super skinny and my build is really narrow and kinda lanky ig except i’m not that tall. at the same time i’m really “flat” and my waist is kinda wide. at least nowhere near as skinny as you’d expect it to be when you consider what all the other parts of my body look like. basically i’m a rectangle. anyways, a few months ago i decided to start exercising and eating super healthy to try to build confidence and i’ve seen some difference but i don’t feel any better, possibly worse.  \n\nlast year i was super insecure but i liked shopping for myself and i wore makeup. i actually despise wearing makeup but  occasionally, besides my body, it made me feel kind of pretty. a while ago i stopped wearing makeup because it stopped making a difference in how i felt about myself, and not in a good way. i also tried to go shopping today for the first time in a while because i lost weight and i don’t have a lot of clothes that fit anymore, but I couldn’t buy anything bcs when i looked at myself in the fitting room my heart literally sank. i’m convinced that it’s unacceptable for me to pay to wear the clothes with the body i have (and i’m talking things like shorts and even some t-shirts). i literally have 3 outfits that i feel comfortable leaving the house in and if their not available i panic. there’s more but this is long and irrelevant.", "subreddit": "BodyAcceptance"}
{"post_id": "bl6zq4", "created_utc": 1557113509, "title": "I've (22m) have gained so much weight because of my medication and since I broke up with my girlfriend, I felt more ashamed than usual today", "author": "screwseven", "self_text": "I weigh 235 pounds, and I'm 5\"6'. I know that's a lot. I've gained mostly in my belly and I look pregnant. I've been trying to love myself but it's hard. Today my mom said something to me, not intending to hurt me, but it made me feel so low. I just feel so alone, I'm surrounded by in-shape people. My two roommates are in great shape and attractive. I am interested in someone but I doubt she'd be interested in me. Ever since my ex and I broke up I just gave up. And I'm on a medication that makes you gain a lot of weight, but I need it.\n\nCan anyone out there relate? Does anyone out there weigh as much as me? Does anyone out there feel like I'm feeling? I just don't want to feel alone", "subreddit": "BodyAcceptance"}
{"post_id": "bl9e2n", "created_utc": 1557130702, "title": "Meta Monday-No Stupid Questions", "author": "maybesaydie", "self_text": "Take this opportunity to ask to the community any weight related questions you may have. No rants please.\n\n\nOur next selfie post will be May 27 so get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "blgdlp", "created_utc": 1557170313, "title": "Anyone deal with body dysmorphia also? If so maybe you can give me some tips.", "author": "Creamy-_-Ebola", "self_text": "So basically all my life I've been a heavy guy, no girls liked me before, I ate my feelings, etc. Basically an Incel. A girl even said \"Eww, no he's fat!\" Back in high school when a buddy of mine told her that I liked her (so no, \"no\" isn't the worst they can say. Lol)\n\nAnyways basically my entire life I've basically had zero self esteem. Cut to now (25 years old) I've been working out for about 3 years, went from 284-295 down to 209-212. I've put on some muscle but my genetics sucks so even after 3 years I still don't look like a Chad, but people tell me that i look like I lift. \n\nNow I've had 3 girlfriends in the past but even after that and having gone on some dates, I still don't think I'm even the slightest bit attractive and still feel like I'm 284+ when I look in the mirror or see myself in pictures. I still constantly suck in my gut when I walk around in public because I feel like my stomach sticks out past my chest and whenever a girl looks in my direction I feel like she's thinking about how disgusting my body looks. I can't even bring myself to ask a girl out on a date in person because I'm just constantly thinking that she's looking at my \"fat\" and then I just basically give up in my mind before I even get close to asking. And if by some miracle I do end up dating them the entire time I'm just waiting for then to find someone that's obviously more attractive than I am and dumps me or cheats on me.\n\nI used to think I was gay because I always admired other mens bodies/faces, but I came to understand that I just really wish I could BE them. Because I hated being myself, I hated the way I look. I feel like no matter what I do, I'll always look hideous.\n\nI guess a silver lining is it made me a kind person, because I know what it's like to be made fun of because of the way you look or have insecurities.\n\nAnyways, sorry for the long post I'm just kind of wondering if anyone else currently feels or has felt this way before. And if so what did you do to overcome it?\n\nEdit: Sorry if it's a weird post. I'm not used to admitting that I have this issue. I know it's super annoying when people post about their problems online. At least people always tell me they get annoyed by it. Also I'm a 25 year old Male, I forgot to add that.", "subreddit": "BodyAcceptance"}
{"post_id": "blh0hx", "created_utc": 1557173503, "title": "Please help me", "author": "RayneBlack97", "self_text": "I, 22m, am in a relationship with  girl, 19f, and she has days where her image of her own body is fucked.  To say the least, anyway.  I need tips on how to help her, because as of right now no matter what I do it doesn't work.  \n\nHow should I handle this?", "subreddit": "BodyAcceptance"}
{"post_id": "blrukt", "created_utc": 1557241846, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "blsnd9", "created_utc": 1557245892, "title": "Reflecting insecurities on others", "author": "unidentified_pancake", "self_text": "Story time!\n\nI in no way, shape, or form, condemn nor condone, the actions of my friend. This friend is actually a pretty cool person, and is considered conventionally attractive. What I failed to realize before, was despite this, conventionally attractive people can have low confidence regarding their image. In some cases this is even worse than those who are a) not conventionally attractive and/or b) actively bullied for their looks. It began with easily ignored signs such as an obsession with blemishes, then it progressed to restrictive diets (a cucumber, some lettuce, an apple, and a yogurt), then eventually to plastic surgery plans. The incident today (and a few times before) is an indicator (to me) that she still struggles with her self-imposed standards, this friend of mine is an artist and she was drawing 'cats' that represented people, now of course (if you've seen my previous post, you'd know I wear a loose uniform), she drew my 'cat' as obese, with distorted facial features, and an obscenely large chest area. Ordinarily this would offend me, and I wouldn't say we are close enough for me to know this is a joke not at my expense, but for some inexplicable reason, I feel like this expresses her feelings towards her own body. I am not really asking for anything here aside from thoughts, and of course this is my opinion which may be wrong (hope it isn't offensive &gt;-&lt;).", "subreddit": "BodyAcceptance"}
{"post_id": "blyn22", "created_utc": 1557275839, "title": "I want to love my body, but it's hard feeling like I have to do it on my own", "author": "EstrogeNitroglycerin", "self_text": "I've struggled with my body image ever since I was 12. As a trans woman, I've dealt with a ton of gender dysphoria related to the broader shape of my body, to the hairs I've lost before starting my hormonal therapy, to the coarse hairs on my body. For years on end, I told myself that I would never be loved or desired. I was convinced that my destiny was to die alone and unwanted, as if it was some sort of biological fact: I was ugly, nothing more to it.\n\nEver since those days, I've started my transition, I've gone to therapy for my depression and suicidal thoughts and have even got a wonderful, loving boyfriend. I feel happier than I ever have.\n\nBut I still feel ugly. I can pretend I don't for a little longer than I used to, but my feelings still remain the same. It's not as if I don't make efforts to change my body image, I follow everything that my therapist tells me to do to better my perception, but still, I feel trapped, and I think I've figured out one of the reasons why.\n\nIt's because all my life, Ive been the only person who's ever made me feel pretty. My boyfriend, , being completely asexual, has no physical or sexual attraction to me. He's with me for my personality and nothing else. So even though I know he loves me more than anything, I still feel undesirable, like no one could ever want my body.\n\nEven before, I've never been called pretty, ever. I've never been hit on, I've never been complimented on my appearance, not even by my parents. \n\nAnd I feel so greeding for feeling this way. After all, it should be enough for me to just try and love myself, right? No one owes me attraction. And, besides, I shouldn't limit my worth to how I look or how others feel about me.\n\nBut I'm realizing that's not how it works. Self-love is important, but so is feeling outside love, and there's no escaping it.\n\nSo, for now I'm feeling stuck. Undesirable.\n\nI want to work on it though, and I'd love any piece of advice.\n\nThanks for reading &lt;3", "subreddit": "BodyAcceptance"}
{"post_id": "bm6fvk", "created_utc": 1557328343, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bmfop4", "created_utc": 1557377484, "title": "Knowing that my partner watches porn makes me self-conscious", "author": "HeavyAlps0", "self_text": "I know he is entitled to do whatever he wants to do during his own time and that I shouldn't tell him what to do with his own body, so I don't tell him those things, and avoid talking to him about it. But I get very insecure at the idea of him climaxing at the sight of another woman. I worry that it subconsciously causes him to get used to seeing a beautiful woman to finish, and then the sight of me is disappointing in comparison. Obviously porn is almost going to have attractive women in it, and under my assumption that I'm unattractive, that means whoever he is watching does not look like me, because I don't exist in any of those genres. Even when considering that there are some less popular categories that feature women that aren't conventionally attractive, I don't fit in any of those either. None of them describe me. I don't want to describe what I look like, but trust me when I say that I would never be hired for any kind of those videos. Girls like me do not exist in the porn industry. It hurts to know that he'd much rather have sex with them than me. They serve as a reminder that I can't satisfy him with my physical body nearly as well as the girls he watches, and that he must be itching to have sex with one of those girls after seeing so many videos. And I've been told that it's possible for people to like different kinds of bodies simultaneously, but why would he like mine if he has seen so many better bodies. It makes me feel like I am on the lower end of girls that he likes, and that he is indifferent about having sex with me but still has to watch porn to get the experience he truly wants. I don't think he's satisfied with me. I'm scared he likes porn more than me.\n\nI've received advice on how to personally deal with him watching it, but I don't think they understand the experience I'm having, their advice will only work for people who are conventionally attractive. How does someone who isn't conventionally attractive accept that their partner watching porn is not something to worry or feel hurt/ insecure about?", "subreddit": "BodyAcceptance"}
{"post_id": "bmkypo", "created_utc": 1557414657, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bmlvsz", "created_utc": 1557419330, "title": "Curve-less", "author": "natalie098", "self_text": "So it seems as if men are interested only in women with curves and a full figure. I’m dying to have that. I feel like my boyfriend would much rather be with someone who has big breasts and a big butt than me. It makes me feel undesirable and like i’m disappointing him. I just want to be able to love my body despite the fact that I have a chubby stomach and not much else. All I want is personal self-love and acceptance :)", "subreddit": "BodyAcceptance"}
{"post_id": "bmthvh", "created_utc": 1557459797, "title": "Victoria’s Secret", "author": "cruisinandconfusin", "self_text": "I got my first bra at Victoria’s Secret, I’ve been shopping there for years. But these last few years it’s come to my attention that they don’t cater to plus size or have very inclusive sizing at all. My best friend has stopped shopping there because they do not represent, advertise, or cater to her body type. And honestly, not mine either. I  am done shopping there,and wanted suggestions on were else to shop for some quality lingerie", "subreddit": "BodyAcceptance"}
{"post_id": "bmzhxm", "created_utc": 1557501235, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bn2hh1", "created_utc": 1557515871, "title": "I feel like all my problems would go away if I had bigger boobs", "author": "somethingfunidk", "self_text": "I hate my boobs. I've always hated my boobs. Or more correctly, lack of them. I have convinced myself that just IF I had big boobs all my other complexes would go away. \n\nThey are both too hangy and too firm at the same time. Too small to make me satisfied with my body, but too large to fit good in clothes.\n\nMy bra size is 75G, so my logic side knows that they probably are big. It just seems that people who have even 75C has much larger boobs than me. I ask my boyfriend every day if he is satisfied with them, and he always says that he loves them. But not a single hour goes by without me wishing them to be bigger", "subreddit": "BodyAcceptance"}
{"post_id": "bnd2fc", "created_utc": 1557587394, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bnmyeq", "created_utc": 1557651011, "title": "One of the worst things about being short is how you have to always be careful about talking about it or you will be labeled as someone with Napoleans complex", "author": "[deleted]", "self_text": "I'm about 5 ft 7 to 5 ft8 and while that isn't too short it's still slightly below average where I live. I feel like there are very few places to truly be able to talk about being short as a dude. Many people think it's okay to deride someone for talking about and god forbid you ever say that being short has had a negative impact on your life. Even small spaces like r/short are frequently accused of being bad people for talking about how their height has hurt them. It just sucks how it's acceptable to deride and ridicule someone for talking about a physical characteristic that has negatively impacted their life. And people constantly bring up famous figures to try and prove that height doesn't matter but the truth is many actors in Hollywood wear lifts and movies frequently make actors appear around the same height and try to avoid height discrepancies (this is especially true in superhero films). I hope society not only allows short guys to talk about their issues but starts to accept them.", "subreddit": "BodyAcceptance"}
{"post_id": "bnq39a", "created_utc": 1557674580, "title": "I hate my stomach, my body, myself(ED TW)", "author": "dievybe", "self_text": "I will turn 18 in a few weeks, im 175cm and 57-58kg... I have an ED and had one from when i was 13, I went from 74kg to 54 and now i gained as well... i try to eat under 1k calories,  i feel like to be pretty i need to be 54-56kg. but at the same time i want to just be happy and eat, i want to love myself. I want to be happy at any weight..  but i am terrified of it, of eating. I dont know what to do. Whenever i eat anything my stomach expands, even eating a banana or oatmeal makes my stomach look so chubby, it starts spilling out of my pants, at the end of the day i am pregnant. I never see anything like this happening to others. I feel hideous because of it.  At the start of the day my waist is 64cm, at the evening its probably close to 70, i go from hourglass to a square. I hate having proper fitting tops on in front of other people or naked next to my boyfriend especially. I always have to flex my stomach... i feel like he deserves someone pretty, someone skinny, someone with long hair and someone without an underbite... my mom just tells me to flex it always and it will become a habit? Idk if thats true? Docs didnt find anything, im lactose intolerant, i never eat it though. I just want to cry whenever i look at myself, i hate even looking at my instagram and i feel ashamed that i have kinda a lot(for a boring,basic girl) followers... i feel so unworthy of everything, i feel like im lying to everyone there. do you guys have any advise on how to stop digging into myself so much? How to logically stop obsessing over things like this? I feel so dumb writing this but I’m really really lost...", "subreddit": "BodyAcceptance"}
{"post_id": "bnslby", "created_utc": 1557687343, "title": "Debilitating social anxiety and body acceptance", "author": "theDuckandtheChick", "self_text": "I have to wonder if my social anxiety would tamp down if I were happy with my looks. I have keratosis pilaris on my arms and legs. I’m overweight, and worst of all, I’m losing my hair from the hairline—and I’m a woman. I’m approaching 40, I have pretty much no friends, and I don’t work or interact with anyone. I leave the house maybe every 6 weeks. I’m terrified of being judged on my appearance. I get so nervous when I try to hang out with my one friend at functions she’s invited me to that I end up crying in my car and going back home.\n\nEverything I see online is people ripping women to shreds based on their looks. How can I ever live a normal life?", "subreddit": "BodyAcceptance"}
{"post_id": "bnx5ix", "created_utc": 1557712489, "title": "high school sucks :(", "author": "eclipseseok", "self_text": "i’m a teenager, 14 years old and a freshman in high school. all throughout middle school and even fifth grade, people were telling me i just needed to appreciate my body and that nobody actually had the ideal body type that people on instagram have. \nevery girl at school seems to wear crop tops that show off their stomachs, and their stomachs are actually flat. i’ve tried working out, but it’s never been effective. i just really don’t know how to feel good about myself in this environment that is telling me to do the exact opposite. \ni’m about 5’1”- 5’2” ish and about 130 pounds, and i’m ashamed to tell anybody my weight. how do i even begin to love myself?", "subreddit": "BodyAcceptance"}
{"post_id": "bo1uc7", "created_utc": 1557744006, "title": "I'm so scared that I'm destroying my body", "author": "queer_artsy_kid", "self_text": "I've struggled with eating disorders since I was 11, and developing severe anorexia that early in life stunted my growth to the point where I ended up losing an inch. I'm 20 now but I'm small and frail and my whole life I thought that getting to this point would make me happy but I'm not. I fucking hate it because I finally realize the amount of irreparable damage I'm doing to my body. I bruise extremely easily, so my legs are covered in bruises and my bones and my joints hurt and I've been losing a lot more hair than usual when I shower. I used to not care about the long term effects of my disordered eating because I figured that I'd probably end up killing myself before I turned 25. But since I started getting actual help and been able to go to DBT, for the first time in my life I don't want to die I actually want to live, and for as long as I can. This meant that I needed my body to last a lot longer than 5 more years, which honestly terrified me because of the countless times my nutritionist told how important your early 20's are for your final stages of growth and development which ultimately impacts your heath throughout the rest of your life. I feel like I've cheated myself out of being the strongest version of myself, instead I'm a frail and weaker version of myself who'll now have to deal with way more health problems later on in life because I starved my body for so long that I don't even know how to eat normally, I feel so pathetic. Restrictive eating has even become a go to coping mechanism for me to feel more in control of my life, whenever things are getting too stressful. This is a very hard cycle to break and I just feel overwhelmed with it all.", "subreddit": "BodyAcceptance"}
{"post_id": "bo4fdo", "created_utc": 1557759008, "title": "MetaMonday: Complaints, Questions, Conversation", "author": "maybesaydie", "self_text": "Use this opportunity to ask questions you may have for the mods or just converse among yourselves.\n\nWe are looking for mods from Asia, Australia, New Zealand and Hawaii. Weekend availability important. Community membership is required. If you're interested send us a modmail message.\n\nSelfie Sticky arrives on Monday May 27, so get those progress pictures ready.", "subreddit": "fatlogic"}
{"post_id": "bo7r97", "created_utc": 1557774670, "title": "Scared to be me", "author": "contributingquietly", "self_text": "I’m really struggling to come to terms with my body. I’ve recently gained around 1.5 stone (from stress) and am living in a city centre where I don’t really feel safe. \n\nI am okay with my body, but don’t weigh myself. I went to the doctors today and they made me and now I just am so self conscious. I can’t stop feeling like I’m hideous and don’t know how I got this way, I am starving but can’t bring myself to eat. \n\nI’m really just stuck - any tips for accepting being a bit chubby rather than falling into unhealthy patterns of trying to throw up food/ not eating at all?", "subreddit": "BodyAcceptance"}
{"post_id": "bo9zjo", "created_utc": 1557785097, "title": "Malls are unhealthy places for people with low self esteem", "author": "maddiokii", "self_text": "The changeroom is like my worst enemy. I have so many flaws and not small itty bitty ones. But big ugly ones. And they don't just stop me from feeling sexy and my age they stop me from being able to do things. 💔 I just wished a car would hit me after leaving the mall.", "subreddit": "BodyAcceptance"}
{"post_id": "bocbid", "created_utc": 1557797450, "title": "Question", "author": "minecraftgamecool", "self_text": "i made this account just for the purpose of asking kind of private things, with full privacy. so that’s what’s with the username\n\ni would love to love my body, but i just can’t seem to find a reason to. no matter how much people try to tell me that weight doesn’t matter, looks don’t matter, it’s about the inside, it just goes through my head and out my ear. because, everyone, yes you, even if by a bit, definitely takes looks into factor of attractiveness. everyday i see boys with abs, muscles, and perfect faces. i have flabs, no muscles, and a lack of eyebrows, almost to the extent of no eyebrows. i started using eyebrow pencils and other things to combat that insecurity, but it was met with being called homophobic names (i’m straight). plus, i’m below average in “length.” everyone else i know is above me, and if just makes me wonder, for all the reasons listed above, why i should love my body.", "subreddit": "BodyAcceptance"}
{"post_id": "bodvo3", "created_utc": 1557806616, "title": "Tips to appreciate my body (especially my boobs)", "author": "musical_fanatic", "self_text": "Everyone around me is \"filled out\" and \"thick\" meanwhile I'm still skinny, small and thin. My bra size is 32A l. I've been the same weight (80 to 85 lbs.) for years and even my best friends has a better bodiea than me (she just keeps gaining weight...)\n\nI want to start to appreciate my body more, especially with summer around the corner.\n\nAny tips?\n\n(Also posted to r/smallbooblove)", "subreddit": "BodyAcceptance"}
{"post_id": "boin2c", "created_utc": 1557838914, "title": "Thank you for being a great support system", "author": "theDuckandtheChick", "self_text": "I just want to say, I’ve only just started posting here and this is the kindest, most supportive, most helpful sub I’ve visited on Reddit. Thank you so much. I wish I had friends like you IRL. *hugs*", "subreddit": "BodyAcceptance"}
{"post_id": "boipen", "created_utc": 1557839274, "title": "Fatlogic is looking for a few good mods", "author": "GetOffMyLawn_", "self_text": "We are looking for some additional mods, preferably in in the Pacific-Asia time zones.\n\nMod duties will include \n\n- Reviewing the Unmoderated Queue and Approving or Removing posts.\n- Reviewing the Modqueue and responding to reports and Automoderator actions. Both of these queues need to be checked multiple times a day.\n- We expect that you will install the r/Toolbox extension to perform these duties. We have customized Toolbox for our sub.\n- Responding to Modmail.\n- Communicating with the rest of the mod team as necessary either via Slack or Modmail.\n- Familiarity with Automoderator configuration or CSS is a plus but not a requirement.\n- Experience is not necessary, we have a wiki that describes mod duties in detail.\n\nIf you're interested please fill out and submit an [Application form](https://forms.gle/RLfgC3WRK7nRYGqz8) to be considered.", "subreddit": "fatlogic"}
{"post_id": "bok5k1", "created_utc": 1557846667, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "boz4gq", "created_utc": 1557933113, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "boz8bl", "created_utc": 1557933631, "title": "I was able to see my body as beautiful for the first time ever", "author": "sabaping", "self_text": "Small tw for talk of an eating disorder\n\nI've had self confidence issues quite literally for as long as I remember. 7 years old is the youngest age I can remember thinking that no one will ever love me because I'm fat and ugly. \nI made myself throw up for the first time in 7th grade after having spaghetti at my grandma's house. This only went on for a week, but it made me addicted to disordered eating and behaviors. I was constantly looking up pro-ana \"\"diets\"\" and such, but my attempts always failed. \nThen last year, after graduating from high school, I started cutting out foods. First red meats, then soda, then cutting down on bread and such. Swearing off fries and candy. This escalated into me starting the \"IU diet\" in august.(small fact, IU actually had/has an eating disorder, self admitted, so this diet is literally what a woman going through hell ate daily) Since then, I have been deep in an eating disorder. I've spent the last 9-10 months restricting to extremely low amounts of calories and purging often. \nI know I didn't have the most drastic weight loss, and I haven't been battling an active eating disorder for years like others. But today I was able to look myself in the mirror, naked, and think, \"There is my body. And I think it looks amazing.\" I truly felt that I had a wonderful, nice, beautiful body. This is the first time I have thought this in my entire life. Never once as a kid did I have any ounce of confidence. And that makes me insanely happy. \nI'm still not ready to recover or stop restricting, but baby steps. Although, this baby step feels GIANT.", "subreddit": "BodyAcceptance"}
{"post_id": "bpdqn2", "created_utc": 1558019473, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bpk7bx", "created_utc": 1558051847, "title": "I hate my body despite being “skinny”", "author": "tinycurlie", "self_text": "When it comes to this topic, people never understand or believe me, they end up attacking me saying “it’s not a real issue”, but to me it is very real. \n\nI am naturally very skinny, no eating disorders or anything. I’v heard so many negative comments about my body, I hate it now. I was called anorexic, unattractive, unpleasant to look at, not curvy enough.... I am also constantly pressured to eat more, even when I’m obviously full and can’t keep going. \n\nPeople say I should not complain since i’m skinny, but the comments I hear made me hate my body and what I am. Gaining weight is a struggle for me. I wish it was as easy as people think.", "subreddit": "BodyAcceptance"}
{"post_id": "bproox", "created_utc": 1558101931, "title": "Really dislike my body. It’s so abnormal", "author": "cool_bananaa", "self_text": "I’m 6 ft talk but I carry weight in my arms and tummy and have kinda broad shoulders and upper body but narrow hips and no waist. \nMy boobs are pointy and very small and I have big areola which makes them look even weirder. My bum literally looks like my back,it’s so flat and it’s very square from the back and I have pretty big hip dips. \nIv been doing weights for over two years now and have been working on trying to grow my glutes but they just don’t change size no matter how hard I work out and how heavy I lift Or how many bulks I do the weight never ever goes to my hips or bum. My mum has a pancake bum too so it must be genetics. \n\nThe thing I find so hard about this is that I’m trying my hardest to change my bum and working out to try and improve it but it’s just not working and it kills me! It’s not like I’m sitting around wishing I had a perky bum and not doing anything about it, I’m actually actively trying to improve myself but it’s just not working. \nThe only way I will be able to change it is with surgery and I don’t have the money for that atm. I just can’t deal with looking like this, it makes me want to kill myself, I don’t know what to do :( \nDoes anyone else struggle with a flat ass and square hips? I feel so abnormal cause so many women I see in public and online don’t look like me and most have some sort of an ass and hips.", "subreddit": "BodyAcceptance"}
{"post_id": "bpsi96", "created_utc": 1558106024, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bpu6o3", "created_utc": 1558114304, "title": "Everyone in my family has curves except for me.", "author": "roseauraqz", "self_text": "I really want to learn how to accept my body. Everyone in my family gains weight on their hips and thighs, and they have a small waist and wide round hips with almost no hip dips and heart-shaped butts, except for me. I am an inverted triangle, with no waist, narrow hips, and 20-inch shoulders despite being just 15, and 5’4. At least if I was tall like the rest of my family, everything would be more stretched out and look more proportionate, but I look short and stout because of my shape. My 14-year-old sister is 5’10, my mom is 5’11. All of my cousins are 5’7 to 5’10 also. I gain all of my weight on my tummy so I look 3 months pregnant all the time while having super skinny lower legs and naturally muscular thighs, despite being extremely sedentary. My 36DD boobs paired with my shoulders give me a V shape, which is the opposite of what I want. I look like a man, while everyone else in my family has beautiful curves. How can I accept my body when I’m the only person in my family without a nice one? Please help!", "subreddit": "BodyAcceptance"}
{"post_id": "bq4zli", "created_utc": 1558192193, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bqmqqy", "created_utc": 1558303432, "title": "Disgusting", "author": "lizah206", "self_text": "My family consists of 3 average sized people.  My sister recently told me it disgusts her to watch me eat. My mother and sister will both remove food from my hand and plate and throw it in the garbage.  I get that they are being helpful since i am obese, but why does it hurt so much.", "subreddit": "BodyAcceptance"}
{"post_id": "bqnnpc", "created_utc": 1558308449, "title": "I love my body, but i can't believe someone else could", "author": "fixrella", "self_text": "Anyone else feels like this? Is really contradictory and makes me feel great a moment and disgusting the next. \n\nI don't think there's a lot more of clarification for this except to add some context. I'm 19 and I've struggled with my appearance a lot. I either look at my body in the mirror and love what i see and touch or undress looking at the floor before showering because i feel like i might cry if i catch a glimpse of myself. It's really exhausting.\n\nBut even when I'm feeling great about myself there's a little voice in my head that tells me how long I've struggled to feel this good and that no one else feels like that. It's hard to explain, but sometimes I feel like the (positive) perception of myself is completely fabricated in a effort to feel okay. \n\nThis makes me incredibly insecure in everything I do and makes me question people's attitudes with me. For example, if i feel like someone likes me (and even more if I do something about it, like talk to them), the next day I'll \"scold\" myself for being delusional. But again, at the same time i kind of like how i look? As i said, contradictory as hell.", "subreddit": "BodyAcceptance"}
{"post_id": "bqvu1z", "created_utc": 1558360530, "title": "Ongoing stress with appearance, I dislike my stomach so much ! I just want peace with my body", "author": "Foxwood2212", "self_text": "I have an growing hate for my body appearance, it has always been there since I was old enough to compare myself.. maybe 10 or 11, I fear it won’t go away ever.\n\nThe trouble is outwardly I am tall and have the illusion of being thin with clothes on. So when I complain everybody is like shut up you could model, and invalidate my feelings and worries.\n\nBut they don’t see that I am skinny fat, my stomach sticks out especially after eating and my belly looks ugly. \nI just want to flaunt my stomach occasionally like other girls do but I hate that I am not thin enough and don’t have an elongated belly button? Mine seems to be hooded making me look fatter. \nIf that makes sense probably doesn’t. \n\nI have attempted modelling twice just to try it out. Each time I wasn’t good enough and was dropped. \n\nI have been told to slim down which I couldn’t as I have naturally large hips (38 inches is the smallest I can go) and waist can be 25 if I go on a bare minimum diet.  And all these models fit in size 8 I really just can’t. That and I am not as photogenic as they thought sad but lol.\n\nSo there’s a voice in my head telling me I should go back to being this thin , as right now I am not on a diet. \nI just want to live!\n\nNot worrying about what I eat every meal and to not feel guilty because I’m not exercising or restricting myself in any way. But as soon as relax I look myself in the mirror and see that I have ballooned and see a bloated not very summer ready body ! It’s a cycle.\n\nI have an upcoming holiday with uni friends and I am fearing they will all be wearing bikinis and I want to but I can’t I have never done so because my body is an embarrassment. \n\nAlso I always have dark arm pits for some reason so can’t flap my arms about too much...\nI just find it so hard to live myself when so much needs fixing. \nAnd these things don’t seem to be issues for entertainers I see in the media or anyone else, everyone has it good, flawless.\nIt is all so petty ! over thinking my problems till I’m sick but it’s really affecting my happiness and confidence, I can’t stop thinking about it. \nI am on the waiting list for body issues and eating disorders since that has been in my life.  \n\nI just want to know if anyone else struggles: how are you trying to overcome your obsession.", "subreddit": "BodyImage"}
{"post_id": "bqwr7o", "created_utc": 1558365008, "title": "Meta Monday", "author": "GetOffMyLawn_", "self_text": "Next Monday will be Selfie Monday! So get ready to post your pics.\n\nToday is the usual Meta Monday, so rants, raves, pet pics, questions, whatever. Have a good one.", "subreddit": "fatlogic"}
{"post_id": "br19n2", "created_utc": 1558386012, "title": "Quick little bedtime note y’all", "author": "CadaverCrossing", "self_text": "Just wanted to remind every single person here, whoever might be reading this, that **you** are deserving. You deserve love. You deserve happiness. You deserve life. You deserve everything good thing imaginable. You are strong and you deserve to be accepted for who you are, how you look, and how you choose to live.\nHave a good night, y’all :)", "subreddit": "BodyAcceptance"}
{"post_id": "br6t96", "created_utc": 1558419056, "title": "How do I get over this extreme insecurity?", "author": "lailamajnu617", "self_text": "Hey guys, I’m at a point where I can’t even watch TV anymore, I can’t enjoy things people normally do. The idea of going to movie with a boyfriend terrifies me. I’m insecure about my body but even more insecure about my face. My ex boyfriend once told me I’m jealous of celebrities ( when all I said was “can we talk about something else?” ) which made me feel like he thinks they’re better than me. I know it’s my insecurities and not his fault but I just wanted to give some context. Btw, I’m sure I’m still in love with him and we’re actually on good terms, but I’ll never forget what he said to me unfortunately. It’s been four years and every time I see a celebrity, that comes to mind. And we are constantly surrounded by celebrity culture so I know I can’t even ignore this. I deleted my instagram account but I’m already homeschooling and don’t have a social life. So I do want to get back on insta, does anyone have any clue how I could be more normal and less insecure about myself ?:/", "subreddit": "BodyAcceptance"}
{"post_id": "br97f2", "created_utc": 1558437937, "title": "Art Show for Fat People not Advertised Well Enough Because of Fatphobia", "author": "7i1i2i6", "self_text": "Body Positive Drama https://imgur.com/gallery/qmAU2Pb", "subreddit": "fatlogic"}
{"post_id": "brbkcu", "created_utc": 1558451430, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "brettr", "created_utc": 1558467443, "title": "Anyone diagnosed with BDD?", "author": "[deleted]", "self_text": "I was diagnosed after starting therapy after having my third child. I do weekly therapy and I’m working on some baby steps my therapist recommended to help me accept my body. I have severe scoliosis (had spine surgery) and so my body is disproportionately squat (I basically have no waist, my spine/torso didn’t grow post surgery). Has anything helped you besides therapy? Supplements, etc for anxiety? I know about medication but trying to hold off on that.", "subreddit": "BodyAcceptance"}
{"post_id": "brfw64", "created_utc": 1558472703, "title": "Does anyone else feel that changing room mirrors are just the worst?", "author": "universallyglo", "self_text": "I’ve been feeling good about my body for a while now. I’m curvy, have stretch marks and cellulite, my thighs jiggle a lot, and I have come to appreciate all of that. I even suggested to my friends that our next holiday be a beach one, so I can take the next step of unapologetically wearing a 2-piece in public.\n\nBut today, I stepped into the changing room. I pulled down my trousers and my god, the feeling I had, looking in the mirror, was overwhelming. I don’t know what it is about changing room mirrors that makes everything so *vivid*. Maybe the lights are brighter, or the are mirrors cleaner, I don’t know. But in that moment, I saw ‘imperfections’, everywhere. I am not going to go into detail, but what I saw in my reflection, particularly of my legs, was grotesque. A lot worse than I ever thought they looked like in my mirror at home. I wanted to cry. I felt myself transitioning back to hating myself. In that moment, I saw a monster. And I know my brain is playing tricks on me. I know the hatred I have for my body is due to the false societal beauty standard we have been conditioned to believe in. But that feeling in the changing room today was so intense. So overwhelming.\n\nI came home and cried and cried. I just couldn’t stop crying. Everything I had learnt, every part of my body I had grown to love over my body-positivity journey, was gone, just like that. I was back to hating myself. I was back to wanting to starve myself. I haven’t been on a diet for 6 months - 6 whole months of nourishing and looking after my body. But today I told myself I am not allowed to eat. For the rest of the day I didn’t eat anything. I’m starving. I’m doing my finals rn and I have so much studying to catch up on, but right now I can’t because I’m starving and dizzy. At this moment, I’d rather be skinny a month down the line than pass my exams.\n\nAnd this holiday I planned with my friends? I’m going to tell them I can’t go. I’m going to tell them I don’t have the money, or I’m just too busy to go. I just don’t think it’s fair to subject the people on that beach to look at my grotesque body. And I know that feeling of self-consciousness will be intensely awful. I’d rather stay in the comfort of my own home.\n\nIn the space of a day I’ve fallen right back into my old habits. The hatred I had for myself before my bopo journey is back in full force. I feel so lost. I feel hurt, both physically and mentally. All of this because I decided to step into a brightly lit changing room today. I don’t know what to do. The only thing I *know how* to do is not eat.\n\n\nEDIT: Thank you so much for the responses guys. They really helped to reassure me. It’s bittersweet because it sucks that we’re all made to feel like shit in the changing room, but it’s nice that so many people feel the same, meaning it is probably the fault of the changing room and not us 💕💕", "subreddit": "BodyAcceptance"}
{"post_id": "brge16", "created_utc": 1558475216, "title": "Born with Extra Nipples", "author": "WVJeepee", "self_text": "I’m a 23 year old guy that was born with 2 extra nipples right below the usual 2. They are smaller in size (about the size of a pea) and are symmetrical with each other. I know it’s not uncommon, but I can’t come to accept them. \n\nI won’t take my shirt off infront of anyone, besides my girlfriend. The thought of being in public without a shirt on just gives me the heeby jeebies. \n\nMy girlfriends family and I are taking a week long beach vacation here shortly, and I’m about to the point where I don’t care about hiding them anymore. It gets tiresome and I dwell on it worse. \n\nShould this be something I’m ashamed of, or should I just let it go?? I’ve talked to my dermatologist about getting them removed, and she said that there would be a scar left over if I did. \n\nAny help, insight, or opinions about this would be appreciated!!!\n\nThanks!", "subreddit": "BodyAcceptance"}
{"post_id": "bri70e", "created_utc": 1558485618, "title": "Mom won't stop commenting on my weight", "author": "AnAnnoyingcoconut", "self_text": "I'm 16 and my mom won't stop commenting on my weight. Really no one else comments on my weight, but my mom keeps on doing so and it really frustrates me. I can't just live my life without being bombarded with how fat I am and how I need to lose weight. She just does it so casually and it really hurts. Like sometimes I would be in my room studying or doing something and she would come in and touch my stomach and tell me that it's getting big and that I need to lose weight. And sometimes she would say something like \"do you really want to go out like that during the summer? You would be alot prettier if you lost weight.\" What's worse is that once I went to the doctor(not related to weight. It was because I have asthma) and during the check up the doctor asked me to step on the scale and he said that my weight is ideal for my weight and height. But my mother was there and responded with \"no she needs to lose weight.\" I also remember that once I went to ask my mom if I was fat and she said \"yes have you seen how huge your thighs are?\" It's really frustrating. I can't breathe without my mom commenting on my weight although I'm perfectly healthy and I think that I look fine. But my mom constantly telling me that i look bad is just really starting to get me.", "subreddit": "BodyAcceptance"}
{"post_id": "brj3bl", "created_utc": 1558491066, "title": "Decreased sex drive", "author": "Background_Cheetah", "self_text": "Does anyone else feel when their image issues spike it damages their sex drive? It used to be much higher but now it's almost nonexistent. I'm super lucky to have a partner who doesn't hold that against me or judge me for it.", "subreddit": "BodyAcceptance"}
{"post_id": "bro1jq", "created_utc": 1558527250, "title": "My friends are dieting and I feel guilty for not joining.", "author": "mcwychbitch", "self_text": "So I tried many diets, ended in bad mental health, so I stopped dieting and tried to accept myself.\n\n&amp;#x200B;\n\nMy best friends go to a diet club, and one text me saying that they had gained weight and were really upset. I comforted them cause I'm a fucking doormat, and I said I would try not to lecture them about diet culture. They responded saying they would appreciate if I didn't because they felt very vulnerable after gaining. They then went back to the class and won an award for losing the most weight, or whatever the fuck, and now I'm like 'Oh so YOU'RE vulnerable, GOD your life is so HARD!'\n\n&amp;#x200B;\n\nIt made me think how I feel vulnerable all of the time, but still encourage them to talk about their recipes and weight loss, because they are excited about it! It honestly felt like a fucking slap in the face. So now I'm sitting at work getting emotional thinking about how maybe if I miss dinner tonight then I'll feel better, because I don't deserve to eat becuase I'm a chubby bitch.\n\n&amp;#x200B;\n\nI constantly feel vulnerable, I guilt myself constantly about not trying to get thinner. And I thought I could at least rely on my friends. I just need a rant, feel free to join in.", "subreddit": "BodyAcceptance"}
{"post_id": "brpp71", "created_utc": 1558536560, "title": "New body image/acceptance project on Instagram called \"Vitruvian Women\" with daily stories and portraits (link in description)", "author": "aandthe", "self_text": "This new project, Vitruvian Women, highlights the many shapes, sizes and proportions of the female form. This includes women of different ages, ethnicity, skin tones, and physique. Underneath each print is a statement from the woman about the image - her thoughts about that part of her body, the changes that have occurred, her struggle, her acceptance, or other body image/positivity message or story. The purpose is to give voice to these women, provide a platform for these stories, and encourage social engagement. https://www.instagram.com/reveal_mission/", "subreddit": "BodyAcceptance"}
{"post_id": "brpysc", "created_utc": 1558537918, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "brt9tr", "created_utc": 1558554470, "title": "I have 2 things I don't like about my body and they're pretty glaring", "author": "peepocho", "self_text": "My straight waist (and I get badly bloated most days). I would look like a regular girl if I didn't look as weirdly Frankensteined together as I do. I have broad shoulders and a straight waist (when most girls have a waist). It looks like a bigger person is growing out of a smaller person and I barely hear about anyone else having this body type, making me feel alienated.\n\nI recently gained weight too", "subreddit": "BodyAcceptance"}
{"post_id": "brv974", "created_utc": 1558564380, "title": "I still feel slightly fat", "author": "ARandomHamiltonFan01", "self_text": "I'm slightly underweight at 107 pounds for 5'4, 18 years old (F) and I don't want to loose weight,(maybe just a few pounds though). I started a low carb diet 5 months ago and it helped me to lose some of my skinny fat in my belly. (i don't exercise often due to frequently being injured so I rely on diet). I'm still not satisfied with how my stomach looks, but I can finally tolerate it. another thing is that my lower calves are fat, in other words, I have cankles. Even when I was a runner I still had fat ankles. It may be due to my genetics, but I still hate how my an les look. I see girls who weigh more than me and they have slimmer calves than I do. back in my cross country days, I always felt ashamed seeing all the other girls with their nice calves and skinny runner ankles while my ankles were chubby despite me running the same amount as them and being underweight. I had worse body image problems then so I restricted to 1800 calories while running 5-6 miles a day. Now I recovered for the most part and eat 1600-1700 calories with a sedentary/low impact exercise lifestyle. I just still can't get over how my calves look fat, I really want slimmer ankles.", "subreddit": "BodyImage"}
{"post_id": "bs44dg", "created_utc": 1558624237, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bsb7by", "created_utc": 1558662805, "title": "Mom still comments on my body hair (24F). Not sure how to respond.", "author": "miphyspice", "self_text": "Called my mum for her birthday. She told me to not forget to shave my legs. Asked her why she was telling me this. She said so that I would remember. I said it was not her business. Then we ended the call and I cried. I know it’s her thoughts and words, but they still hurt. How would y’all respond?", "subreddit": "BodyAcceptance"}
{"post_id": "bsc8t8", "created_utc": 1558669539, "title": "Accident", "author": "maddiokii", "self_text": "Anyone here had an accident that left their body damaged/deformed? Did you ever recover from the accident/injuries?", "subreddit": "BodyAcceptance"}
{"post_id": "bsga0z", "created_utc": 1558700650, "title": "Body Acceptance/Body Positivity research seeking participants", "author": "Mirandy-42", "self_text": " Hello /r/BodyAcceptance! I have a few questions to ask,  \n\nDo you regularly use this subreddit or other online Body Acceptance/Positivity Communities?  \n\nWould you like to see increased awareness of Body Positive Ideas? \n\nWould you like to contribute to research into Body Positivity?  \n\nAre you a woman aged over 18?  \n\nDo you live in the UK (especially the South East of England)?  \n\nIf you answered yes to these questions, then I would really like to hear from you! \n\nAt the moment there is little research looking at the psychological impact of Body Positivity and the online communities where the ideas are promoted. I want to change this!  \n\nAs part of my training as a Clinical Psychologist I am running a Doctoral research project and interviewing people like you about their experiences within online Body Positivity communities. This project will delve into what you are taking from the ideas and the community, and lay the foundations for this to be used in future psychological research and clinical practice.  \n\nI hope this sparks your interest!  \n\nIf you are interested in taking part please contact me, Miranda Samuelson, at [m.a.samuelson987@canterbury.ac.uk](mailto:m.a.samuelson987@canterbury.ac.uk) for further information.", "subreddit": "BodyAcceptance"}
{"post_id": "bshuaz", "created_utc": 1558709448, "title": "One inverted nipple", "author": "idccccccc", "self_text": "I have one inverted nipple and this bothers me a lot.  Does anyone else have this? What do you do?", "subreddit": "BodyAcceptance"}
{"post_id": "bsi3z7", "created_utc": 1558710826, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bsjv7z", "created_utc": 1558719760, "title": "Feeling insecure again...", "author": "blemishedcucumber", "self_text": "I have times where my self esteem is worse than others &amp; right now it's not good again.\n\nI'm feeling insecure about my breasts, I feel like since they are smaller I'm not much of a \"woman\". I know this isn't true, because I see women with smaller breasts and still think of then as a lady, but to me I feel insecure about it because I would prefer to have bigger breasts (and symmetrical breasts too). I feel like my proportions are are off since I have smaller boobs, I feel like my shoulders are a bit broad, but idk for sure about that and my hips and thighs are bigger. I also have stupid hip dips so fuck me right?! Haha. I just feel like a mess of a body today...", "subreddit": "BodyAcceptance"}
{"post_id": "bsn7xw", "created_utc": 1558736790, "title": "I am insecure to a ridiculous, painful degree. I don't know what to do.", "author": "enough-throwaways", "self_text": "Let me give you guys some background. I never really struggled much with physical insecurity before. I recognised features of me that were subpar, but just sent them to the back of my head. This does not mean I viewed myself as gorgeous or anything, but I did think I was decently good-looking. Anyway, I didn't really think about it much.\n\nI have turned 17 this year, and perhaps this is why this has begun... but I've faced how ugly I am. Or how I perceive myself to be. I don't know. But my perception is my reality right now. And it happened all at once in the beginning -- I stared at the mirror and tallied up every single thing that was wrong. It was a fresh, unique kind of sting and hurt. Because I wasn't just sad that I was ugly. I was sad that I wasn't as pretty as other girls are, I was sad that my personality wasn't as well-interpreted as it could be because of the subconscious impression we *all* make of people based upon their looks. I was sad and horrified and embarrassed that I look like I try too hard. I love showy clothes, and when there's an event, I love going all out with dresses, makeup and heels. And I was sad that I looked like a clown trying to fit in.\n\nIt is very difficult for me to full convey the degree and nature of my insecurity – partly because it is extremely nuanced, and partly because it is composed of so many thoughts, feelings, behaviours and experiences that I cannot describe all of them in one post.\n\nBut what I really want to ask for help in is this. I've gotten to a point that when I see a pretty girl, I feel really jealous and sad. I remember all my shortcomings, I remember all the things I mentioned above and more. It cuts into me. And I stay sad and jealous and insecure and weighed down all day. Today was such a day. It's been hours since I saw that girl (and of course, my eyes scanned to every other girl, and I managed to find so much that was better in them than in me). And it's just fucking pathetic. Jealousy, envy and insecurity are really ugly features. They're horrible. They are the hallmark of low self esteem. And I really want to stop feeling that way. I can't cry whenever I see someone prettier than me. I can't do this. And I don't know how to stop. I'm trying to distract myself and focus on other things – I've been studying a lot (and yet, I saw that girl in my goddamn exam hall). I'm trying to better myself physically – eat healthy, go to the gym, take care of skin and my hair – and tell myself I'm trying to achieve the best version of myself which I can given my genetics right now. It's not working. Or it does for a while, and then I see someone and let it shatter me. I think also, the second way of trying to better myself isn't going well because I'm finding it really hard. I fall off the bandwagon a lot in all of those things because I'm in the middle of exams. I also used to fall off the tracks when I wasn't in the middle of exams, but I'm trying to better my discipline. I just find all of those things so hard. And I guess if I'm not doing them well enough, I have no right to complain. I don't know. I feel pathetic for finding basic self care things so taxing.\n\nSo... yeah. Maybe someone relates, or has some advice. I don't know. Thank you for reading.", "subreddit": "BodyAcceptance"}
{"post_id": "bsrdaj", "created_utc": 1558764852, "title": "I HATE my boobs", "author": "bye_bye_love", "self_text": "I’ve always had body confidence issues, but my main point of self consciousness is my breasts. Ever since I was around 14/15 I noticed my boobs weren’t perky, and my areolas are a lot bigger than most. Now I’m 18 and my breast are around a D/DD but I hate them and they leave me SO self conscious, they seem so saggy to me and I don’t like going braless in public or even wearing certain bathing suits. I’m scared to show anyone, or if I’m ever intimidate with a guy. I’m scared he’ll think they’re extremely unattractive and that would kill me, I’m also not confident with my lower area. Getting surgery would not be plausible at the moment and I obviously don’t have money for it. I know I’m beautiful the way God made me and there’s MANY others like me, but how can I learn to love myself?", "subreddit": "BodyAcceptance"}
{"post_id": "bst24p", "created_utc": 1558780111, "title": "Why do people feel like they have the right to tell me I look gross?", "author": "sowachowski__", "self_text": "\nYou know, after some time without getting comments about my weight I was starting to think that maybe my body doesn't look THAT bad. And then yesterday at school this classmate comes up and randomly says:\n\"oh my god. You're so skinny. Look at your arms... You seriously need to eat more.\"\nI awkwardly brushed it off and wanted to die for the rest of the morning.\nIn the evening I had dinner with family friends. We were sitting on the couch and I was wearing earphones but I still heard this woman talking to my mom about me. \n\"Has she lost any weight? She looks skinnier than ever. Literally a skeleton.\"\nI just went to the bathroom and cried and then cried myself to sleep on the other couch because if I stayed awake any longer my sadness would turn to anger. It always does. I start by hating myself and then hating everyone that is around me.\nEverything was going so well, I even decided that maybe I should go to the beach this year. Fuck that, I'm not even going to wear shorts and t shirts. After school is over I'll just stay home until it begins again. and maybe eat until I almost puke to make people happy.", "subreddit": "BodyAcceptance"}
{"post_id": "bsvjf1", "created_utc": 1558797029, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bsx1if", "created_utc": 1558805000, "title": "Found my first stretch mark and it's freaked me out", "author": "megana25", "self_text": "I've always grown up super skinny, due to a bunch of things from fast metabolism to eventual eating disorder. I'm thankfully recovered from that, and never really cared how much I ate, as according to my bmi I was constantly underweight anyways. However in the past two months or so, I've started going to the gym and as an effect to that, eating more for strength. Except this morning, my boyfriend ended up finding stretch marks on my bum. This completely freaked me out because theyre the first I ever found on me and while I  understand that I've probably put up weight and gained muscle pretty quickly in the past two months, but I've been on edge all day over it. I guess growing up, all people would ever say to me is how skinny I am and I see stretch marks and even though I know they're nothing to be ashamed of, the only thing thats in my head is that I'm getting fat, im scared that people aren't going to look at me anymore and tell me how skinny I am but how I've put on weight. Has anyone else experienced this? Or have any advice on how to get myself out of this stupid mind set?", "subreddit": "BodyAcceptance"}
{"post_id": "bszzxa", "created_utc": 1558820433, "title": "So disgusting", "author": "[deleted]", "self_text": "God my body is horrible. Fucking trash. Unattractive. I just want to add scars and make it uglier. Might as well go the whole way. What a fucking hideous monstrosity. Shouldn’t be called a woman, or a human being. Fucking horrible. Disgusting. Fucking horrible trash. My face is so bad. Disfigured and unattractive. Ugly so ugly. Everything about me is ugly. No matter how much makeup or hair products or clothes I put on it cannot hide how fucking pitiful and vomit inducing piece of fucking shit I look.", "subreddit": "BodyImage"}
{"post_id": "bt4vuk", "created_utc": 1558853023, "title": "How do I love my body when I’m constantly surrounded by people who don’t? [20F]", "author": "throawhy", "self_text": "Lately I’ve been struggling with my body and accepting it for what it is. Summertime is my least favorite time of year because I usually prefer to cover up. Not only is my body weirdly shaped, but I’m very pale (Irish redhead), and I feel like I always look awful in comparison to my family. \n\nMy sisters inherited the body shape of my mother, and I look more like my father, who comes from a family of football players. I’ve seen my body at a range of weights, and have come to realize that there’s nothing I can really do about the unfortunate shape of my body. I have wide shoulders, a large rib cage, and narrow hips. Even at an above-ideal BMI, my individual ribs are visible. \n\nBoth of my sisters (one older, one younger) have a more or less ideal build. They are both athletic, have tight stomachs, muscular thighs, and have at least some skin pigmentation. In general, I try to avoid giving attention to people who have “ideal” bodies (in magazines, on Instagram, etc.), but it’s difficult to avoid giving attention to my own family. \n\nWhenever we take pictures, I feel like I stand out in a very negative way. I’ve tried talking about my insecurities with my mother, but all she suggests is losing weight or using tanning lotion. Whenever my sisters comment on how I look, it’s usually some form of backhanded compliment. \n\nAs much as I don’t want to care about how other people look in comparison to me, I do. I want advice on how to love myself, or even where to begin. I feel lost and like I have no one who understands my body and that I can’t do much to change it.", "subreddit": "BodyAcceptance"}
{"post_id": "bt9s30", "created_utc": 1558887498, "title": "One guy said it is my fault to be shorter than average", "author": "minisoya", "self_text": "I live in a country where men select tall women. \nHe said I could grow taller if I had done some exercises and had taken some growth pills. He said I have no right to complain about height and mens preference for tall women. How could he think like that? Height is %90 genetic. Enviriomental things effect but it can only make me reach my maximum height my genetics let. \n\nI should note that my father is 5'9\" and my mother is 5'6\". I have a sisted who's height is same as me. I slept well and eat good when I was teen.", "subreddit": "BodyAcceptance"}
{"post_id": "btcmcv", "created_utc": 1558901700, "title": "Feeling bad about my body shape", "author": "greeneyedpinguin", "self_text": "I'm 16 and I feel pretty insecure about my body shape - my skeleton is more of a square shape but I store fat mostly in my thighs, arms and back, which makes me really dislike the way I look. Especially since I'm short and every girl my height around me is skinnier, curvier or sometimes both. I know that I'm still a teen and my body can still change but the thing is that I am an early bloomer and I stopped growing at 11-12 years old, so I feel like I'll be stuck with this awkward body forever. \n\nAt the end I just wanted to say that I usually feel better about my body, tonight is just a bad day. Also, sorry for any mistakes, English is not my native language.", "subreddit": "BodyAcceptance"}
{"post_id": "btgnq2", "created_utc": 1558924765, "title": "10 years of me trying to accept myself...", "author": "Infinitexpo-end", "self_text": "Between all the shapes and sizes.. God chose this fucking mess to be me. \nI hate every single thing of myself. It's not that I want to hate me but everytime I try to overcome it and accept who I am I get bombarded by hurtful comments. Everytime I try to feel good about Myself people start showing me all the reasons  to feel bad.\nAnd having attractive parents makes everything worse.. People look at you as a disappointment, as a mistake, as a freak of nature.\nI always told myself that each person is so busy in himself to actually find time to criticise or care about other people's imperfections.. I can't believe how people find time to get out of their own way and just slap Me with their cruelty..\nMe a freak of nature. I have nothing good in me. I look dead. Im bones and skin.. my face is sunken, my eyes are hallow and my heart is empty.. I wish there could be one nice person who would lie to me. . Tell me that I'm pretty. \nMy own mother never says a thing .. my mother. My own mother doesn't think im good enough.. never said a nice thing to Me.. only after I cry and beg her to know what is so wrong with Me. \nI hate everything ..\nIm afraid to get out show my hideous figure to the world... \nIm so tired of crying every night before I sleep.. wishing I'll die . Im so tired of my life .. \nI want to live . I don't want to keep dwelling om how I look but whenever I try.. People pull me down .. down down ...\nIm 21.. I just want to.. accept who I am.", "subreddit": "BodyAcceptance"}
{"post_id": "btix4v", "created_utc": 1558940831, "title": "New Mentality has Helped", "author": "BetterThan40", "self_text": "I’ve recently been thinking and traveling and adventuring and meeting new people. And I’ve kind of come up with a few thoughts that help me out and thought I’d share:\n\n1. This is the only body I come in. I might not like it, hypothetical people might not like it, but I only come in one size and it’s what I’ve got right now in this moment. If you want more, check in tomorrow to see if anything’s changed but in the mean time, this is me and I don’t get anywhere imagining myself as “better.”\n\n2. This is the body I have when I feed my body what it wants and exercise how much it wants. I had a “better” body when I starved myself, I had a “better” body when I purged with exercise and vomiting, but that isn’t what I’m doing anymore. This is how my body looks when I say “fuck you, eating disorders” and even if I don’t like it every day, that’s something to be proud of. This body weighs more in pounds than I ever have but it’s also the first body I’ve had that says “I refuse to listen to the voice in my head.” And that makes it *better* than all the skinnier bodies I’ve had, even if the rest of the world can’t see it.", "subreddit": "BodyAcceptance"}
{"post_id": "btj87j", "created_utc": 1558943206, "title": "Invitation: new sub /r/MadAtWork is a community managing mental illness in the workplace", "author": "AltitudinousOne", "self_text": "Thanks to the mods of this sub for permission to post the following\n\n&amp;#x200B;\n\n/r/MadAtWork is a positive, forward-facing community for managing the challenges of mental illness at work. Focusing on strategies and sharing insider knowledge. May appeal to anyone with an interest in sharing lived experience managing workplace challenges with mental illness.\n\n&amp;#x200B;\n\nAs we are a very new sub, please post something to help us get started!\n\n&amp;#x200B;\n\nSome possible topic starter suggestions\n\n&amp;#x200B;\n\nDisclosing mental illness\n\nManaging managers\n\nGetting in on bad days\n\nDifficult workmates\n\nWorkload survival\n\nSpecific situations\n\nSelf-care\n\nManaging psychiatrists, doctors, and other support services\n\nWork/life balance", "subreddit": "BodyAcceptance"}
{"post_id": "btmfz1", "created_utc": 1558966456, "title": "It's Selfie Monday!", "author": "GetOffMyLawn_", "self_text": "You can submit your selfies here in this thread.", "subreddit": "fatlogic"}
{"post_id": "btnz83", "created_utc": 1558974337, "title": "My body haunts me everywhere I go", "author": "grvvygrl", "self_text": "TD;LR this post is basically a vent about me hating myself. \nI'm currently at a family gathering for my boyfriend and I'm crying in the bathroom over shorts. I feel so fucking disgusting. I hate my body and I have since I could comprehend any sort of body image, it's always been negative. It sucks being this terrible negative person who always ruins every single fun event bc my whole quality of life revolves around this shell I'm stuck in. I don't want to be here I don't want to eat or play games or laugh or do anything I want to cry and not have to look at me body. Summer is the worst time ever bc it's so hot and I want to be comfortable in my own skin buy every pair of short I own I hate. I hate all my clothes and I look terrible in anything. I'm so fucking top heavy and it makes me feel worse than any other person in the world, I mean who fucking wants a person who has all stomach and no ass or thighs. To top it off my boyfriend is mad bc I do this a lot, but it my defense that last time I got pissed at a family event was bc he was hiding/ deleting messages with any other girl. I'm so stressed out in stuck here all day and the only thing I can think of is smoking and sleeping the pain away. The only time my body isn't on my mind is when I'm sedated or asleep. I feel extremely suicidal. I keep going on off again on again diets and why just why can't I stick with one I wish I could eat like 0 calories a day bc at least then I'd know id be safe from gaining anymore weight. I know I'm rambling right now but I just can't go out there and fake a smile when I feel like I could tear out of my skin and start screaming and breaking down any second. I hate pretending to be happy, the stupid fake laugh and smile like I'm not debating on ending my life as we speak. I hate the body I was put in and I wish i could just have the self control to be perfect", "subreddit": "BodyAcceptance"}
{"post_id": "bto4io", "created_utc": 1558975071, "title": "I cant pass the idea if a guy shows interest to me its because he cant get a tall girl", "author": "Leyylas", "self_text": "I dont forget the time one of my guy friend (!) told me \n\n\"If a guy shows interest to a short girl it is because he cant get a tall girl\"\n\n\nI cant pass this idea whole my life so maybe another reason I struggle in dating is that. If a guy shows interest to me (rarely) I just assume it is because he cant get a tall girl and I am his last option. I dont know how many of you have this feeling but I just cant pass it. It has been years to have a relationship but I have always thought if a random tall girl shows a slight interest, my bf will leave without second thought. \n\nMaybe I am too greedy to want guys \"preference\" rather than their better than nothing option. But it is it.", "subreddit": "BodyAcceptance"}
{"post_id": "btp3iw", "created_utc": 1558979929, "title": "Wanna talk?!", "author": "Yacineben1912", "self_text": "Hi everyone!\n\nI’m working on a project that will help people lose weight and get fit without starving themselves, abandoning the foods they love, or living in the gym, and I would love to get your opinion if you’re someone who wants to lose weight and improve their physique or if you’re interested in fitness in general.\n\nIf you’re available for a quick 20-30 minute call or video chat, I’d love to talk with you. If you’re interested and want to help out, you can securely submit your contact information in the link below, and I’ll be in touch shortly.\n\nSubmit your contact information here: https://yacinebenlebna.typeform.com/to/JLXeO2\n\nThanks again!", "subreddit": "fatlogic"}
{"post_id": "btvfyq", "created_utc": 1559016104, "title": "Struggling to love myself", "author": "Hotbitch27", "self_text": "I am a mom of three in my late twenties. I have three beautiful girls that I teach to love themselves no matter what... but I hate myself. I know its hypocritical but it's the truth. In a world where sexy is being recognized in small and large what is you arnt \"slim\", \"thick\" or \"slim thick\"? What if you aren't shaped like the girls that are plastered all over the internet? I want my husband to look at me and think I'm sexy after having our three children. I just want him to fantasize about me like he used too. What happends to those of us that give our bodies to create life and and don't bounce back? I used to love myself. But no matter how hard I try I feel stuck.... will I ever be welcomed in to the MILF category or will I be left to die as weird shaped mom that bakes way too much for the holidays while her husband gets off to the girls of pornhub? I didn't chose this body... it was what I was given...", "subreddit": "BodyAcceptance"}
{"post_id": "bu166s", "created_utc": 1559056244, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bu211e", "created_utc": 1559060616, "title": "How to feel confident in my own body that is not perfect?", "author": "puglover1992", "self_text": "I have had chest Keloid Scars for years now. Due to that, I have never felt comfortable in my own body. I don't remember that last time I wore anything like a v-neck. I feel so disappointed in myself for being able to not care about what others might think when they see my scars.\n\n&amp;#x200B;\n\nHow do others i guess deal with this?", "subreddit": "BodyImage"}
{"post_id": "buaznh", "created_utc": 1559109642, "title": "Are weddings a big trigger for anyone else? How do you stay centered, selfless, and relaxed at image-focused events?", "author": "lovelylefthander", "self_text": "First of all, I love weddings. Beautiful dresses, emotional speeches, and reuniting with those I haven't seen in a long while. I'm a hopeless romantic but events that have a lot of pictures involved always stress me out.\n\n*In Fall 2017*, I was at a best friend's wedding. All I could think about was weight.  I had just started dating my boyfriend. I had a blossoming eating disorder. I remember stressing about the food there, stressing about the pictures after, crying in the car for hours with my patient boyfriend. I was determined to lose weight and despite his protests, I was convinced that I just needed to lose more weight to keep his affection. This fueled a lot of drama.\n\n*In Summer 2018*, I went to several weddings. It was the year for all of my close friends to get married. My boyfriend and I had broken up, after months of him patiently dealing with my destructive eating disorder, but then me self-consciously cheating on him. Although I had plus-oned him to two weddings, I went alone to all of them. I was very thin, I had to alter my bridesmaid dress.  I had so many compliments, but I had gotten to the dream weight by losing everything. I remember reflecting on the \"love is..\" passage of scripture (1 Corinthians 13) and thinking about all the things that love is...they are all character related, none image related. I was skinny, but I had become unfaithful and self-focused. I was determined to be better.\n\n*In Spring 2019,* my boyfriend and I were back together. I went to his brother's wedding. It was amazing the amount of forgiveness I received. I was a bridesmaid, despite everything.  I had gained back so much, including weight. But I was happy. The night after the wedding rehearsal I took out my stressed boyfriend to eat at a McDonald's and he was just in awe of how I wasn't embarrassed eating in front of him anymore. He told me it was insanely sexy.  I put my heart and soul into helping things run smoothly. I felt so loved.\n\n...but after it was over, anxious thoughts begin to creep in again. I felt self conscious about everything in retrospect, from the speech the bride asked me to do last minute, to the pictures that were released. One in particular haunted me. The photographer caught me off guard and asked me to pose with my boyfriend. Instead of sitting up straight I kind of melted into his arms, slouching and my stomach is sticking out. I spent hours staring at that photo. I'm in a ballgown but I look like a total slob. I don't have many fancy photos with my boyfriend (he never dresses up) and it made me wish that I still had my skinny figure. His brother's wife is a fashion-designer and looks like a supermodel. Image and posing are a part of her career.\n\nI know if I saw that photo when I was heartbroken last summer I would have been so elated to know I was at the wedding, back together with my boyfriend, and had earned back the trust of his family. But I keep slipping back to obsessive thinking.\n\nNow it's summer and I'm starting to get obsessive thoughts again about losing weight in time for the next wedding I have scheduled a month from a half and now.  I want to be thin again but I am worried about losing myself. But I also want to look good next to my boyfriend, his brother, and his fashion designer sister-in-law.\n\ntldr: my eating disorder/self-focused behavior ruined my relationship with my bf, but I looked good in wedding photos as a bridesmaid. Then i recovered and we got back together and attended another wedding (also a bridesmaid) but now I want to lose weight after seeing those wedding pictures so I can be skinny for the next wedding we attend together.", "subreddit": "BodyAcceptance"}
{"post_id": "budowe", "created_utc": 1559130719, "title": "Accepting big boobs.", "author": "PerseveranceSmith", "self_text": "An odd one some people might think, but how do I learn to accept my big boobs?\n\nI'm a 32F and a size 8 (UK). I know a lot of women would like bigger boobs but they're just causing so many issues.\n\nBeyond the vapid (but kind of important to feel good) stuff of never finding attractive underwear and clothes not fitting, they have brought so many more problems.\n\nBras in this size cost a bomb and can only bought in specialist places, until recently I wasn't on a great income so buying underwear was genuinely a struggle.\n\nI also have a joint disorder which means the pressure from them really affects my shoulders and posture (I'm like a busty hunchback these days).\n\nAnd lest we forget that absolutely everyone likes to comment on them. I recently posted an innocent photo of me at dinner in a tank top and all the comments were literally 'omg look at your tits'. Again, some may find this complimentary, I find this depressing, as I'm literally being reduced to these two milk sacks.\n\nNB: I would not consider getting them reduced. I've had enough non elective surgery in my life to not want more unless it's life threatening.\n\nSo how does everyone else cope?", "subreddit": "BodyAcceptance"}
{"post_id": "bufv4p", "created_utc": 1559142716, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bug32o", "created_utc": 1559143815, "title": "How do you people do it??", "author": "littlenerd916", "self_text": "I'm 27f, and i just completely hate myself... I have never been able to look at myself in the mirror ever, and i just hate everything about myself. I'm not that big.. i'm chubby, but i hate looking at my potbelly. i hate looking at the very thing that just makes me ugly as hell. I've never been loved and never will be. i don't know how you guys are just ok with what you have...", "subreddit": "BodyAcceptance"}
{"post_id": "bugoe8", "created_utc": 1559146720, "title": "Is anyone else attracted to their body type on other people, but not on themself?", "author": "d4rkside96", "self_text": "I’m a guy, 22, and I’ve struggled with my weight all of my life. In primary school, I was overweight. In high school, I was obese. Then when I started uni I made some drastic changes and got down to a more normal weight, still with some extra kgs to lose but I was significantly smaller than I had ever been. Then I started going to the gym, and gained a bunch of muscle. I’m now what you would I guess call “thicc”, I’ve got muscle but it’s covered in a bit of fat that’s still there so I don’t have a six pack or anything, my stomach still bulges out a bit, and I have thick thighs and a big round butt. \n\nNow, I’m bi, and I have a great boyfriend who constantly reassures me of how much he loves my body and thinks I’m so attractive etc etc, but I just can’t stand my body most of the time and feel so ugly. I rarely even take my shirt off in front of him because of how ugly I feel like my body is. But the thing that I find strange is, I actually find other guys with my body type so hot sometimes. I’m an absolute sucker for a “thicc boy” with a nice big ass and thick thighs and all round just some meat on his bones. But I find that same body type absolutely disgusting to look at when I’m looking at *myself*, and I just don’t understand why. \n\nHow can I be attracted to a certain body type on other people, but hate it on myself and actually find myself ugly? Has anyone else experienced this?", "subreddit": "BodyAcceptance"}
{"post_id": "bungyl", "created_utc": 1559181497, "title": "I Wish I Looked Like A Pornstar", "author": "natalie098", "self_text": "The reason i’m saying this is because my boyfriend used to watch a lot of porn. I didn’t find out about this until months into our relationship. I told him how much it bothered me and he stopped (as far as I know.) The problem is that I can’t shake the feeling that he wants me to look like the women in porn. He obviously watched it to get off, and I feel like they do that better through a screen than I can right in front of him. He tells me he loves my body but I genuinely believe that he wants more. I wish I looked like a porn star with big boobs, a tiny waist, and a big ass. I know that’s practically unachievable without surgery but it still haunts me.", "subreddit": "BodyAcceptance"}
{"post_id": "buohh5", "created_utc": 1559187824, "title": "How can I make my boyfriend with one eye feel handsome?", "author": "fortyfivetablespoons", "self_text": "I wasn’t sure where to post this, but this sub seemed to fit. My boyfriend lost his eye after someone threw an axe can in a fire when he was 16/17. He’s 20 now and he still struggles with feeling insecure about his eye. To me, and a lot of other people, he is still extremely handsome. He has one beautiful blue eye, a great face shape, nice full lips, etc. It breaks me to see him upset over his missing eye. To most people, its barely noticeable, and just looks like he’s winking all the time (he doesn’t wear his glass eye- he doesn’t like the way it looks). He’s also been in a lot of pain due to the fact that they didn’t remove his optic nerve in hopes that maybe one day it can be repaired. When he breaks down I try to remind him of not only how handsome I think he is, but also of his good qualities. He’s hardworking, funny, caring, and the best boyfriend I’ve ever had. He’s very selfless, and treats his mother so well (a quality i always look for in my partners). I feel like no matter what I tell him, it won’t change the way he feels. I know he has to make the changes himself to feel better, but how can I encourage him and support him along his journey. He means so so so much to me, and it absolutely tears my heart to shreds to see him so upset over something that he can never change. Any advice is appreciated.", "subreddit": "BodyAcceptance"}
{"post_id": "buubtd", "created_utc": 1559229059, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "buvu4l", "created_utc": 1559236678, "title": "Are there any support meetings of Body dysmorphic disorder?", "author": "ParkerBleu", "self_text": "My girlfriend is really having a very difficult time with her body. She is in therapy, but the therapist isn't able to meet her weekly, mostly bi-weekly.  \n\n\nI want to give her the options of other support for her BDD. Her mental health has really suffered the last month.  \n\n\nI am trying to find a online support group meeting like AA or something like that. I have been searching, but found a very small amount of any kind of support regarding BDD.", "subreddit": "BodyAcceptance"}
{"post_id": "buzda0", "created_utc": 1559254690, "title": "Working on body acceptance has improved, but I still find myself obsessing over small details (i.e. calorie counting, pants size, how much I should be exercising every week according to google)", "author": "erkullurrkul", "self_text": "I've gotten better about accepting my body and telling myself \"I want and deserve to feel better\" as opposed to \"I need to lose at least 30 pounds\" has made it easier for me to make better choices in my diet and has even motivated me to exercise even if its only 3 times a week. However, I still find myself looking in the mirror, mostly at my belly, which at this point has swollen quite a bit thanks to a few years of heavy drinking (which I'm proud to say I've cut down on as well :)). As a type 1 diabetic and hypothyroid patient, it's harder for me to shake off any excess weight I've gained over the past few years, sooo as you can imagine my fitness journey has been...frustrating to say the least. \n\n&amp;#x200B;\n\nNow that I'm finally starting to find a good balance between diet, exercise, mentality and self acceptance, this journey doesn't feel like much of a burden anymore. But this belly....these muffin tops.....the fact that a lot of my old clothes don't fit anymore...it still bothers me. I'm not sure if I'll ever reach a point where I'm 100% happy in my own skin and I'm wondering if I'm not alone in feeling this way.", "subreddit": "BodyAcceptance"}
{"post_id": "bv17a1", "created_utc": 1559265150, "title": "It looks to me like my body keeps changing its appearance every single day.. so odd", "author": "Alexisiscool25", "self_text": "I don’t understand how this is a thing, I either think I look good and sexy or I think I look fat and weird.\nI used to be really skinny, and I gained some weight-some in my butt, boobs, and stomach.\nI gained about 35 pounds.\nI was starting to get used to looking at my body, &amp; kinda liking what I saw.. but now whenever I look it seems my proportions are always different. Some days I feel like my boobs look small and some days I feel like they look big or somedays I feel like I’ve lost weight or some days I feel like I still look the same.. it’s the weirdest thing. How am I supposed to feel confident or comfortable with my body when it keeps fluctuating (or at least in my eyes) :(", "subreddit": "BodyAcceptance"}
{"post_id": "bv5z9h", "created_utc": 1559299453, "title": "Photos versus mirror", "author": "mearaowl", "self_text": "Hi,\nIve come to a point where i am fairly okay with how I look in the mirror. I feel like i have come to terms with my body and how it looks, by knowing that I see in the mirror. \nIn pictures however, I look totally different and I feel so much larger in a photograph than in the mirror. At this point I hate being photographed, because I hate the way I look in them. I don’t think I have seen a photo in which I liked myself in many months. Its starting to make me doubt the way I should feel about myself: does the mirror lie? Am I actually that much larger than I perceive myself in the mirror? It stresses me out so much, but I also feel that obsessivily staring at my reflection is not the way to go here.\n\nI cant be the only one; How do you deal with pictures and your reflection? How can I come to terms with the differences in what I look like in them?", "subreddit": "BodyAcceptance"}
{"post_id": "bv8r8i", "created_utc": 1559315689, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
