{"post_id": "am309i", "created_utc": 1549034203, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "am8jft", "created_utc": 1549065982, "title": "I need help, can’t leave my house :(", "author": "onlinefingerprint", "self_text": "I struggled with anorexia and bulimia when I was younger and “overcame” it on my own without the help of any therapist but all I did was just start eating badly and then starving some days to maintain my weight. I stoped smoking recently and started binging, gained weight and can’t fit in my clothes. I can’t leave the house right now. I got invited to a night out with my friends but I can’t go because I dont know what to wear: it’s summer where I live and I don’t want to show my body but I also want to seem normal and not be all covered up. \nI wasn’t able to use a short-sleeve or shorts even when I was thin so haven’t enjoyed a summer in five years. I’m so miserable and tempted to stop eating again :( ", "subreddit": "BodyAcceptance"}
{"post_id": "amev8l", "created_utc": 1549120225, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "amhr9d", "created_utc": 1549137671, "title": "Chubby in photos...", "author": "smitten_rainbows", "self_text": "I'm 4'11 and 105 pounds. I have a pretty reasonable body. But I notice that everytime someone takes a photo of me I look extremely chubby and I have no idea why. I'm always so confused when I look at photos people post of me because i look so damn chubby. I'm very critical of my body and I do a body check everyday in front of a mirror. It just worries me. Is it just a confidence thing? Are mg proportions just messed up and it translates differently in photos? Help. I want to look good in peoples photos at least once. I'm kinda tired of it. And it gives people an inaccurate image of me. People tell me I look different in persona as well...", "subreddit": "BodyAcceptance"}
{"post_id": "ammhi3", "created_utc": 1549169759, "title": "Trouble with my(m17) chest deformity, Pectus carinatum", "author": "luminaxed", "self_text": "I have constantly struggled with self confidence having a chest deformity, being young, I like to work out and wish I could go around shirtless without grossing the people around me out. I’ve been called out in public pools and even wearing a water shirt it becomes noticeable. My family on both sides had a history of poor ability to develop large chest muscles so I’m scared that I will never be able to look normal with future partners and around people if I’m not wearing loose clothing, I don’t know how to get over this or what I can even do about it except surgery in the future. I lie in bed shirtless, looking at my phone and I see my chest and feel so disgusting.", "subreddit": "BodyAcceptance"}
{"post_id": "amthm8", "created_utc": 1549224960, "title": "Gym swim unit", "author": "RIPDODGERSBANDWAGON", "self_text": "Okay so last week gym class started with the new semester. Our first unit is swim. I was originally really worried about this, my mind thought: Will the girls think I look like a wimp, or gross, or both? (Two of the girls in my class I have liked in the past, one of them very recently, neither of them liked me though.) Will my bathing suit fit right? Will it fall down? Will the other kids laugh at me? Will I get a random boner? \n\nUsually people worry about being to fat, but not me, I’m 15, 5’9”, and 126 pounds. I worry about being too thin. It’s been like this since I was 9. I was kinda worried, but also kinda excited, because when I tried on my bathing suit, I didn’t look horrible. I don’t have a lot of muscle, but I have some. \n\nSo swim started on Friday. And it actually wasn’t bad. I looked more in shape then a considerable number of the boys, and they didn’t comment on my appearance at all. The girls didn’t either, hell, I caught one of them (the girl who I just liked a few months ago) looking at my upper body for a good 10 seconds or so. There are 7 more swim classes left, and I wonder how it’ll go.\n\nI finally feel a bit better about my body. I figure if I put on 20, hell, maybe only 10 more pounds, 90% muscle, I’d be ripped.", "subreddit": "BodyAcceptance"}
{"post_id": "amvty5", "created_utc": 1549239023, "title": "Acceptance: is it possible?", "author": "crochetqween", "self_text": "Hello! I'm just gonna get straight to the point! I'm 18, nearly 19. I'm 260lbs and 5'9. I often struggle with my appearance, for no reason really. I'm in a very happy 2 year relationship and have loving people in my life. I find that this stress comes from the thought that more people would like me if I was thin. Obviously this isnt true but, what if it could be? I need help accepting myself for who I am, the weight I am, and the person I am. I always wear loose fitting clothes so people dont have to see my fat. I hide my double chin with my hair down. I just need a way to not feel so bad! I'm beautiful, I know that, but something deep down keeps me from feeling that pleasure. Please send help! Thank you!! ", "subreddit": "BodyAcceptance"}
{"post_id": "an64pp", "created_utc": 1549313244, "title": "The issues i feel with my body (a vent)", "author": "marioandgreenmario", "self_text": "Hi. So i dont really know how to start this off but I guess I can begin with measurements. Im 148 lbs, 5’5 and am 40-30-38. I just really hate my body to say the least as someone who all my life wasnt accepted by girls for not lookin feminine enough and kinda being the target of a lot of fat/ugly jokes back in middle school. Even when i did embrace my body (primarily my chest) people would call me a whore and push me down further.\n\nIm a cosplayer so i feel like this strain of my body looking nice is tripled and chokes me out every day. I care about my face, worry about my measurements and weight, try my hardest every time i get into costume to look so much nicer than I ever could but just buying regular clothes has me depressed.\n\nI do work out already which tones me but due to a huge relapse, ive been experiencing a lot of signs of depression, been almost unable to even leave my bedroom and the way i used to cope with that especially is overeating. \n\nAfter all that, the hate that i have for my physical appearance continues to eat away at me with the smallest comments. Im too scared to even allow people to see me in a bathing suit, see that i have hip divots, or even be intimate in fear of my partner being disgusted by my overall body and other scars i experienced due to jus my general clumsiness. I dont feel like im butt ugly (unless bare naked) but i feel so mediocre regardless of my friends being the most supportive people i could ever ask for my shitty body image. \n\nIm sorry for the rant. I start up my next semester next week so im hoping that once i get back into the college rhythm of eating better, walking, working out and having routine this horrible feeling will ease somewhat\n\nSmall edit: some things i usually pick at are my nose (since i almost broke it), my shoulders that every doctor tells me i should use for swimming, my breasts sagging due to their size on my body, my obvious violin hips, the pouch right at my stomach etc", "subreddit": "BodyImage"}
{"post_id": "an9xys", "created_utc": 1549337000, "title": "Ashamed about uncircumcision", "author": "throwaway1837372", "self_text": "It probably sounds ridiculous, but I feel incredibly ashamed about having an uncut penis. I hate even talking or thinking about it, the amount of vitriol and hate that I see without my choice on social media constantly is unbearable to me. I understand the jokes, I understand why it’s funny, and I am one to be able to laugh at myself (I’m a very self deprecating person), but making the mistake of looking up “uncircumcised” into twitter for example, and seeing the masses of people who would think I’m disgusting hurts. A lot. I’ve tried looking and I haven’t found a single person who’d stop and say how much the negativity has an impact on uncircumcised people’s body image - as far as I’m concerned, I’m the only person in the world who feels like this. I hate it. I’m fucking sick of feeling disgusting and gross about myself non-fucking-stop. It’s not like I can ever say anything about it without being anonymous either. Then I risk outing myself. It sounds so stupid but my body image has gone pretty downhill over the last couple years, and all that is at the center of it.", "subreddit": "BodyAcceptance"}
{"post_id": "ana18y", "created_utc": 1549337639, "title": "How to accept facial and body moles?", "author": "auburrito", "self_text": "I have loads of them. It'd be expensive to get them all removed since they are non-cancerous and therefore it would be considered a cosmetic procedure, which my insurance does not cover. I've had to live with them for almost 30 years and I still hate them so much that I cannot even say \"the m-word\" out loud and I cry every time my dermatologist checks me for skin cancer because I feel so hideous. Lately I've been watching a show called New Girl where one of the characters has a very moley body and he really embraces it. But whenever I look online at celebs with moles and it shows women, there are so many commenters saying how ugly they are and how \"moles are a deal-breaker.\" I just wish I didn't have to see things like that and I get so discouraged.", "subreddit": "BodyAcceptance"}
{"post_id": "anezfj", "created_utc": 1549379406, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "anfjhd", "created_utc": 1549382769, "title": "Choosing between school and an ED recovery program. Need help", "author": "AbbyMci", "self_text": "As the title says I’m faced with a dilemma. For a little backstory, I’ve been struggling with depression and anxiety for a while now and it’s been very difficult to go to school and get things done. I’ve only just recently started feeling better and have been getting back into life. It was only a week or two ago when I was diagnosed with an eating disorder. They put me on the waiting list for an intensive recovery program. Basically I’d be “preparing” for the program for 10 weeks, 2 hour class once a week. And then the intensive day program is 12 weeks, 5 days a week, from 9 am to 6 pm. I’m panicking a little bit because I don’t know if I can do this. I’m already a year behind in high school and I really don’t want to re-do another year. I don’t know what to do. I’m kinda scared to be honest. I don’t want to have to give up school and if I do both I’ll have to do school at night and i feel like it’s all gonna be too much.  I’d really like some guidance on this.", "subreddit": "BodyAcceptance"}
{"post_id": "anqwsc", "created_utc": 1549461274, "title": "bad bad bad", "author": "nirenannel593", "self_text": "i recently took a dive into my old tumblr account and saw all these old pictures of myself. i used to think i was fat. i still do. but to look back and see how small i was... it's heartbreaking. i was in so much pain. i hated myself.\n\ni was always between 120 and 130, and i'm 5'2\" so that's perfect by BMI standards.\n\ni went under 120 after my first heartbreak and lost a lot of weight. i was very sickly looking. but i think i look amazing. and i understand how toxic that is to think. i'm romanticizing my sickness and i hate myself for it but at the same time, i'm not the heaviest i've ever been (175) and i'm wishing i looked how i did back then. i went through a massive depression and gained the weight and i'm still depressed and i fear i'm going to keep gaining weight. now i'm more miserable than before. i spend every second hating how i look. i'm going to italy in april and i'm afraid of what i'm going to wear. i've outgrown all of my favorite clothes. all the pieces i tied to my identity and worked really hard to cultivate. i feel like the real me faded and is hidden behind excess weight. i'm sorry for rambling. i'm sorry for everything. i hate everything about myself and today is a really horrible day.", "subreddit": "BodyAcceptance"}
{"post_id": "anrm7o", "created_utc": 1549465861, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "ao04v9", "created_utc": 1549515224, "title": "I'm a 14 Year Old Struggling With Her Weight and Image", "author": "gorgeousmountaingirl", "self_text": "I remember why I started gaining weight and it's so stupid and regret it so much. When I was in 4th grade I felt seriously pressured to get my period. I ended up getting it fairly soon after my 10th birthday, but that's besides the point. I remember it being cool to have started puberty already (I know) and so naturally the girls that were gaining weight but weren't obese or overweight were idolized. I remember I was only 100 pounds and I felt self concious and lied and said I was 105. Now I'm 150, but slowly I'm losing it. \n\nTo be fair, there's not much about my appearance that I hate. I think I'm pretty, I do, but there are some things that bother me. I love my bright blue eyes but hate that they're hidden behind glasses that make me look weirder and nerdier than I am. My hair is very healthy and thick, but right now it's growing out from a pixie cut which I got last April and started growing out last June and is currently at shoulder length and I feel if it were a couple inches past my shoulders and longer than it wouldn't make me look like that 50 year old guy who thinks he's Peter Pan. \n\nI don't know. Maybe I'm crazy. Maybe I look fine but my stupid mind thinks otherwise", "subreddit": "BodyAcceptance"}
{"post_id": "ao242j", "created_utc": 1549532530, "title": "Im betraying myself", "author": "WHYAMISTILLALIVEHERE", "self_text": "I am starting to hate my skin color. It's never happened before. I feel like I'm ugly, and undesirable. I don't hate other dark skinned peoples skin, just mine. I remember in middle school when a guy told me to go back to the zoo, because I looked like a gorilla. I felt ugly and dirty. I'm adopted, and my whole family is White. I love them a lot. But when we go out we sometimes get confused looks. I feel awkward. There are sometimes I feel pretty but , it's a universal fact that everyone don't like dark skin. Even in Jamaica. They bleach their skin white because of it. How am I supposed to fell confident when black isn't considered beautiful. ", "subreddit": "BodyAcceptance"}
{"post_id": "ao4olo", "created_utc": 1549552284, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "aohg3w", "created_utc": 1549638784, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "aoiqnq", "created_utc": 1549646358, "title": "I’m fat because of my arms and stomach shape..", "author": "832Squiddy", "self_text": "So, my self-esteem is really low already. But my body image is even worse. I’m 24, 160 lbs, and 5 feet even. The only thing I have going for me is that it is distributed unusually well considering that my weight makes me obese. And no one can tell that I’m not healthy, but I still can’t leave the house in things that everyone I know says I could pull off. Operative word “could” according to them. And we are not talking the more ballsy things like crop tops or low cut shirts, we’re talking shirts that aren’t two times bigger than my size, sweatpants, blouses with lots of scrunching, and I wouldn’t be caught dead in a sleeveless shirt. My stomach is pudgy, my arms make me feel like white trash, my height makes it to wear even snug clothes look like shit. But I’m the only person that feels this way. My boyfriend wishes I’d dress “how I could”, so does my aunt, and all my friends which is not many but they try to tell me it. I just have an anxiety attack (tight chest, trouble breathe, nervous) if I show too many of the “bad areas” of my body at once. Everyone’s stares suddenly seem like glares in my head and I’m just picturing myself as a massive, disgusting LITERAL blob. I had a therapist suggest that I have body dysmorphia. It’s my arms and my stomach shape. I don’t know if he’s write but he was only suggesting, not diagnosing. Thoughts?", "subreddit": "BodyAcceptance"}
{"post_id": "aoq63b", "created_utc": 1549696983, "title": "Relapsing", "author": "mssadgirl", "self_text": "So, I am returning from a depressive period where my body was the culprit for my loneliness ansld my sadness. 2017 was rock bottom and 2018 was a try at recovery. It's a process, but last nigth after a party my friend took a picture of me and her boyfriend and I couldn't even look at it. I suddenly felt like the most unworthy person and it sucks SO MUCH to have these toughts and be tempted to return to old habits.", "subreddit": "BodyAcceptance"}
{"post_id": "aot3qn", "created_utc": 1549725011, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "aoy58q", "created_utc": 1549754924, "title": "Only Genetics Cause Diabetes", "author": "lostkarma4anonymity", "self_text": "  \n\n\nhttps://i.redd.it/geyc26rinmf21.png", "subreddit": "fatlogic"}
{"post_id": "ap62re", "created_utc": 1549819741, "title": "I'm going to be filmed tomorrow and I'm terrified", "author": "hidnonymous", "self_text": "Hey Reddit. So long story short, my university is making my class film a one-minute video to \"strengthen our bond\". Since I have really bad body dysmorphia, I was planning on helping behind the scenes. The problem is literally no one but me and two more guys is putting any effort into helping (we are at least 35 people). And since I'm the only girl putting an effort, they've asked to film me. Being the nice person I am, I told them that if no one volunteered I would do it (hoping, of course, that at least one of the many girls in my class would). But no one did.\nSo tomorrow I have to show up and pretend to be a VIKING fighting (the video is about historical eras). In front of a guy I have a crush on. I literally don't think I can do it. But I've already committed and I don't want to mention my mental disorders that are putting me off.\n\nIt may seem stupid, but in the last four years I have cried myself to sleep every time someone has taken a picture or video of me. I get very anxious and feel like all the effort I'm making to heal goes to the garbage. Not to mention that I forget how to act naturally in front of cameras.\n\nDo you have any advice?", "subreddit": "BodyAcceptance"}
{"post_id": "apcium", "created_utc": 1549859376, "title": "i’m just so sad about my body", "author": "kwiwifooseball", "self_text": "i’ve been struggling with my body image for years but last year i gained about 10 pounds and have a feeling that the number keeps going up. i just want to look pretty and delicate, not have love handles. i told myself that this is the year that i’m going to get my weight down, but i have a feeling it won’t work. does anyone have tips to stay motivated and have self control?", "subreddit": "BodyImage"}
{"post_id": "apckzx", "created_utc": 1549859806, "title": "I feel like my body is literal sh*t", "author": "fearfulthwy", "self_text": "That's the truth. I think all these parts of me belong in a sewer. I'm 28 now but since I was about 13 I have constantly felt so unlucky at my genetics and at the dastardly ways I have been forced to present (partly because I was forced to wear religious garb and modest clothes that made me look really unappealing compared to the other girls in my school). On top of that I developed bad posture due to being trapped in my room all day and I was malnourished to the point that I looked like a dry set of bones. Ugh so much of me feels sooo ugly to me, I hate how ugly I am, I've learned to \"look pretty\" but I'm still sick of my body most days. Even though I've fixed some of those old issues like hirsutism by spending thousands of dollars on full body laser treatments over 3 years, I still feel just as ugly as if I was the hairy beast I started off as. I am so hideous, this feeling will never go away no matter what else I modify. I am ugly ugly ugly. I just feel like a hideous malproportioned ugly beast. :'( I'm the equivalent of human faeces. It doesn't matter what I tell you about body acceptance, this right here is the truth about how I really feel.\n\nThanks for reading. Just needed to get this off my chest. ", "subreddit": "BodyAcceptance"}
{"post_id": "aph1hc", "created_utc": 1549897113, "title": "Toxic Friend", "author": "cxrlygxrl", "self_text": "So I am a teenager and my friends are all much skinnier than me although I am of a healthy weight I am what you consider curvy (big thighs, boobs etc) and one of them especially constantly makes comments about my body putting me down and I don’t know what to do (she tell me that my thighs are big and she is obsessed with thigh gaps which I don’t have). She also sends me pictures of Instagram models who are skinny (not me) and is obsessed with their bodies which makes me feel even worse to the point of crying. I haven’t told her how I feel and I don’t know how I should go about it. I’ve only recently started becoming body positive and now she’s made me crash back down to zero. I mentioned my weight to her once and now I regret it. ", "subreddit": "BodyAcceptance"}
{"post_id": "api151", "created_utc": 1549903043, "title": "MetaMonday: Announcements", "author": "maybesaydie", "self_text": "* We will be doing our Valentine's selfie post on Monday, February 18th. Get your selfies ready!\n\n* \"Fat Shaming Works\" in all its iterations is a repost and will not be approved again. No matter how many creative names you call us.\n\n* If you have an issue, please send a modmail. PMs to mods are generally ignored.\n\n* Be nice to each other in the comment section, we're tired of moderating slapfights. See reddit's Terms of Service for details. And take a look at the rules in the sidebar.", "subreddit": "fatlogic"}
{"post_id": "apjuoq", "created_utc": 1549912886, "title": "Looking for some advice", "author": "KB456789", "self_text": "So awhile back I had a crush on my best friend and I felt that he would never consider dating me/that’d it be impossible he’d want to date me because of my body. Looking back now I am aware there was and still is nothing to be ashamed of but his girlfriend recently posted a picture of herself and she tagged him in the caption, basically you’re typical cute couple ig interaction. It brought up issues It seems I still have not resolved and frankly I don’t know how to go about doing that. Back then I couldn’t believe someone would be attracted to me so I stopped myself from confessing my feelings when it probably would have ended with us dating. Presently I’m still stopping myself and I still think no one would want to be with me. I don’t want to keep myself from living life anymore but I don’t know where to go from here. I’ve spent a lot of work in therapy to feel confident around other people(I use to have debilitating social anxiety)  but I’m stumped how to progress in terms of believing someone would like me. If you’ve been through this or if you have some advice I’m hoping to hear some of your thoughts/experiences. ", "subreddit": "BodyAcceptance"}
{"post_id": "apu9q0", "created_utc": 1549984243, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "apulym", "created_utc": 1549986274, "title": "I need some encouragement/advice", "author": "disturbingLAUGH", "self_text": "Hi everyone\n\nI'm not exactly sure where to start this but I'm going to just jump right in. Im a 19 year old male and my ED is consuming me. It's been going on for years, but has really been elevated this year in college. I was doing well this past summer, eating relatively unrestricted and maintaining my weight around 160 lbs (I'm 5'11) and honestly not worrying too much about it. However, within the first three weeks of the fall semester, I lost about 10-15 lbs and was having trouble standing for the duration of a shower. I couldn't really break the cycle and kept at this lower weight until Christmas break when I went back home. Things got a bit better then, but now that the new semester has started, filled with all sorts of school and personal stressors, my weight is back on my mind constantly. I think I'm around the low 150s now, but as much as I try to eat normally, I just can't seem to. Some nights I'm struck with this voracious hunger that leaves me feeling like utter shit the next day, but I'm trying my best to just move forward and not restrict. I know I've gained a bit of weight since the fall, and as much as I'm trying to convince myself that its for the best, I just can't seem to do so. I'm starting counseling in two weeks (soonest I could get in again), but I think I just need some help to tide me over, as I'm not sure I can make it much longer. \n\n&amp;#x200B;\n\nThank you for your time", "subreddit": "BodyAcceptance"}
{"post_id": "aq0xct", "created_utc": 1550020892, "title": "I’m Tired of My Body", "author": "hmbrunstad", "self_text": "A lot of the time when I say how something is difficult in my life related to my body, people laugh and roll their eyes. \n\nI’ve been skinny shamed my entire life and I’ve never been able to stay above 100lbs no matter how hard I try: how much I eat, how much I exercise or anything. I’m just...small. I do the best with what I have but it is so hard to find decent clothes that fit me well and I’ve just opened that beast back up recently because I just started student teaching so I need to have more business-casual looking clothes, especially since because I’m small, white, and blonde, I tend to also get mistaken for a 16 year old. So if I say one word when shopping, asking if they have a smaller size (because I’m a XXS or 00/23-24) I just get laughed at. Like “aw sorry honey is that too big? You look like your drowning, do you need help?”\n\nI’m SO done with it. I understand that plus sized people have struggles and our cultures have gotten so good at accepting them and I’m so proud of that. But... can we stop putting that negative energy on the small people? No I’m not a child, yes I’m small and I’m trying!! I’m trying to gain weight but I can’t! It’s not so easy. It’s not something to roll your eyes at. My doctors say I’m healthy but if that was the case then why can’t I gain any weight at all? What is wrong with me??\n\nWhen people complain about being skinny they are NOT looking for compliments. They are simply complaining and you can let them complain. That’s okay. Don’t compare your frustrations, just let them complain. Offer reputable advise if you have any... but otherwise just accept them. Accept them and know that being skinny and small is painful. You don’t get taken like a real adult no matter what. People try to walk all over you, and it’s hard to keep fighting that. It’s a battle. \n\nBeing skinny also physically hurts!! I have lots of back pain and the top cm layer of my skin on my legs is usually in pain because my little muscles just don’t know how to support my body.  Exercising is absolutely exhausting even if you eat 3,000 calories a day!! And eating those 3,000 calories is also exhausting—it takes me forever to eat and eating is a chore because I’m always trying to make sure I have enough calories to spend doing regular daily activities. \n\nI just don’t know what to do. I feel helpless. Don’t tell me I’m pretty or that I don’t deserve pity because this has been my entire life. Kids asking if they can have my cake “because I’m annorexic anyways”—no I’m not! Please. Just let people be people. Let people complain when they need to and don’t get offended because their problems are different than yours. \n\n🎤 ", "subreddit": "BodyAcceptance"}
{"post_id": "aq6loc", "created_utc": 1550064631, "title": "I don't like being skinny", "author": "[deleted]", "self_text": "I am skinny and have always been. Maybe being skinny is not the real problem, maybe being too tiny makes me look skinnier than I actually am. Fact is that I have a fast metabolism and no matter how much I eat I never gain weight. I eat a lot and never skip meals even when I'm not hungry or feel depressed because I know that I will lose weight very easily and fast if I skip it.\nI have been pretty chill about everything that concerns my looks but now it's like I'm back at it again with the low self esteem because of one of my classmates. \nAll of our interactions basically consist in him constantly telling me that I'm too skinny and asking me if I eat. So I started wondering if I looked sick. My body looks pretty healthy and it's actually not that skinny but I usually wear oversized clothes so people think I'm even skinnier. Thing is... why is he doing this? Does he think that I need his opinion? Does he think that I will be happy with that kind of comments on my appearance? I mean.. asking me if I eat. That made me so sad. But I also felt proud of myself for brushing it away since I would have probably started crying if that happened to my 14 year old self. Does it bother him so much that he can't control those stupid comments? He has even asked me how much I weight and tried to guess it. although that doesn't happen so regularly anymore, all my life I've been getting comments from people that ended up affecting me. Things like \"you don't have any boobs\", \"you don't have ass\". I do have boobs and ass and I get frustrated when people think they know how I look when th ey haven't even seen me naked.\nPeople need to get that some of us can't do much about our bodies, this is who we are.", "subreddit": "BodyAcceptance"}
{"post_id": "aq7j3s", "created_utc": 1550070690, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "aqe3sg", "created_utc": 1550106806, "title": "I just want to be comfortable in my own body", "author": "mastersauce89", "self_text": "I'm such fucking skeleton, I can't seem to gain weight no matter what I do.\n\nOne time I looked at myself naked in the mirror and I actually gagged. \n\nNo One wants me because I'm such a skinny little piece of shit.\n\nI hate myself, I'm so disgusting.", "subreddit": "BodyImage"}
{"post_id": "aqkpua", "created_utc": 1550157055, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "aqkzbn", "created_utc": 1550158594, "title": "💕💕Valentine's Day Selfie Post 💕 💕", "author": "maybesaydie", "self_text": "Post a selfie or progress pic. Please no pictures of children. 😻Cats and Dogs🐶?  Yes, please.\n\nHappy 💕 Valentine's 💕 Day 💕 from your r/fatlogic mods", "subreddit": "fatlogic"}
{"post_id": "aqxitu", "created_utc": 1550243681, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "ar2o0l", "created_utc": 1550273134, "title": "\"Go troll in a hole\"", "author": "Trix-Rabit-Is-A-Pedo", "self_text": "&amp;#x200B;\n\nhttps://i.redd.it/jpetu0ppetg21.png", "subreddit": "fatlogic"}
{"post_id": "ar9kyt", "created_utc": 1550329775, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "ar9qej", "created_utc": 1550330841, "title": "Hanging low", "author": "okdokeysmokey", "self_text": "So I have trouble accepting my body, because of something that happened when I was young. I had a pretty severe accident and lost a good three quarters of one of my testicles. As a result I feel less of a man, and that bothers me. Not sure what else to say, but any views on this are greatly appreciated.", "subreddit": "BodyAcceptance"}
{"post_id": "ary0jg", "created_utc": 1550501904, "title": "I hate how my belly looks", "author": "ARandomHamiltonFan01", "self_text": "All I want is to have a toned stomach. I'm sick of seeing so many girls, some of whom are bigger and curvier than me,yet they have a more toned stomach. I try do hard and mine still looks bloated and chubby. I'm 18, at 106 pounds at 5'4, and I still have belly fat even though I'm slightly underweight. For the past 6 months, I have been going to the gym and doing ab exercises, but in december, I pulled an oblique muscle (just a minor pull), but it still hasn't healed. Last year, I used to be a runner until a hamstring injury and after getting back into running, I was constantly injured. I love exercise, it's the one thing I crave the most, but my body just can't handle it for some stupid reason. the past 2 years, I had a slight problem with restrictive eating, especially because of the injuries so to prevent myself from an eating disorder, I started a low carb diet. the low carb diet is the only way I have control since exercise isn't reliable. I like the low carb diet because I can burn fat without exercise or restricting. I eat about 1700 calories a day. Every day I eat the same thing. A serving of peanuts with a yogurt for breakfast, almonds and celery for snack, a salad with a few strawberries and a serving of sunflower seeds for lunch, peanuts again for snack along with cucumbers, maybe a piece of 100% dark chocolate, and for dinner, some meat with veggies. \nI hate how other girls who are toned and skinny get to eat carbs and whatever they want while I have to eat the same low carb meals and snacks every day just so my stomach doesn't look completely horrible. The only thing I have control of is my diet, but I don't want to restrict and fall into the same old habbits. Since I can't exercise to be more toned, I have to eat under 40 grams of carbs per day to lose fat. I hope one day, I will have a toned stomach. ", "subreddit": "BodyImage"}
{"post_id": "arzrm6", "created_utc": 1550511794, "title": "Accepting a deformity", "author": "DoodleMonster123", "self_text": "I'm 27 (female) and due to a medical condition I have deformed fingers and toes since I was a child. It affects me every day as I'm always self-conscious about it. Functionally my hands are fine and it doesn't stop me from doing anything but I think about it constantly. Whenever I see someone else's hands it reminds me, when I'm holding a cup or bottle I'm aware that others can probably see it, when I'm typing on a keyboard I see my fingers etc. Basically it's always there right in front of me. It affects me so much. I've never been in (or tried to pursue) a relationship because I feel like nobody would want to be with someone who is damaged and deformed. \n\nI feel disgusted whenever I think about it. There's no treatment for it (not even surgery) which makes me feel so hopeless. I want to know how you accept something like this. When I read about body dysmorphia I can relate to the feelings so clearly but my focus isn't on a perceived flaw but a very real deformity. It's held me back so much and I want to get over it but even as I write this I feel like unless my fingers can be fixed I can never get over it. ", "subreddit": "BodyAcceptance"}
{"post_id": "as54mv", "created_utc": 1550542183, "title": "Body Image affect everything in school, for me.", "author": "stross525", "self_text": "I hate the way I look. I am overweight. At 185 pounds, male, freshman, I hate myself. It affects my mood, confidence, looks, and of course grades. I can never seem to \"look good\", regardless of what I wear. The number the scale shows me everyday disappoints me and affects me. Everything that is listed above is all affected on one thing - my looks. I feel like I'm so unworthy at school and that no one cares about me. I have friends but I feel like girls do not like me at all because of what I look like. It also affects my posture. Because I am constantly anxious and nervous (from the way I look) it affects the way I sit and stand. I stand awkwardly, the entire time in mind of what everybody sees me as. I just don't know what to do. I'm trying to lose weight. In fact I lost 45 pounds but am stuck on a plateau. I'm never happy anymore and everyday feels like such a pain because I have to worry about my looks. Is there anything I can do to ease my mind? Thoughts to think? Because I just don't know what to do anymore. I'm so nervous all the time. Part of that is because of girls. All comments are appreciated. Thank you.", "subreddit": "BodyImage"}
{"post_id": "as9ml5", "created_utc": 1550577463, "title": "Family and friends made fun of my BDD AND how I look", "author": "oscoot122", "self_text": "My mom and and my friends pointed out in several occasions flaws in my body, my mom would say my legs are ugly, my friend would say my nose is big, another one said my arms are too long compared to my short height, when I opened up to the them (supposedly the closest people to me)  about me having body issues, the fact that I think about it everyday and how it can disturb me while doing tasks, they went on to ridicule the idea that I can't accept how I look, one friend even suggested that I should just not think about it even though he pointed out flaws in how I look before, I'm kinda stuck in this toxic environment, I still live with my parents, and my friends are people I see everyday in school, I genuinely don't know to deal with this..", "subreddit": "BodyAcceptance"}
{"post_id": "asbdk6", "created_utc": 1550589010, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "asp0lk", "created_utc": 1550673405, "title": "Struggling with body image", "author": "andreaasolanoo", "self_text": "For a long time i’ve felt like things would look better on me if i lost weight and now that i’m older i know that’s not true but don’t know how to shop for my body. sometimes i feel forced to just wear sweaters and a hoodie because i know nothing else will look good. ", "subreddit": "BodyImage"}
{"post_id": "aspeoy", "created_utc": 1550675467, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "asz2qp", "created_utc": 1550725512, "title": "It’s been worse lately", "author": "idontknowwhatouse", "self_text": "My (F17) body image has been struggling. When I was 14, I starved myself everyday and once I stopped, I just gained weight so gradually. I’m now so scared to step on the scale and everything I wear I lookso fat in. I know I’m overweight I just know and everyday I tell myself, “don’t overeat, move more it’s not that hard” but I come home from school and I just gorge myself with the worst food that doesn’t even taste good like pizza rolls and old popcorn and shitty sweets. I have zero motivation for everything; school, looks, friendships, relationships, etc. and I can’t handle it anymore. I keep obsessing over new things every week, my body image being the pick of the week. I can’t take it. I feel like absolute shit. Idc about advice I just needed to rant. ", "subreddit": "BodyImage"}
{"post_id": "at478r", "created_utc": 1550761879, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "at8dif", "created_utc": 1550782771, "title": "Which perspective of healthy weight/image is right?", "author": "soundbox78", "self_text": "For years I have been told by doctors that my weight is not deemed healthy, or that I am at risk for heart disease or diabetes. I have enough proof in my family that I am risk for both with genetics. That is an automatic. I am an hourglass muscular shape. When I was my lowest weight (135lb) age 22, I was still big.. size 10 if I was lucky. Over the years, I have gained weight because life caught up to me...mostly belly fat, since I have had children. I have had several massive surgeries. More or less, I have lived my life instead of worrying about my appearance. Now that I am in my 40's, my weight is the first thing mostly discussed by doctors and it is always the root of all cures. I have been working at this healthy life style choice for a few years now. It is a slow process. As a person who suffers from depression, anxiety, and ADHD, I am more concerned about my happiness than physical appearance. Another words, I have learned to take most criticisms of my body with a grain of salt. My husband thinks I am sexy, and personally, that is all that matters to me. I maintain good choices for my children so that they develop good habits. What frustrates me most is the whole BMI count, with your age, weight, and height. Physical images do not add up. I weigh 240 lbs. at 5'2, with a pants size in 18-20. My mother weights 230 lbs. at 5'1 with pants size in 22-24. How does this work out? I know the scales are accurate because we both used them. This has my mind blown about physical appearance and BMI. How does this add up? This experience has really messed with my head! Knowing the physical appearances of both my mom and myself, along with our weight differences, has left me feeling that I will never be deemed a healthy weight in the eyes of a doctor because I will never be 110-120 lbs. When I was 135 lbs, I was still heavy, with a little belly fat, my periods were off-sync, and I still suffered from PCOS. I was practically starving myself to get to that weight, and was not happy. When I was 150lbs, I was deemed still heavy for my height, but still skinny to me..size 12. My truly happiest weight where I felt physically comfortable in my skin was at 180lbs. I had just had my 1st child and I was physically active at a size 14-16. I really need fresh perspective from people who have found ways to love themselves and not get bogged down with health drama from physicians because of family history. I feel like to meet the physical form of healthy at my height, age, and weight, would require me to look like a deformed Barbie Doll. ", "subreddit": "BodyAcceptance"}
{"post_id": "atip5i", "created_utc": 1550848387, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "atkf8y", "created_utc": 1550857094, "title": "I’m really considering cutting off my boobs in the future", "author": "pimpernellie", "self_text": "For so many reasons. I used to think it was because I was trans? But rather than identifying as a man, I feel just more like a person. I hate that I can’t jump up and down with excitement without men staring/getting real weird. I’m starting to get real tired of this hyper-sexualization of women. It makes girls live in an alternate reality. Where everyone treats you ultra nice because they literally want to bang you.\n\nI want to be undesirable to men sexually so they treat me as a person. I’m an INTJ personality type so I need accurate information and this is just not working out.\n\nI know my sex is female, but my gender (social roles, identity) is neutral. Like a gender less online presence. A mind floating in the ether.\n\nI really like androgyny and binding my boobs. Clothes feel better on me like that. And I feel clothes look better with a flat chest!\n\nAlso, breast cancer runs in my family. They just feel like these giant tumors that serve no purpose.\n\nAnyway, thoughts?\n\n\n\n", "subreddit": "BodyAcceptance"}
{"post_id": "atwdov", "created_utc": 1550934589, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "aty74d", "created_utc": 1550945339, "title": "Conflicting body image issues", "author": "iminneedof", "self_text": "Hey,  I'm posting here because I have conflicting body image issues and I don't know how to deal with them. I often find myself getting jealous of girls with larger breast and butts but when I start to gain weight I find myself being jealous of girls with thin arms and thighs. I'm honestly not sure what states I think that I'd be actually happy with my body but I know I'm not happy now. Is there a compromise for this? ", "subreddit": "BodyAcceptance"}
{"post_id": "au4hvl", "created_utc": 1550983729, "title": "ed recovery weight gain pls help", "author": "kaiyugh", "self_text": "title kinda explains. i am dealing with my third or fourth weight restoration from anorexia and dealing with the usual stuff that comes up when that happens. i am close to or at my set point/healthy weight (not sure exactly bc i don’t weigh myself and haven’t seen my dr in a few weeks) and just trying to figure out how to cope with these feelings of overwhelming self loathing. i really really don’t want to fall back into yet another relapse, since my last one almost landed me in another hospital admission but i wish i could go back to that body that i had two months ago. does anyone have any advice?? i am going traveling for three months in april to europe and then school next fall and i really can’t f*ck up my recovery again. i already had to take a semester off of college and then dropped out after a year because of ed. i just don’t have the time... feeling so conflicted and lost and hating what i see and feel in my body but also so lost as to how to accept and love the body i have no matter what shape or weight it’s at.", "subreddit": "BodyAcceptance"}
{"post_id": "au4r7f", "created_utc": 1550985624, "title": "Boyfriend makes me feel bad about my body size", "author": "satincare", "self_text": "I met my boyfriend when I was 15 years old. I was 5'5\" and 100-105lbs. I was considered really underweight and couldn't understand how to put on weight when my doctor told me I was thin. I started taking antidepressants when I was 18 and gained a lot of weight (up to 165lbs) as a result of the medication. As soon as I came off of it when I was 20, I dropped to 130lbs. I have been this weight since then, and I'm now 24. I feel happy at this size and I think my body likes being this weight too. I eat pretty healthy because I'm studying nutrition and exercise moderately. I could definitely exercise more though, but I'm working towards that.\n\nThis issue is, every time I eat anything bad, my boyfriend shames me for it. He says I didn't exercise that day so I shouldn't eat that dessert, I'm going to get fatter, I won't be a MILF in the future, I've gained so much weight since we started dating, etc. He always calls me out if I eat something bad or if I don't work out as much as usual that week. I'm very in tune with my body and know when I need to make changes, so his shaming only insults me and makes me feel incredibly insecure. \n\nWhen I was at my heaviest (on antidepressants), I worked out 5 times a week with a trainer and ate super healthy and couldn't lose a single pound. He constantly talked about my weight and how I should exercise more so I can lose it, even though I was trying so hard. This resulted in really odd eating patterns for me and an insecurity around him moving forward. Now, when I crave something sweet, I eat it quickly when he's not around or hide it in my room so he doesn't see it. I'm ashamed and I don't need to be. I hardly eat bad, and when I do, I would like to be able to do so. I'm completely aware of my food choices, but sometimes you need to satisfy your cravings.\n\nHas this happened to anyone else? It makes me furious because I know how unhealthy this mindset is. This makes me feel so horrible and has affected my confidence around him, and ultimately killed my sex drive since I am scared of him seeing me naked. What do I do? Any experiences, advice, or thoughts are much appreciated!\n\nSorry for the long post!", "subreddit": "BodyAcceptance"}
{"post_id": "aufjqw", "created_utc": 1551060118, "title": "What should I do?", "author": "Tamari080", "self_text": "Let's cut to the chase:\n\nI am a 15 year old girl who struggles with body hair. I have had my hormones tested and they are fine. I am afraid i have PCOS but my family denies it.\n\nI am really hairy. I wake up feeling so disgusting but because of school I don't have time to shave. My family is poor and I want to go to college in the future so I won't be able to afford laser hair removal any time soon. I also don't know what career to work towards so I probably won't have a lot of money in the future either. i feel so stuck and I am so sick of waking up hating myself and feeling like no one will ever love me. I've had suicidal thoughts because of everything going on in my life and I am so afraid of being alone\n\nI never asked to be perfect but I would have appreciated being normal \n\nI wish i wasn't hairy. I think I might have BDD because my hairiness is all I can think about all day.\n\nI avoid showers and end up crying myself to sleep on nights where I think about how disgusting I feel\n\nI don't want to live my life feeling disgusted with myself. I'm so sick of feeling not good enough. Everyone else in my school is so pretty and normal, what did I do to deserve this?", "subreddit": "BodyAcceptance"}
{"post_id": "aumyo4", "created_utc": 1551111510, "title": "Meta Monday: NO STUPID QUESTIONS", "author": "maybesaydie", "self_text": "Have questions about weight loss, food and fitness? Ask and the community will do its best to give you an answer.\n\nNo rants please.\n\nAnd be sure to join us for our Mardi Gras selfie post, Tuesday March 15.", "subreddit": "fatlogic"}
{"post_id": "aun4us", "created_utc": 1551112414, "title": "How can I accept my body with stretchmarks?", "author": "cutiematsu", "self_text": "Hello all,\n\nI’m a 5’7-8” female approx 230 lbs. i’ve gained stretchmarks all over my body that are now purpleish red and I’m very ashamed of having them.\n\nThis is not about the weight but about the stretchmarks, as I am working on my weight already.\n\nBut even when I lose the weight, the stretchmarks will always be there and the thought of that makes me very upset- when I see myself in the mirror I genuinely become triggered in a way whenever I see my stretchmarks. \n\nIs there any advice on how to accept and love them, or to help dim their appearance, anything? I just want to be comfortable with my skin because I damaged it this way.", "subreddit": "BodyAcceptance"}
{"post_id": "aunnc2", "created_utc": 1551115083, "title": "I'm totally insecure about my eyes", "author": "gorgeousmountaingirl", "self_text": "They're very dark/bright blue and I feel like they pop out of my face too much because they are very big. It doesn't help that I have super dark and long eyelashes and it makes me look like I'm an anime character sometimes. In school there are rumors that I wear extensions and that I look like a hooker and that I'm \"fooling nobody with my colored lenses\" Ontop of that neither of my parents have blue eyes. My mom's eyes are green and my dad's are brown. Only my Grandpa's eyes are blue. Because of this I feel like I look nothing like my parents. My hair color isn't like my parent's at all- both my parents have brown hair. My natural hair is auburn like my Janou (dad's mom) but I was ridiculed because of that so I started dying it blonde. Anyway, because of this stupid unlikely thing there were a ton of rumors and still are about how my mom probably cheated on my dad and that I was a bastard (she did not!) It really friggin' sucks.", "subreddit": "BodyAcceptance"}
{"post_id": "auywbu", "created_utc": 1551184022, "title": "My (F24) boyfriends (M28) feelings of low self esteem are affecting our sex life, I want to help but so far my attempts have failed", "author": "Maqqdaf", "self_text": "My boyfriend has always suffered with feelings of low self-esteem, feelings relating to his penis size and his body generally. \n\nWhen we first got together, a time when I wasn’t even able to see his flaccid penis, I had a very frank conversation with him about how his penis size is exactly what is perfect for me, and that it is average, but average is average for a reason and its nothing to be ashamed of. Following this he felt a lot better about it, he did some research about real penises for the first time ever and found my words to be confirmed, however as time has passed old intrusive thoughts have re-entered his mind.  \n\n\nHe is also very self-conscious about his body, he is fit, he goes to the gym every other day and does squats and his legs and bum are fucking ripped but he has a little bit of weight around his top which he says he expects on his current exercise plan but will get rid of before summer. However as good as I think he looks, he thinks he looks disgusting. \n\n\nIt has absolutely demolished our sex life to say the least, and on the other side I suffer with feelings that are diametrically opposed to his, where, when he doesn’t want to have sex with me I feel disgusting and undesirable in my own body. As you can imagine its been difficult for me to rectify these feelings with his feelings of being unable to have sex because he feels disgusting and undesirable. \n\n\nAnyway, I love him, so I’ve been working on my side and I’ve spoken to him and taken the pressure off, told him that while I want to have sex with him, if he doesn’t want it I won’t push for it, but I asked if we could at least keep the intimacy, which we have and its helped a lot.\n\n\nWhile this does work well for now, I don’t want him to feel this way about himself, its deeply disordered thinking and affects him in more than just the bedroom, so basically what I’m asking is: what can I do to help? \n\n\nIf I vocalise my appreciation for his body, he takes it almost offensively, as if I’m going out of my way to lie to him, which is hard for me because I just do it naturally, because I do think he looks good\n\n\nIs there anything I can do, or anything I would be able to suggest he does? We’re at an impasse here and I feel like he needs professional help, but I think that is something he can neither afford of would pursue. \n\nTL;DR My boyfriend has severe feelings of low self esteem, but rejects any and all compliments, how can I help him change the way he seems himself?\n", "subreddit": "BodyAcceptance"}
{"post_id": "av0gcf", "created_utc": 1551193780, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "avd2s9", "created_utc": 1551271377, "title": "Am I allowed to be offended?", "author": "ok_unicorn", "self_text": "In my job I work with a partner. We spend a tremendous amount of time together (literally more than with our romantic partners), for the most part we are very good friends, know each other very well and are incredibly close.\n\nI’m a short curvy girl and I’ve been through hell and back trying to accept myself and my body. A few years back I actually struggled with eating disorders and stuff like that and am finally at a place where I’m working so hard to be happy as I am. I’ve been seeing a therapist and working on things and I have been feeling so so so much better. \n\nMy problem is my partner, gorgeous tall skinny girl, makes a lot of comments about her own body in ways that then somehow go back to hurt me? I know she isn’t aware of it, she’d never do it if she knew it affected me but I still find it hard to hear. \n\nShe’s recently got back from holiday and have been talking about how she’s now ‘very fat’ because she almost has a belly, and I’m sat next to her, thinking about my very existing belly and it hurts. \n\nI don’t even know if I’m allowed to be offended by this? She’s never said anything to me other than called me beautiful and yet whenever she talks about herself putting on weight it makes me so sad about myself. \n\nI don’t really know how to tackle this. Do I talk to her? Is this even a valid feeling? \n", "subreddit": "BodyAcceptance"}
{"post_id": "avehcp", "created_utc": 1551280260, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "avl9ms", "created_utc": 1551317788, "title": "Love Myself as I Am or Lose the Weight Paradox", "author": "oldmiserablehag", "self_text": "As a fat woman, who has been fat my entire life, I of course have that strong urge to lose the weight and become a fitter, healthier, and smaller person. It's something that has always lingered in my mind, even to this day.\n\nHowever with the body positivity movement, encouraging everyone to love themselves as they are, I feel strongly that as a fat woman, I should learn to love and accept my body just as it is. I have definitely learned to love myself in my fat body as I've grown out of some of my insecurities and just by getting older, going to college, and also meeting other people who have similar ideals. Some days, I genuinely love my fat body! And feel a \"fuck it if nobody else likes my body! because I like myself and my body today!\" \n\n  \nBut of course, that isn't everyday. Losing the weight and becoming thin is something that I think is going to hang over my head for the rest of my life. My insecurities about my body are probably so deep seated, that in a sense it literally traumatizes me. My desire to be thin is too strong I guess. Basically, I ping-pong from loving myself in my fat body and wanting to be a thin person (probably because I don't actually? love myself in my fat body...idk).\n\n&amp;#x200B;\n\nAnyway, I'm mostly wondering if any other fat people out there feel this. That strange paradox of feeling like you want to accept and love yourself as you exist in your fat body, but also having the desire to lose the weight and become thin one day. I tried discussing this with my therapist and she doesn't really understand it--she kind of poses it as making an either/or choice, but I don't really see it as so black and white as that? I don't really understand completely either...I'm trying to contextualize these feelings but I can't, so I would love to hear anyone else's thoughts on this, particularly if you're experiencing the same thing. ", "subreddit": "BodyAcceptance"}
{"post_id": "avs5ch", "created_utc": 1551366699, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
