{"post_id": "aw1p0y", "created_utc": 1551422330, "title": "My road to accepting the skin I'm in", "author": "ProgAce23", "self_text": "I've [M23] been having body image issues since I was in middle school.  This all started in part because I, like many preteens, was starting to get acne.  People would also make fun of my crooked eye and glasses.  When I started really going through puberty and my metabolism seemed to kick into high gear, people would point out how skinny I was.  It hasn't been until maybe three years ago that I finally started appreciating how I look, scars and all.  I'm grateful that my girlfriend has helped me see that I don't look as bad as I sometimes still think.  This is definitely still a work in progress, but I'm proud of how far I've come :)", "subreddit": "BodyAcceptance"}
{"post_id": "aw6073", "created_utc": 1551453347, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "aw6dgd", "created_utc": 1551455363, "title": "Flatchested and I hate it", "author": "[deleted]", "self_text": "I'm 15 and I'm pretty much flat chested. My boobs are tiny. I lost weight and they got smaller even though they were small in the first place. Now I wear and old sports bra since it's the only think that fits me and I used to wear this bra in 8th grade. \nI already was self conscious and hated my body but I used to not care about breast size and now I'm really upset. \n\n\n\nNow I hate every single thing on my body and about my body yaaaayyy accomplishments.", "subreddit": "BodyAcceptance"}
{"post_id": "awajkn", "created_utc": 1551479050, "title": "A blog titled \"I'm Fat and I'm Not Going to Lose Weight for My Wedding\"", "author": "Jinxy903", "self_text": "&amp;#x200B;\n\nhttps://i.redd.it/5rsf657m1lj21.png\n\nhttps://i.redd.it/pihoys7m1lj21.png\n\n[TLDR; \\\\\"Losing weight is exhausting \\(Oh really?? I had no idea\\), so I don't want to look my best when I marry my fiancé. Also, people saying that you look good after losing weight are damning you and robbing you of your body autonomy!\\\\\"](https://i.redd.it/grbrcd7m1lj21.png)", "subreddit": "fatlogic"}
{"post_id": "awimqy", "created_utc": 1551539402, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "awm2xt", "created_utc": 1551559199, "title": "Learning to love me", "author": "Ness_quik", "self_text": "Being bigger up top than bottom, but not necessarily slim or chubby, makes it hard to feel to fit in a specific category.  Not being easily categorized can be both a curse and blessing. I’ve got a big chest, a round tummy, shapely legs and plump little rump and I’m trying to come to terms with all these aspects of myself! What is your body type like? What are you favorite things about it?", "subreddit": "BodyAcceptance"}
{"post_id": "awnogn", "created_utc": 1551568461, "title": "Deformity?", "author": "maddiokii", "self_text": "Anyone else have a deformity that impacts how they live ? For me I have a foot deformity that affects what shoes im able to wear. Im very self conscious about it and I hate it. ", "subreddit": "BodyAcceptance"}
{"post_id": "ax8nt1", "created_utc": 1551715178, "title": "Meta Monday Mardi Gras selfies", "author": "maybesaydie", "self_text": "We're celebrating Mardi Gras a day early with a selfie post. Pictures of pets are allowed too. So post your own fine self, your kitties, dogs, lizards, fish, snakes, guinea pigs, horses  and hamsters.) Bon Fortune!", "subreddit": "fatlogic"}
{"post_id": "axm5ir", "created_utc": 1551798597, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "axoopd", "created_utc": 1551811897, "title": "I see myself as fat...but no one else does", "author": "StarfireRoth", "self_text": "I am disgusted with the way I look. I even stopped looking at myself in mirrors. I am classified as overweight but no one else sees it. Whenever I see a picture of myself, I can’t focus on anything else except my giant stomach and my multiple chins. I try to diet and excersise. I usually end up stepping on the scale about ten times a day hoping for some sort of miracle. My entire family doesn’t believe I’m fat but I don’t understand why can’t I see what they see. ", "subreddit": "BodyImage"}
{"post_id": "axzubb", "created_utc": 1551885051, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "ay0dul", "created_utc": 1551888045, "title": "Frustrated with mental health medications", "author": "1111sunshine1111", "self_text": "So last year I was on Wellbutrin for my depression and the entire year I maintained a weight of 125ish which felt perfect for my 5’5” frame. I still had trouble last year with body image but was getting better and starting to look at photos of myself and not immediately pick myself apart. This August my psych recommended I switch to Lexapro. I did and spent the first 3 months on it fighting weight gain. Eating less than I did last year and exercising more and still gaining weight up to about 132-134 pounds. This was still ok but not where I wanted to be. At this point I am flipping back and forth between starving myself and binge eating and weigh around 137lbs.. 12 pounds more than this time last year. I am really sad about it because it’s not even my fault. Weight gain is a common issue when taking lexapro and so I decided to stop the medication a couple weeks ago but the weight hasn’t budged. I’m trying so hard. Body weight is a huge part of my anxiety because 4 years ago I actually weighed almost 175lbs so losing the weight was huge for me- boosted my confidence immensely. Now. I have this fear that I’ll gain more and more and that my boyfriend- who started crushing on my 128lb body will no longer find me attractive with so much extra weight on my hips and thighs. Idk what I’m looking to get out of this post but needed to get it off my chest to more than just my journal. I guess if you have weightloss tips in addition to ways to build up your body confidence/acceptance that would be greatly appreciated ", "subreddit": "BodyImage"}
{"post_id": "ay6kcj", "created_utc": 1551920558, "title": "I feel like I'm fat and gaining more weight but in reality I'm probably fine", "author": "tokoro36", "self_text": "I've felt like this in general for years but now it's worse. When I went to the doctors a few weeks, they weighed me and I'm 4 more pounds than what I was the last time I went which was about 2 months ago(my weight went from 135 to 139). I'm starting to eat less and avoid junk food but I'm afraid that it'll be like what it was before which I avoided eating all together for the most part. I hate my chest specifically for the fact that I have slight man boobs and I feel disgusting all over my body. I dont really know what to do at this point, in all honesty. I'm trying to build up discipline so eventually I'll have the discipline to work out but I just needed to let this stuff off my chest and maybe gets some help.\n\nApologies for any grammar mistakes or bad explanations. I'll elaborate on stuff if you need me too.", "subreddit": "BodyImage"}
{"post_id": "ayac81", "created_utc": 1551946857, "title": "Why are my areola so huge?", "author": "whiteflowers73", "self_text": "Everyone says it’s a genetic thing but I’ve seen both my parent’s nipples and they’re small. I’m so ?", "subreddit": "BodyAcceptance"}
{"post_id": "aydm1a", "created_utc": 1551971447, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "aye1g9", "created_utc": 1551973875, "title": "DAE feel tired of body positivity / acceptance and just want to mostly FORGET about they look?", "author": "0seagirl", "self_text": "I feel this. I obsessed over my looks when I was thin. I obsessed over my looks when I gained weight. I thought I was ugly when I was actually young and pretty; now I'm an older woman I think I look worse and I worry I'll just look uglier as I age further.. \n\nI'm indescribably tired. Of ALL of this. Tired of checking how I look. Tired of this cycle of dieting and then putting weight back on. Tired of clothes shopping. Tired of comparing myself to other women Tired of thinking back to memories of how parents, family members, or ex-boyfriends treated me or criticized my looks, or emphasized my looks in a positive or negative way. Tired of worrying about my weight. Tired of going over to reddits which show pictures of women without photoshop / facetune for reassurance. Tired of analyzing how much cellulite I have. Tired of body positivity. Tired of everything related to looks. \n\nAll I want is for this whole cycle to end and for constant emphasis on my appearance to simply come to an end. I mean sure, hygiene, brushing my hair, etc? All fine. I don't mean I want to give up self-care, just that I wish the fixation on aesthetics could just stop. ", "subreddit": "BodyAcceptance"}
{"post_id": "aymsjt", "created_utc": 1552024251, "title": "What has helped you?", "author": "WesternNewt", "self_text": "Hi everyone. I've really been struggling with my body image lately and I don't know how to fix it. I have a bald spot on the back of my head and overall super thin hair due to SSRI-induced hair loss (I was on them for years, and I've been off them for about 3 months but the hair is still falling out :) ). It's not huge or anything, but I'm constantly aware of it and I have to stop myself from constantly checking to see if my hair is arranged so it's sort of covered. I've gained ten pounds in a couple months due to eating my emotions (15-20 in the past 2 years) and it seems to go directly to my midsection. I have like 1 pair of pants left that fit me. I've been living in leggings and oversized sweatshirts to try and hide my body. \\[Not sure if sharing this stuff breaks rule 3, I can delete if so\\]. My skin has also been terrible recently. It's always been pretty bad, but I did 2 courses of Accutane (which was fun) that got it under control for a while, but the acne seems to be coming back. With this combination of things, I really feel like I don't want to leave the house. I haven't gone out with friends in weeks and the thought of being in a picture makes me terrified. When I'm listing all this out, it really feels petty and stupid. I have a healthy, normal body. But I'm tired of feeling this way and I'm wondering if it will go away. Has anyone had success accepting themselves? Do you have any advice? ", "subreddit": "BodyAcceptance"}
{"post_id": "ayrc61", "created_utc": 1552057999, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "ays48s", "created_utc": 1552062252, "title": "Is it because I'm overweight?", "author": "TrapsAreGreat2020", "self_text": "I'm an overweight person, I'm in my early twenties and I'm not overweight enough that it's a super health problem but I'm definitely not skinny. I've never really had any good luck with the dating world partially due to some confidence issues on my part. I really need another person's opinion on this. Is the reason I don't get as many right swipes on Tinder as my skinnier friends do that I'm overweight? When I was young I always heard the term \"chubby chaser\" and it gave me hope despite it being a pretty offencive title. I feel like knowing that there's at least a small percentage of people who are attracted to people my size would help me in my body acceptance. Good or bad, I just want to hear what you have to say.\n\nEdit: IDK if this matters or effects your answers but I am a male.", "subreddit": "BodyAcceptance"}
{"post_id": "aytgm9", "created_utc": 1552069291, "title": "I'm never gonna be able to accept my body", "author": "[deleted]", "self_text": "With all the body hair I have (as a girl) I've already accepted the fact that I'm never going to love myself. I want laser hair removal but knowing my luck that probably won't work. I've just come to terms that I'm gonna wake up every morning for the rest of my life miserable. I just can't accept myself, I mean hell I can barely look at myself. I'm so over myself. ", "subreddit": "BodyAcceptance"}
{"post_id": "aytqc7", "created_utc": 1552070701, "title": "Beginning this body acceptance journey", "author": "Frenchbulldog716", "self_text": "I've been feeling down about my body lately. It's changing as I get older, my clothes are not fitting the way they used to, etc. This has led me down a path of body acceptance podcasts, instagrammers, etc. Yesterday, someone at work made a comment, intending to be a compliment, that I took as such, but it was still an observation about my body. This has kind of sent me spiraling, just realizing that people are looking and judging me to some extent.\n\nI tried talking to my best friend about this topic and she is supportive, but dealing with her own body acceptance struggles, combined with a chronic illness that can effect her weight (in other words, I think it may be tone-deaf to keep chatting about this with her). I tried talking to my husband and he said I look great to him and I should just wear tighter clothes (umm, sweet but not helpful). \n\nThen I tried talking to my mom. She suggested I set a fitness goal for myself to think about the good things my body can accomplish instead of what it looks like. I have no desire to do this, and I can't quite put my finger on why this comment bothers me. Maybe because I feel like she was encouraging me to do something that might change the way my body looks as a side benefit?\n\nI guess I just felt like getting some feedback. Maybe I should stop trying to talk to people IRL who aren't quite where I am on the body acceptance path.", "subreddit": "BodyAcceptance"}
{"post_id": "az25nc", "created_utc": 1552127213, "title": "I never feel confident while wearing eyeglasses", "author": "Grundylowx", "self_text": "Since I'm a kid I need eyeglasses because my right eye has a very poor view. But when I was a teenager I stopped wearing my glasses because I always hated it. When I was a kid I was told that glasses aren't cool and makes people ugly, and even if I think that glasses looks actually good on certain people, I keep thinking that it makes me look ugly and bad. [ sorry for the mistakes in english, I'm french ]. Anyway, now that I'm in my late twenties I start to consider that it would be cool to see correctly in my everyday life, and when I'm wearing glasses I see like in 1080p instead of DVDRIP when I don't wear them.\nSo, how can I accept those glasses on me and feel confident wearing them ? I tried several different frames and styles of eyeglasses but I never end up liking them. ", "subreddit": "BodyAcceptance"}
{"post_id": "az4ea5", "created_utc": 1552144186, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "az5jkh", "created_utc": 1552151027, "title": "\"I was so fat!\"", "author": "LauanMafia", "self_text": "Why is it that when \"present-US\" sees \"past-US\", we always tell ourself, \"Wow, I used to be so slim/ hot/ just NOT FAT\"\n\nBut then we can recall that \"Past-US\" had the exact thing going on with past-past-US. YOU FEEL ME? ", "subreddit": "BodyAcceptance"}
{"post_id": "az669y", "created_utc": 1552154611, "title": "[Academic] A Quantitative analysis into men body perception (Men +18)", "author": "SusyMSc", "self_text": "**A Survey into men body perception**\n\n&amp;#x200B;\n\nWe are looking to recruit men over 18 years old and good command of English for a research about body perception.\n\nIt is an online questionnaire which will only take **15 minutes** of your time.As a thank you, you will be entered into a draw to win a **£10 Amazon voucher.**\n\n**The study project**My name is Susana Alarcon Jimenez, a MSc Health Psychology student at the University of the West of England.This study is focused on men’s appearance\\*\\*,\\*\\* the current literature suggests that those problems experienced by individuals who have issues with their appearance, are mainly psychosocial and these problems are associated with appearance self-schema content and its organisation.Appearance self-schema is the set of ideas and beliefs that we have about our appearance, which affect our behaviour and expectations.There are two types of appearance self-schema:\n\n1. Salience: the degree to which self-relevant appearance information is brought to consciousness.\n2. Valence: The evaluation of our appearance in a positive or negative way. \n\nIf we understand the components of appearance self-schema, we will be able to identify the individuals that might be more prominent to suffer appearance distress and help to change their perceptions. Thus, body image concern usually is associated to women, so it is important that practitioners recognise the existence of these issues in men and understand how to assist men. The aim of the present online survey is to explore body self-appearance perception and the impact on fear of negative evaluation. The study takes place entirely online and consists of a 15 minutes single session in which participants are simply asked to fill out some questionnaires.\n\n&amp;#x200B;\n\nThank you for your time!\n\n&amp;#x200B;\n\nIf you would like to have more information about the study or if you have any question, please contact:**Susana Alarcon Jimenez (**[**Susana2.AlarconJimenez@live.uwe.ac.uk**](mailto:Susana2.AlarconJimenez@live.uwe.ac.uk)\\*\\*)\\*\\*The University of the West of England, Faculty of Health and Applied Sciences, Frenchay Campus, Coldharbour Lane, Bristol, BS16 1QY - 0117 965 6261", "subreddit": "BodyImage"}
{"post_id": "az71hf", "created_utc": 1552159498, "title": "Shitty morning", "author": "[deleted]", "self_text": "I woke up today wishing I was pretty like every other girl at my school. I wish I wasn't hairy. I wish I was comfortable in my body. I hate my body hair so fucking much. God I wish I was just dead.", "subreddit": "BodyAcceptance"}
{"post_id": "azdeww", "created_utc": 1552202994, "title": "How does one get over low self-esteem?", "author": "cryosleeping", "self_text": "My low opinion of my own body really hurts sometimes. I've made strides in trying to improve myself and accept myself but it feels like I'll never truly accept my body. Lately I've been ruminating over the fact that an fwb of mine doesn't really like me that much, doesn't see me as boyfriend material. I think it could be because I sometimes struggle to carry myself with confidence, but I don't really know how to fake confidence convincingly, and I'll never have true confidence because there's something in the back of my mind telling me that it's not my personality, that it's because she wants someone better than me, taller than me, etc\n\nI hate agonizing over this shit. Feels like the only way to learn to love myself is to form a real human connection with someone who looks past my imperfections, but I'm too insecure to maintain anyone's interest, and who knows if that would help me anyways. I think i need to love myself first, but don't know if thats possible. Feels like I'm going to deal with this forever", "subreddit": "BodyAcceptance"}
{"post_id": "azqaa6", "created_utc": 1552287716, "title": "The bathing suit battle", "author": "mmmoookkkaayy", "self_text": "I am so scared. I’m going on a cruise in May, and as excited as I am, I’m having MAJOR anxiety about being in a bathing suit. I’m 5’3” and about 160lbs. I carry all my weight in my midsection. I would love to not worry and just enjoy the sun and sand, but I worry that all I will do is fidget uncomfortably because I’m half naked outside somewhere. I know that no one else but me cares about how I look— but I’m terrified. I can’t even look at swimsuits to buy without feeling worthless and disgusting. Does anyone have any good tips for getting past this swim suit barrier? ", "subreddit": "BodyAcceptance"}
{"post_id": "azqvkd", "created_utc": 1552292443, "title": "How do I get over horrible small chest insecurities", "author": "mjgvjinjk", "self_text": "I’ve always been kind of insecure about my chest..I’m pretty flat. And asymmetrical.\n\nI thought I was getting over it and starting to feel confident until I had my first relationship. It took me forever to feel comfortable being completely topless and the first thing my ex said was “they’re asymmetrical.” I was never that insecure about the asymmetry but now it’s constantly on my mind. I hate that he affected me that way. At one point a few months into our relationship, he also told me that he preferred me with my shirt on. That also really stung. Lots of things in that relationship took a huge toll on my self esteem. I’m struggling with a lot and I hate that he had this effect on me but I don’t really know how to be comfortable with my chest anymore and I’m really reluctant to go out in swimwear or take off my bra ever again.\n\n\n", "subreddit": "BodyAcceptance"}
{"post_id": "azubpd", "created_utc": 1552315860, "title": "Hey, hey, it's MetaMonday!", "author": "maybesaydie", "self_text": "We have no pressing concerns this week so please take this opportunity to talk among yourselves.\n\n\nQuestions for the mods? Ask below and we'll do our best to answer.", "subreddit": "fatlogic"}
{"post_id": "azuoyc", "created_utc": 1552317855, "title": "I really just need to get this out.", "author": "curious-chickadee", "self_text": "I’m very much on the line of I can wear regular clothes or plus size clothes, and that part of it is great, but my actual size is the issue. If I go to a plus size group and post my outfit or even just a selfie I get told that I’m not plus-size and honestly sometimes get berated, and shamed that I’m not big enough. However, this also goes the opposite way for regular fashion groups. I’ll have people tell me I’m fat or that I should go find a plus size group to be apart of. I feel like I can’t find anywhere I belong. Nobody supports me. I have body issues just like that rest of us. Why is it so hard for me to find support? I’m a teenage girl that’s had a woman’s body since I started middle school. I looked like my friends mom when we all hung out. I have issues too. I really just needed to let that out somewhere and I don’t know where. I’ve tried to talk to family about it, but they just say “what are you doing in a plus size group anyway?”, “You’re not plus size.”, and the usual “Calm down.” I need support too.", "subreddit": "BodyAcceptance"}
{"post_id": "b08i30", "created_utc": 1552401516, "title": "I was called fat today and I am so upset and hurt.", "author": "stross525", "self_text": "This morning before classes started, I was talking to friends. Another \"friend\" (very small) came up and said to the side of friends on is side \"Look how fat (name) is.\" When I heard it, I couldn't even believe it! He is the most uncaring, rudest person I have ever met. And it is abnormal for him to do that. Usually he is nice and fun. When he said that, they just stared at me. All of them. I looked back with complete disbelief. See, they said nothing at all. Just looked at me. Didn't say I'm not fat, etc. That brings me to conclusion that I really AM fat. But am I really!?!? I'm 185 lbs, 15 years, 5'11\". It just ruined my day completely. I don't know what to do, I feel so overwhelmed and I can't believe he said that, hurting me so badly. But I'm physically not fat, but overweight. I am honestly thinking of just ending my life sometime. Why not? I can't stand being in my body, with looks and comments like his. I don't know what to do, if someone could help please do.", "subreddit": "BodyAcceptance"}
{"post_id": "b08ug6", "created_utc": 1552403405, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b0g62m", "created_utc": 1552441238, "title": "Feeling my body through Kitty Cavalier", "author": "mystecrow", "self_text": "Hello everyone! If anyone is not familiar with Kitty Cavalier, she used to do programs promoting feeling your sensuality and your body. I have one of her programs and would like to connect with other people who have taken her class(es) or have been inspired by her!", "subreddit": "BodyAcceptance"}
{"post_id": "b0n374", "created_utc": 1552489874, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "b0stn7", "created_utc": 1552518657, "title": "Hello.", "author": "mlinda12345", "self_text": "First time posting here. Not sure if this is right but here goes nothing. \n\nI am a 25 year old with a good ish body -cellulite maybe but it’s alright.\n\n\nMy problem is my face. I had a overbite when I was younger and I had work done to correct it. Didn’t do the after care though and when I see myself from the side I hate it. I could cry. \n\nI hate my face I have dull skin and big bags under my eyes and a big old nose.  I’m also adopted so every time I look at myself I see my birth parents looking back at me. \n\nI struggle so much. I tell my boyfriend who is amazing with me that he should leave me because he’s better looking then I am and I just cannot shake this feeling. \n\nDoes anyone have any advice ?? ", "subreddit": "BodyAcceptance"}
{"post_id": "b0w47q", "created_utc": 1552538669, "title": "Wedding fears", "author": "boqz", "self_text": "I’m really struggling. I’ve just become “fat” in the last 2 years after years of yo-yo dieting and self loathing. I’m getting married in 3 months and cried for 2 hours tonight about not losing weight and the fact that I will be a fat bride which means I’m not “pretty.” How do I shake this? I’m so excited to marry my fiancé and the fact that these feelings are interfering with my excitement is such bullshit. My family has always fat shamed and I’m stupidly worried about what they think. Also I’m getting married, why should I feel so worried about having a double chin??", "subreddit": "BodyAcceptance"}
{"post_id": "b11gi1", "created_utc": 1552576249, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "b1g3q6", "created_utc": 1552662801, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b1ma5f", "created_utc": 1552695644, "title": "My mom is body shaming me.", "author": "curiousbloodmage", "self_text": "Hello, everyone. This is my first post here. I'm a 21 year old female, weighing about 150 pounds and I'm 5'2\". All of my life, growing up, I was small. I stayed around 30 pounds underweight for my age and height most of my life. I was shamed for my size by friends and family, who told me I was just skin and bone. When I started college, I was 90 pounds, still 30 pounds underweight. I ate a lot and never gained the weight. My sophomore year of college, I went through a bad break up and started to cut back on eating. I was diagnosed with depression and anxiety, which I struggle with today. I met my now husband in 2016, weighing at 95 pounds and eating one meal a day. \nObviously, I now weigh more and I'm getting criticism for it. My mom has been overweight all of her life, but has just recently lost a lot of weight. I am super proud of her for doing that. However, I feel like she's using that as leverage against me to... well, I don't really know her aim. I don't believe in jean sizes because I can fit in an 8 in one brand and a 12 in another. I bought some new pants at a thrift store (16s) and visited my mom today wearing them. She looked at me in dismay and after a moment said: \"Do you realize I'm wearing 16s now and going down to 14s? Just how big are you planning to get?\"\n\nI wake up and go to bed not wanting to look at myself naked because I feel disgusting. I've gained stretch marks because of my weight. I have scars in addition from self harm. My husband loves me and tells me I look my best since he's met me, but my brain refuses to believe it. I'm so sick of feeling this way. I never feel confident in my \"cute\" clothes. I don't eat healthy because I have issues with texture, so I blame myself for all of it. I want to tell myself I'm beautiful and that I don't need to be skinny, but it's hard when I'm hearing this from my own mother. \n\nI don't know what to believe anymore. I've stumbled back into hurting myself because of this, on top of just being married, working, and being a full time stupid. \n\nHow do I pull myself out of this? I just want to be happy. \n\nI'm sorry for the long post. I hope whoever reads this has a great day~", "subreddit": "BodyAcceptance"}
{"post_id": "b1o3jn", "created_utc": 1552707467, "title": "trying not to equate weight with worth", "author": "SMMFA21", "self_text": "I’ve never posted on here before, but I feel like this is the right place for it. \n\nI was really REALLY skinny as a teenager, and was evenly jokingly called Skeletor which makes no sense because he’s buff AF, but anyway...\n\nOver the last couple years I’ve gained weight in my thighs and hips especially, and I’m so self conscious about it. I feel like there are days where there’s waves of body positivity and others where I feel terrible if I think I’ve eaten too much. My parents used to frequently say things like “a minute on the lips, a lifetime on the hips” and other toxic phrases like that, so those kinds of thoughts can weigh heavily on my mind. \n\nI’m lucky to have a wonderful boyfriend (28m) who makes me feel loved and tells me that he thinks I’m beautiful every day. It’s really great and I feel so lucky to share my life with him, but my self-image eats away at me sometimes and I don’t know how to reframe my thoughts.\n\nDoes anyone have any advice?", "subreddit": "BodyAcceptance"}
{"post_id": "b1p0h9", "created_utc": 1552714087, "title": "love handles more like loathe handles", "author": "orbit4eva", "self_text": "i’m 17, 5’7 and 175 lbs. All that weight has gone to my stomach. It’s absolutely disgusting. every day i wish i was in someone else’s body. i hate mine so so so much. i’m scared to be intimate with people and i never take off my shirt for anyone. i used to wrap scarves around my waist to make it look thinner. i hate it. getting rid of it is starting to feel impossible, no matter how much i try. it’s such a depression feeling. i would sell my soul to the devil for a flat stomach. i would kill for a flat stomach. i would do ANYTHING. it’s bothering me so much, especially recently, that i can’t even focus on anything important. i keep thinking about how unattractive and fat and ugly i am. how do i make all of this go away :(", "subreddit": "BodyAcceptance"}
{"post_id": "b1se7v", "created_utc": 1552742684, "title": "I feel like everyone around me has a better body than me", "author": "Shannah-", "self_text": "I'm in college, and ever since I entered, I feel like every girl here has a better body than mine. Better in terms of physical appearance, most of them seem to have the slimmest bodies , super petite and the thing is , they eat much less healthier than I ever do. Now I'm not here trying to insult anyone's eating habits as that is totally up to them. However, I do eat relatively healthy everyday when I see em eating outside almost every day. Yet they seem to look skinnier. Having body insecurities have definitely morphed the way I look at life so much , normal things become a great deal of paranoia for me.  ", "subreddit": "BodyAcceptance"}
{"post_id": "b1tfcq", "created_utc": 1552748983, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "b1ui9c", "created_utc": 1552755078, "title": "I hate my body, especially my legs.", "author": "CocoZombie", "self_text": "Everything revolving my legs I hate it. I hate my upper body too but my legs. My legs are just something else..\n\nI have so much cellulite. I have stretchmarks running down my butt, thighs, knees, and back of my calves. Im F, 27, 5'1, and about 160. I lost about 15 pounds in almost a year, and i started to see the changes.\n\nJust when Im feeling confident, I look at my legs and how absolutely horrible they look. \n\nIf only you guys knew how bad they look, I bet youd agree too ", "subreddit": "BodyAcceptance"}
{"post_id": "b1xsc6", "created_utc": 1552772957, "title": "Close to Being Underweight", "author": "Olive336", "self_text": "Now, I’ll say it right now. I’m not overweight. It’s quite the contrary, actually. But before you go screaming that I’m a skinny, privileged white girl,  listen to what I say.\n\nI was a chubby kid. When I was around the age of 9-10, I was around 147 cm (4’10” ) with a weight of about 49.8 Kg (110 lbs). I have wretched memories of being bullied by people who I thought I was close too, and I began to lose self confidence because of that.\n\nPuberty hit me at the age of 10, and I became a solid 162 cm (5’4”) with a weight of 52.1 Kg (115 lbs) in only a short few months. I was still stared at because I was tall for the age group (not anymore) and I also weighed significantly more than the people who were only 40.8 Kg (90 lbs). As I began to secondary school, I started to fit more with my peers. \n\nAround August of last year I weighed around 53.9 Kg (119 lbs), and I was fine with that at the time, but the farther we get from August, the lower and lower my weight get. I’m 50.8 Kg (112 lbs) currently (and it’s still dropping). I know that some people would kill to be this skinny, but it’s not good when your own family thinks you’re anorexic. I will admit it’s on me for not eating as much as I should, and I blame only myself for that.\n\nI’m currently trying to simply keep my weight from continuing to fall. If I have to set goals to keep my weight up later, I’ll do that.\n\nNow, I don’t think I that I have bad body confidence. There have need certain individuals whom I know that made life hell for me, but I just hate how people either seem to call me fat or skinny. I’ll be working on just improving my confidence (which doesn’t help with social anxiety) and being a more outgoing, confident me.  \n\nCheers mates", "subreddit": "BodyAcceptance"}
{"post_id": "b1z43q", "created_utc": 1552781040, "title": "I'm thin and definitely have problems with my body", "author": "hufgf123", "self_text": "Slightly provactive title I admit. I've expressed concerns about my body to people before and I've always been told \"BUT YOU'RE SO SKINNY\".\n\nYeah, I guess I am, but I also feel like my body is falling apart, and I'm not even 30.\n\nA lot of these issues are things I've had for a decade or more, and are starting to catch up with me. I have scoliosis caused by one leg shorter than the other, so my spine  bends and twists a little, pushing my lower ribs out sort of like two horns, and meaning that one of my hips and shoulders is higher and more prominent than the other. My other shoulder also has a bump on the end of it, presumably due to an injury I suffered when I was a child. To this day that arm (my dominant one) is 15% weaker than the other, and I don't have full range of movement. My trouble with my spine has also caused my to have problems with my jaw, as well as some rather disgusting bowel problems.\n\nI'm looking into these problems now, but it... sucks to find out about there's not to much which can be changed. As a kid and even as a younger adult I coped with my body insecurities by hiding myself away in big baggy jumpers (even in the summer). Can't see my dodgy ribs or shoulders if I hide them, nananana!\n\nI don't want to live like that anymore.\n\nNot least because I've come out as trans. I was assigned male at birth and it's been a long road for me to accept my gender. Honestly I feel like the reason I didn't accept I was trans when I was younger was because I felt discomfort with my body. Even outside of my \"deformities\", I'm almost 200cm tall, with a long torso, giant hands and feet, and what feels like an oversized head compared to my body. Compared to the image of transwomen I saw in the media as cute and petite, I used to feel like I was some sort of seperate species of human, a *Homo weirdensis*.\n\nAnd so I acted out as weird. When I'm not being shy and reserved I'm massively exuberant and loud, like I'm trying to overcompensate for my low self worth.\n\nI do feel more comfortable in my gender now, but I still struggle to think of myself as someone who could be sexually appealing. I can think of myself as \"funny\", \"cute\" or \"silly\", but \"sexy\" feels absolutely beyond me. I know I would struggle to show my chest (and never my shoulders) to anyone. My bowel problems mean that, if I get a partner, I'll only be able to have oral sex with them. On many days I still feel like everything below about my eyelevel is absolutely pants, even though people swear blind to me that my body issues aren't noticeable. It's especially hard when the advice for being trans and the advice for body acceptance smash together.\n\nTrans: Change yourself to fit how you want to be!\n\nBody acceptance: Love yourself as you are, you're perfect\n\nWell... no, I'm not. But I guess I'm okay. And that'll have to do.", "subreddit": "BodyAcceptance"}
{"post_id": "b1zqxm", "created_utc": 1552784942, "title": "Comparing my body to other women online.", "author": "milmakingaway", "self_text": "Hi everyone. So I 22(F) can’t stop comparing my body to other women. I am 5’7 and 180 pounds which is slightest overweight but in my mind is very overweight. I was 220 pounds last year so I have lost quite a bit. I was anorexic as a teen so body insecurity is nothing new to me. Sometimes I cry and I see girls in public and online(Instagram,etc) and I actually get obsessed with comparing sometimes. Does anyone have any tips to stop this cycle? Because I know whenever I compare I’ll never be happy. I should probably stop looking at these Instagram models... ", "subreddit": "BodyAcceptance"}
{"post_id": "b1zvsi", "created_utc": 1552785796, "title": "My body type doesn't exist.", "author": "KriticalErrorArt", "self_text": "Very dramatic title there, and very exaggerated - Obviously my body type exists. But it's more... Metaphorical? I guess..?  \n\n\nIn society and media (especially the social variety!), I'm finding it more and more a struggle to accept what I look like.  \nI've always been overweight. The family pictures I've seen of me really young I'm even clearly overweight.\n\nI'm not happy about it? But I've somewhat accepted it.  \n\n\nThe issue I'm finding now though, is there's nowhere that body types like mine fit in..? And it's sorta hard to fully accept something when you feel like there's very little reflection of you out there.  \nYou type in \"chubby woman\", or \"thicc\", or any other variety of words you'd apply to someone - Hell, even curvy I've noticed this with now!  \nWhether it's on Google, Instagram Twitter, etc, it's all the same.  \nThe image results are either a clearly physically healthy woman, who's worked super hard to tone her body and muscle train certain areas of her body, like her thighs, ass, calves, hips (I don't know the technical muscle names) - Looking utterly gorgeous.  \nORRRRR  \nThey're BBW, fucking Goddesses absolutely killing it and looking damn sexy as they do!  \n\n\nBoth types are SUPER slaying it - But I get left sort of thinkin'.. I always thought chubby or thicc were words that applied to people that looked like me? Or similar to me? But no one like me EVER comes up when you search those things - I actually find it REALLY hard finding ANYONE at all with a similar body type to me.  \nNo influencers.  \nNo celebrities.  \nNo insta models.  \nNo big names on Twitter or any other social media.  \nNothing.  \n\n\nAnd It's almost like there's nowhere for us to fit in, there's nothing for us.  \nI'm perpetually both too fat, and not fat enough to fit really anywhere. And it's actually kind of... I don't even know how to describe it?   \nIt's all the more prevalent when going into a plus size shop, or surfing plus size websites online and someone sees- And I get weird looks from people like \"What're you doing going in there or looking at that?\"   \nLike I shouldn't be anywhere near those types of stores, because they're \"not for me\"  \nAnd then similarly if I go to regular clothes places - I yet again, get weird looks like \"What're you doing? A crop top, for your body? Maybe try somewhere else hun.\" \"lol, have fun squeezing into that\"  \n\n\nI mean, maybe it's in my head to a degree the latter part - just the snide looks I'm assuming what's going through peoples heads.  \nBut I've been into plus size shops and found myself treated very coldly, very unwelcome, and had comments from people I know in the past confused at why I'm going in those types of places.  \n\n\nI don't even know, I'm just babbling and repeating myself at this point. Not even sure what kind of responses I'm hoping for or wanting - Just.. can anyone else relate? I guess??  \n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n\n\nTLDR;   \nBoth too fat and not fat enough to fit in anywhere.   \nVery little representation of my body type like.. ANYWHERE (Unless I've just somehow found myself in a bodily echo chamber lol :') )  \n", "subreddit": "BodyAcceptance"}
{"post_id": "b20use", "created_utc": 1552792184, "title": "Why are sleeves so tiny?", "author": "CoralNiechelle", "self_text": "Like... The arm sleeves in a L/XL/1X/2X are the size of arms in a size medium. I mean no hate to ladies with thin arms who need larger clothes but...\n\nIf the garment fits loosely on my body, and the arms aren't designed to be skin tight, WHY AM I BUSTING OUT OF THEM?\n\n", "subreddit": "BodyAcceptance"}
{"post_id": "b2108f", "created_utc": 1552793257, "title": "Telling people what size jeans I think they should buy is making me feel terrible.", "author": "illbeyrbird", "self_text": "I feel, and i’m not sure if anyone else agrees, that how something “should fit” is a social construct. It’s up to you how you think your clothes should fit. I’m tired of tell girls to buy the smaller size pants because they’ll stretch. I want them to leave my store feeling amazing about their new clothes, not worried they won’t stretch to meet their body size. Even if I know they will stretch.", "subreddit": "BodyAcceptance"}
{"post_id": "b2j3gm", "created_utc": 1552917788, "title": "Can I just find pants that don't dig into my stomach!?", "author": "TattyByeee", "self_text": "Helloooo friends!\n\n&amp;#x200B;\n\nI've recently come into this mindset that clothes need to fit me, not the other way around. While it's been a super helpful framework for me, I can't escape the terrible-ness that are tight waistbands, which are like a constant reminder of my self consciousness about my tum. I just cannot find pants or skirts that don't dig into my tummy and cause painful red lines! It's so frustrating!!!!\n\n&amp;#x200B;\n\nDoes anyone have recommendations for good brands or pants that have stretchy waistbands, or better yet, elastic??\n\n&amp;#x200B;\n\nThank you so much &lt;3", "subreddit": "BodyAcceptance"}
{"post_id": "b2jw99", "created_utc": 1552922130, "title": "MetaMonday: Good Morning!", "author": "maybesaydie", "self_text": "Sadly, there have been more comments needing removal than usual in the past weeks. Because of this we'd like to remind you that we have subscribers of all weights here and that this subreddit is by no means r/bitchaboutfatpeople. Keep your comments civil, please.\n\nWe're here to point out popular fallacies about weight loss and the futility of fat acceptance as a path to happiness and health. r/Insults is the place for mean comments. Give them your contribution  if that's what you're here to do. We aren't interested.\n\n\nThanks to those who take the time to report comments and submissions. It helps us more than you will ever know. We will be considering the addition of mods from the community soon so watch for the announcement/application post.\n\nNext selfie post will be Easter Monday, 4/22/19.\n\n\nComplaints, questions or comments? Make a comment below", "subreddit": "fatlogic"}
{"post_id": "b2m875", "created_utc": 1552933814, "title": "Instagram is starting to mess with my head", "author": "rsewtrr", "self_text": "I know that you’re not suppose to compare yourself but it’s hard. I feel like Instagram is really making insecure, to the point where, I feel afraid to post myself anymore and I pick at every flaw in myself, to the point where I wanna cry because I believe I’m so incredibly ugly. Idk what to do.", "subreddit": "BodyAcceptance"}
{"post_id": "b2n4ae", "created_utc": 1552938274, "title": "Lists", "author": "maddiokii", "self_text": "Does anyone else here make lists of all the things that bother them? I guess it makes me feel better to identify my flaws and list them down so maybe I can work on fixing them and most of them have solutions what really upsets me though are the ones I know I'm stuck with or the ones I know will take a lot of time and work to fix. Money isn't even an issue for me. But yeah idk if it's OCD but I'm constantly checking myself and my flaws. ", "subreddit": "BodyAcceptance"}
{"post_id": "b2s5ga", "created_utc": 1552965019, "title": "Learning to love myself", "author": "edgysaltines", "self_text": "I’m a 22y/o who’s extra thicc tbh, and I recently started seeing someone and we clicked immediately. After the first few dates, we spent the night together. I’ve always been super self conscious when I’m getting intimate with someone so I automatically try to cover up and hide myself; \nbut this time was different.\nIdk what it was, maybe the way he looked at me and the way he touched all the places I wanted to hide away. I’ve never felt that beautiful while being so vulnerable. Its made learning to love my body and myself so much easier. I just thought I should share because the smallest things can make the biggest impacts&lt;3\n", "subreddit": "BodyAcceptance"}
{"post_id": "b2sk90", "created_utc": 1552967626, "title": "I’m afraid no one will be interested in me because of my body and stretch marks", "author": "throwaway1313013", "self_text": "Hi, this is my first time ever posting anything onto reddit, plus I’m on mobile so I apologize if I say too much, I just have a lot I want to get off of my chest. I’m an eighteen year old woman who’s only been in one relationship. At the beginning of that relationship, I was fourteen years old and I was pretty thin (or “average sized” I guess) because my metabolism hadn’t caught up to me quite yet. A year or two passed by and I gained fifty pounds. It happened so suddenly I didn’t even notice it right away.\n\nMy ex boyfriend told me he loved my body, and I felt so lucky because I felt like no one else would be capable of loving my body. I developed a lot of stretch marks on my stomach after I gained all of that weight. He said he still loved my body, and I’m sure he did, but ever since I gained all of that weight I felt like he was lying. \n\nDon’t get me wrong, I think stretch marks are beautiful and they’re also just natural! However, the bodies you see on Instagram or twitter or whatever usually don’t have any visible stretch marks. Even if they do have stretch marks, they’re usually faded quite a bit and you can’t even see them that well. It makes me feel like having stretch marks is unnatural and something to hide. I never wear crop tops and I always have my jeans high waisted. \n\nI hate that I care so much about what other people think of me. I personally am not picky about people’s body types and I rarely even notice anyone’s body. But I still feel like everybody’s looking at me because I’m not super thin or “slim thick” lol. When my ex boyfriend dumped me (for reasons unrelated to my body), I felt like no one was capable of loving me again. I have felt connections with other guys since then, but it never goes anywhere and I always just assume it’s because of how I look.\n\nI really want to believe I have a beautiful body. But it’s so discouraging going to the store to try on clothes and not finding anything that fits. It makes me even more self conscious so I end up not even buying clothes. I only have around three tops and two pairs of jeans and I don’t feel like I look good in those anyhow. \n\nI want to be able to love my body like how other people around me seem to. I’ve heard so many quotes and stories about body positivity, but nothing has stuck with me long enough to make me feel a bit better. I feel like I’m the only one on earth going through this (even though I know I’m definitely not!). I guess I’m posting this because I am looking for some sort of advice? I know that’s vague but I don’t really know what else to say. I just want to feel not alone.\n\nI’m so sorry this is so long! If you even read any of this, thank you, I appreciate it. ", "subreddit": "BodyAcceptance"}
{"post_id": "b2yke5", "created_utc": 1553008242, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b3ckaa", "created_utc": 1553091456, "title": "Tell Me Your Recovery Story?", "author": "sispad", "self_text": "Hi everyone.\n\nI'm doing a film project, a series of five 2-5 min shorts, on eating disorder recovery. I’m exploring the process of recovery through the five stages of grief (Denial, Anger, Bargaining, Depression, Acceptance), and I’m looking to hear other people's thoughts.\n\nOne of the reason I’m looking for help and not just mining my own experience is because eating disorder-related media is overwhelmingly about young, white, middle class females with anorexia (hello, hi, it me). I don’t want to just add to that pile. Not that those stories aren't important or don't exist or don't deserve representation- but it's not the only thing out there and mainstream culture is currently pretending it is, which is helping no one. \n\nSo, I’m looking to collect stories/contributions tied to disordered eating of any kind: any disorder, diagnosed or not, of any length, **at any stage of recovery**, from any people of any age, gender, race, background, socio-economic status, etcetera (including the “white female with anorexia” descriptor above).\n\nI’m interested in gathering stories through any means that someone is willing to provide it: a simple story, a journal entry, a poem, a slam poem, a speech, a stream of consciousness, an essay, a soundbite, a monologue, or whatever else. \n\nHere's an anonymous form, if you'd like to go that route and not have it out there on the interwebz:\n\n([https://goo.gl/forms/rnXsGsgvEXWUPw7P2](https://goo.gl/forms/rnXsGsgvEXWUPw7P2?fbclid=IwAR3F_INXmeyHnquwTcpdylnAZgQYmRsGNOQwesWxKL7JZgimmZx1pRUcnGQ))\n\nI know this stuff is hard to talk about and hard to live, and I’d be forever grateful if anyone would be willing to trust me with their experiences in order to make something constructive and positive and recovery-focused. &lt;3\n\n(Also I am totally open to crediting or not crediting people for their contribution, depending on comfort.)  \n", "subreddit": "BodyAcceptance"}
{"post_id": "b3d6u3", "created_utc": 1553094772, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "b3ezq8", "created_utc": 1553103853, "title": "I don't actually want to be pretty but I still kinda do? But actually not?!?", "author": "toast_at_two", "self_text": "Sorry for the title, I just can't put my thoughts into short sentences properly! Also I don't really know what to think about this.... \n\nI was struggling quite a bit for the last few months and was hoping to find some perspective from people who don't feel like they 'have to' tell me I look fine. (Rant ahead)\n\n\nI know I look kinda okayish. Really, it isn't THAT bad. Also I wasn't always a person so invested in outer appearance.\nUltimately, this lead to a lot of bullying, because I didn't care about myself properly.\n\nNow I do but I am stuck in a work environment where the woman I work with seem to be very superficial. I am good friends with one of them and know they are not all about being beautiful! But I can't fail to recognize that looks and 'things' (and vacations and stuff like that) are the things those woman talk a lot about. They talk about it in regards of themselves but also about others.\nIt's a constant topic.\n\nAlso, they are all really beautiful, and I don't say that just because of low self esteem but when standing next to them I feel like I don't fit in. And I feel this immense pressure to 'get there'.\n\nThey all have clear skin, long hair, nice teeth and are skinny. I'm the complete opposite.\nI have acne scars and dull looking skin, short unhealthy hair, my front teeth are kinda going inwards (+ I can't and also kinda don't want to pay that much to get them fixed) and I am overweight.\n\nI am no beauty and I always thought that was ok and I could live with it but being in the presence of these woman I feel soooo inadequate. They seem to live exciting lives and also seem to be liked well and I can't not think that it has to do with their looks, at least a little bit.\n\nIn short, I envy them. I kind of want to be like them. But it kinda doesn't feel right, doesn't feel like 'me'.\nBut I'm afraid of not fitting in and people looking down at me for not doing that much to look better. I am no slob and I take good care of myself but I just have some features that don't necessarily make me look beautiful objectively.\n\nStrangers of reddit, how do I deal with this? I really like the workplace and it also doesn't seem really toxic, it's just the pressure I feel in myself without even knowing if it's appropriate.\nIt would be so nice if you could help me navigate this situation, since I think it has to do a lot with myself. \n\n\nWhat are some mindsets I should adapt so I can not feel pressured to keep up with them and feel more comfortable with my 'not-as-pretty' - self?\n\n\n\nTl;dr: I feel intimidated and pressured by pretty people. But I actually don't want to 'pursue' prettiness that much. (It doesn't feel like 'me'). How do I handle this? ", "subreddit": "BodyAcceptance"}
{"post_id": "b3gx4l", "created_utc": 1553113387, "title": "One little innocent thing I envy most other girls.. Small feet.", "author": "Ratlinger", "self_text": "I wear a size 40 EUR and I'm 161cm. I have always envied other girls feet, I find them so dainty and feminine.\n\nAt least I have pretty feet. They're just big.\n\nAbsolutely nothing i can do about it though... ", "subreddit": "BodyAcceptance"}
{"post_id": "b3myzn", "created_utc": 1553147887, "title": "Telling myself \"my body is beautiful\" but also that it doesn't define my worth.", "author": "iamthewanderess", "self_text": "The body movement has gained quite a bit of momentum over the past few years especially in part because of social media. Being a curvier girl in an industry that requires me to constantly be in front of the camera has had so many low moments I've had to overcome.My body has gone through so much change over the last 10 years of my adult life. I’ve had to learn to love my body when I didn’t have any booty at all ... to loving it when I have a lot of extra 🍑. To me - body positivity means to accept, love, and nurture our bodies throughout all of that change. To embrace the curves - even if there are people that I come across in my life or this industry who carelessly say things like “you can’t wear that because it’s too sexy - too revealing - too unflattering - TOO MUCH” (I used to have an agent that would try to steer me away from posting anything that would show my body too much) Hence why he got booted!I think above all, it’s imperative to understand that your worth and what’s happening with you physically are two entirely separate entities. You are ENOUGH. You are worthwhile regardless of what’s happening on the outside. I think it's important to be kind to yourself and cognizant of your thoughts - but also to realize that there will be occasions where some circumstances make it difficult to take care of yourself the way you would like to, in which case, just do the best you can in those moments and seek out support from those closest to you. The end goal is to create a space where we can all encourage, uplift, and empower one another to be the best versions of ourselves... And to be strong enough to diplomatically counter those who are trying to shame others due to their own internal battles. What are your thoughts??", "subreddit": "BodyAcceptance"}
{"post_id": "b3pve7", "created_utc": 1553170910, "title": "I hate myself for doing nothing about my utter disgust towards my body", "author": "banjlovesbins", "self_text": "Every time I leave the house all I can think about is how people are viewing me, if they too feel revulsion while catching glimpses of my body. I hate my self so, so much it makes me feel physically sick and no one I surround myself with understands how hard it is to push aside these thoughts and go out to parties and post photos on Instagram and have a good time in general. In all honesty I would love to just die, I’m not suicidal,  but I can’t help but think how much easier it would be to just cease to exist.   And I’m only in my mid teens, I’m terrified of the thought that this is how life will be like from now on. \n\nEven my best friend seems to be over my constant depressive states and how often I cry in front of the mirror when we’re getting ready to go out but I can’t seem to stop. Even though I can feel myself messing up every good thing I’ve got going for me because of how much I hate myself. I don’t talk often (like I used to) , I don’t wear the clothes I want to (like I used to) and I don’t feel like leaving my bed because I know how annoyed everyone gets with me when I do. I’ve become this burden, this fat lump who sucks the fun out of everything because of their own selfish issues and I hate my self so goddamn much for it. \n\nI guess what I’m asking is does anyone have any tips on how to get motivated and slowly start accepting yourself and making the changes you want to make? Not major ones like dieting or whatever but just small tips that you find helpful on your journey to body acceptance, I could really use some help :) ", "subreddit": "BodyAcceptance"}
{"post_id": "b3rnta", "created_utc": 1553181060, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "b3rph9", "created_utc": 1553181300, "title": "How do I feel confident about my small boobs?", "author": "shot_in_the_head", "self_text": "I am in an amazing relationship with my fiancé and he praises my body. He says he wouldn’t change anything. But when I look in the mirror, my mind tells me he is lying. He likes that I look young and I hate it. I have a teenager body. I have very small A cup breast and it makes me feel like a child. I literally google all of the time “how to love my small breasts” I watch videos, I read articles, and sometimes I will gain a little confidence but it always goes away. \n\nThere’s a lot of perks of having small boobs and I get that but they never outgrow the enormous societal and cultural stigma that we put on them. And I know my hatred of myself is because of the media brainwashing me into believe certain things are beautiful and other things aren’t. Or maybe it’s just my opinion. Maybe I personally do not think super small boobs are attractive. That’ doesn’t help. I’ve been bullied and ridiculed all of my puberty years about my build and guys never really liked me or thought I was “sexy” so maybe that plays a big part of why I hate myself. But I have someone who does think I’m sexy. Who loves me  yet I can’t shake the body hatred. I don’t understand. I don’t know what to do. ", "subreddit": "BodyAcceptance"}
{"post_id": "b3sbex", "created_utc": 1553184311, "title": "UPDATE: I'm struggling very badly with binge eating disorder, and after a huge change in my life six months ago, I've gained 60 pounds. I want to talk about what it's been like.", "author": "FatLogicThrowaway336", "self_text": "[Original post](https://www.reddit.com/r/fatlogic/comments/7p66e4/im_struggling_very_badly_with_binge_eating/)    \n\nIt's been a while since my post, so hopefully people remember me, I got a lot of PMs and comments and stuff so it seemed like I should update, especially because a lot has happened.  \n\nI just want to start out by saying that everyone was so nice, I love this subreddit and I've felt really welcomed here by everyone. I got so many encouraging messages and so many people in my corner and that really helped me a lot when I was struggling really bad.  \n\nThat being said, I want to be up front that my update is going to be controversial, I'm sure. So I'll just come out with it: I had weight loss surgery. I'm not here to debate the merits of weight loss surgery with anyone, so if that's your goal just walk away, please. I already had it, so I'm not getting talked out of it, and I'm really, really happy I did it, so you won't hear anything negative from me.  \n\nSo my post ended with me attempting to go to a weight loss program at the hospital I work for and getting turned away for my binge eating disorder. That sucked. I ugly cried in front of the dietician that was talking to us and felt like giving up.  \n\nAfter I picked myself back up I decided to try again to find a therapist. I had actually tried to do this several times during my weight gain and had not been successful. I'd asked my family doctor and my regular therapist for recommendations and they had none. I had also just looked up therapists in my area and the few that I found did not take my insurance. However this time around I did actually find someone. My therapist was a formerly obese man who had binge eating disorder and primarily treated patients for eating disorders. I only saw him a handful of times but he really challenged a lot of the ideas I had about food and thankfully I stopped binging almost right away. A lot of the things I had been doing to deal with the binge eating on my own had actually been fueling the binges. Calorie counting with an iron grip, denying myself all kinds of foods, and viewing food as the enemy and evil had really warped my mind. \n\nUnfortunately, the therapy helped a lot with the binging but I did not lose weight. In fact, it felt nearly impossible to lose weight because he had cautioned me against further calorie counting. He really wanted me to practice intuitive eating, which I did, but my weight kind of just leveled off. I ended up at 343 pounds as my highest.  \n\nAbout six months after I ended therapy with him, I started to entertain the idea of weight loss surgery. I'd been really, really staunchly against it in the past. I work in healthcare and I've seen my fair share of failures. I felt like, if you still have to have so much discipline for it to work, then what's the point? But I had a coworker that had had surgery, and she was really happy with it, over ten years out and still thin. And my mother in law also had surgery and is over five years out and much much happier and healthier. \n\nI did a lot of research and talked to my husband about it extensively and we decided we both wanted to do it. We picked a surgeon in August and started the process. As part of the approval process, they wanted us both to see a psychologist. Most people see the psychologist once or twice but I opted to see him on an ongoing basis. In fact I'm still seeing him. His help was immeasurable, even though I had stopped binging I was still emotional eating and he really helped me get to the bottom of it. I also saw an exercise physiologist, a dietician, and followed a weight loss program for several months before being approved. \n\nMy husband had surgery in December and I had surgery in January of this year. I'm happy to say that he went from 299 to 220 in that time, and I've gone from 343 to 275. This is truly the best thing I ever did. My life has improved dramatically and my relationship with food is so much better. I eat like I always wanted to be able to eat, but couldn't because of all the mental health issues, fucked up hunger cues and gigantic stomach. My sugar addiction is gone, I no longer have reactive hypoglycemia or get constant yeast infections. I can reach my butthole again lol! But honestly even if it weren't for all of that, I finally feel relief. I don't feel ruled by food anymore. I don't obsess about food. I don't hate every second I'm eating healthy food. The voice in my head is finally quiet. I've never in my life had this much control over food. It's amazing.  \n\nSo anyway, if anyone is interested in following my progress, my weight loss username is u/NothingLikePoetry. I haven't posted any progress pictures of myself yet (just my husband), but I plan to when I feel like I have something worth showing off. My goal weight is 150 pounds and for the first time in a long, long time I feel like I might actually be able to get there. ", "subreddit": "fatlogic"}
{"post_id": "b3t99u", "created_utc": 1553188895, "title": "I’m horrified to gain weight in college", "author": "Shana24601", "self_text": "I’ve always been relatively skinny and comfortable with my body, bit last year I started a birth control that made me gain about 15 pounds and it completely ruined my self image. I’m going to college next year and I’m absolutely horrified that I’ll gained “the freshman fifteen”. If I gain another fifteen pounds I know I will hate the way I look and I’m so scared ", "subreddit": "BodyAcceptance"}
{"post_id": "b4685h", "created_utc": 1553267601, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b48bc2", "created_utc": 1553278012, "title": "Hate my body but I love being naked with you", "author": "khrizle", "self_text": "I’ve been having a hard time accepting my body for as long as I can remember. I was really overweight and I would hide my insecurities by being the “loud confident big girl” but I hated myself. Then a lot of things happened and I became really really depressed \nI lost a lot of weight and everyone was complimenting me on how great I looked even though I felt the shittest I’ve ever felt in my life. My boobs have lost so much fat that they’ve lost their shape and are like little deflated balloons, I have excess skin and stretch marks all over my body from the rapid weight loss due to my depression. \nI have a lot of self harm scars everywhere and I often wear turtle necks and jeans all year round \n\nI recently shaved off all my hair, yes it was a Britney moment, and now it’s platinum blonde. Someone scouted me to join a modelling agency, I thought I was getting punked. I hate how I look, but my friends told me to go to their casting. They signed me. But now I am very anxious because I don’t want to wear anything that will show any sort of skin, I look “ok” with clothes on but if they asked me to wear a tank top or shorts, I have stretch marks, flabby skin and self harm scars everywhere. \n\nA lot of people call me beautiful, but I never really feel it. I hate how I look so much, and I feel so disconnected from my body because this new slimmer body doesn’t even feel like Mike. I hate showing skin because of the marks from my depression \n\n\nBut when I’m with you, I feel most beautiful being naked. I love being skin to skin. I don’t feel vulnerable or embarrassed when I show skin when we are lying in your bed, I feel the most confident and accepting of myself. \nThank you for being there for me and loving me at every stage of my body changing. You love me unconditionally. ", "subreddit": "BodyAcceptance"}
{"post_id": "b4k6ay", "created_utc": 1553353806, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "b4klnl", "created_utc": 1553356111, "title": "I’m as curvy as any other new model but my problem is I don’t have a flat stomach like them.", "author": "AwkwardOkaySeduction", "self_text": "Don’t get me wrong I love these new models that are looking more like me. I used to see movies as a kid use “you have a big butt” as an insult. Now my body type is being showcased but even when the models refuse touch up they have these nice flat stomachs. My wedding is in 10 weeks and I’m just trying to accept my muffin top. ", "subreddit": "BodyAcceptance"}
{"post_id": "b4p6jt", "created_utc": 1553380740, "title": "Dad staged an intervention", "author": "EbieeGreen", "self_text": "I’m 17F, 5’0” and 103lbs.My dad and his girlfriend staged an intervention because they think I’m making myself throw up. I’m not and I never have. I haven’t had body image issues since I was 13 (I was extremely muscular and insecure about it) I didn’t think I was too skinny until they did this and now I can’t stop thinking about all the stuff that I could change about my body.  I’m still an A cup and I had even been okay with that until now. I don’t know what to do. ", "subreddit": "BodyImage"}
{"post_id": "b51sp1", "created_utc": 1553462797, "title": "Belly stretchmarks", "author": "furbyenne", "self_text": "Hi,\n\nSo I have always been a bit chubby and struggled with it when I was younger. Since 9 months I'm in my first relationship (very happy!), but I have gained some weight. That is not the problem I want to mention here. I got some stretchmarks on my belly. The ones I got on my hips don't bother me at all, they are white and you can only see them when you're near. I somehow like them. But the ones on my belly are pretty fresh and totally red. I think I got like 12 or 13 there.\n\nI am now thinking about summer and scared of wearing a bikini. I just want them to become white. They're also not as thin as the ones on my butt and hips.\n\nI totally struggle with liking them, any ideas? ", "subreddit": "BodyAcceptance"}
{"post_id": "b52f6t", "created_utc": 1553466138, "title": "Care for Clothes don't get talked about when you're plus sized.", "author": "Michigan_made", "self_text": "My wife is plus size. She does most of her shopping at places like torrid, Lane Bryant, and numerous retailers online for plus sized women. It's great that these places exist because everyone should have clothes that fit them, not you fitting into a size (if that makes sense). I do most of the laundry and it's a little annoying that I can't wash or dry clothes from those places without them getting ruined. I love the whole body acceptance/positivity movement but no one talks about how to keep the clothes that you bought from the store that doesn't shame your body, from shrinking or pilling from normal wash and dry cycles. Sorry for the rant, is there any tips on how to care for torrid (and similar) clothes?? ", "subreddit": "BodyAcceptance"}
{"post_id": "b5bxvp", "created_utc": 1553527128, "title": "metaMonday: No Stupid Questions", "author": "maybesaydie", "self_text": "Have questions about calories, weight loss, exercise or anything having to do with weight? Ask them here and the community will do its best to give you an answer. No medical advice and no rants, please.", "subreddit": "fatlogic"}
{"post_id": "b5cklb", "created_utc": 1553530183, "title": "Struggling with body image issues.", "author": "prettyrainbow1807", "self_text": "I'm a 17-year-old guy, and unfortunately I feel pressured to follow the ideal body type. There were times when I really liked my body, and I believe it is all about perspective. Within a year, I have gained approximately 9 kilograms (which is not necessarily a bad thing) and I noticed that I developed some fat around my belly alongside with love handles.\n\n I used to get undressed in front of my mirror, but I feel like I can no longer do that because each time I see my naked body I feel some sort of repulsion. This led to me hiding from, and avoiding mirrors at all costs. It also makes me feel unworthy of love, but that's probably because I do not love myself. I find it hard to accept myself, and struggling with this is a constant fight. ", "subreddit": "BodyAcceptance"}
{"post_id": "b5khm6", "created_utc": 1553569465, "title": "I feel short at 5’11.25", "author": "FredodaFred", "self_text": "I dont know why ive never felt short until recently. I keep feeling so short and i dont know what to do. I just turned 18 and i wish i would grow another couple inches. The thought of being short just keeps bothering me even though i know im not too short.", "subreddit": "BodyAcceptance"}
{"post_id": "b5qk5e", "created_utc": 1553611509, "title": "My daughter has a small head due to a birth injury", "author": "Momo_le_chat", "self_text": "Please be kind because I don't like having these feelings and I judge myself for it.\n\nMy daughter had an injury to her brain due to a lack of oxygen at birth. As a result her brain is smaller and her head grew smaller too. She also has mild cerebral palsy (cp) and epilepsy but is cognitively very bright and on par with her peers. She is 4 years old now.\n\nI am very sad over her head size. It may be strange but I'm even more upset over it than the cp because it can't be improved, I can't do anything about it. I am so sad that she was supposed to have a full head but due to what happened she has a smaller head that doesn't look like a 4 year olds. I worry about how she will look when she's an adult. Heads don't grow a lot past 4 years old, it grows mainly in the first years of life. I worry that she will look \"weird\". I don't want that for her. \n\nI know I should be the one accepting her and finding her pretty no matter what but deep down I can't help being sad over this. I am in therapy but it doesn't seem to help with this specific issue. I don't know what to do to make peace with that. I also feel guilt related to her birth which doesn't help.\n\nOf course I would never say anything to her about that, I keep it to myself. But sometimes it makes me depressed and I would like to be more at peace to be a better mom to her. Any advice is welcome.", "subreddit": "BodyAcceptance"}
{"post_id": "b5qv65", "created_utc": 1553613076, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b5qvsn", "created_utc": 1553613169, "title": "Dysfunctional breathing linked to sucking in", "author": "helensis_", "self_text": "Hello!\n\nThis is my first post here.\n\nI was just wondering if anyone has had any experience with this. I went to my doctors recently to discuss possible asthma - I cannot seem to fill my lungs up with air fully and have had this on and off for a few years.\n\nThe doctor mentioned dysfunctional breathing and reading about it seems to add up. \n\n&gt;Dysfunctional breathing (DB) This can occur with physical exertion, strong smells, cold weather, stress or other triggers. People who have DB tend to breathe rapidly through the mouth, hold tension in their shoulders and breathe using the upper chest. This can cause symptoms of hyperventilation. You may notice chest and throat tightness, chest pain around the breast bone and breathlessness.\n\nI breathe primarily into my chest and my shoulders and neck are super tight. \n\n**My question is has anyone ever had this before, and do you think it's linked to prolonged periods of time spent holding our stomachs in to 'look slimmer'?**\n\nI know I do this all day, and have to consciously think not to do it, and it makes me breathe with my chest/shoulders.", "subreddit": "BodyAcceptance"}
{"post_id": "b5rryi", "created_utc": 1553617443, "title": "Everyone on this planet is beautiful, except from me.", "author": "universallyglo", "self_text": "I give all this love to everyone else. I see something in them thats beautiful and wonderful. Why can’t I feel that about myself? When I think about myself, I can’t love who I am. I don’t see someone who’s beautiful and amazing. For some reason I think I’m just so below everyone else. I feel like I’m an exception. I hold everyone on this pedestal, and it just seems evident to me that I will never be on that pedestal. Everyone makes the cut apart from me. I know it makes no sense. I am not special. I can’t be so different that I’ve evolved my own category, separate from the other 7 billion people on this planet. But in my head, I am different. The rules don’t apply to me. I am not beautiful. My looks, my personality aren’t beautiful. I am undeserving. Undesirable. So undesirable, that even *my own self* doesn’t like me.\nI just can’t view myself in the same light that I view everyone else in. And I wish I could, because the feelings and opinions I hold for other people are amazing things to feel. It makes *me* feel good to feel these things for others. Almost as if there’s this brightness, floating around my body. As if seeing their spark, has ignited something in me. I could only imagine that holding those same feelings about myself would be out of this world. But it’s just not possible. I am a defect and I can’t seem to think otherwise.", "subreddit": "BodyAcceptance"}
{"post_id": "b5x1dd", "created_utc": 1553643315, "title": "Feeling extremely down because of my acne scarring", "author": "caprinatural", "self_text": "Hi guys,\n\nI don't know if my post is appropiate here, so if it isn't, I'll take it down. \n\nI've been suffering from a lot of acne related to the stress in my life. I've fled my abusive family 7 months ago and I've cut contact with them ever since. It's been very stressful and I'm burried in debt now. That has made me very depressed, and stressed out on top of having depression already and other mental health problems. I've migrated to another country,  I have 0 friends here and that has just worsened my loneliness and stress. That gave my a lot of acne, so my coping mechanism was picking them. Because of that, I have a lot of scarring on my face and has made me even more depressed. I look even more awful than usually rn and I don't have the money to fix my skin. I already avoid mirrors at all costs just to avoid seeing my ugly face and body, but the scarring made it ten times worse. I don't even wanna leave the house anymore. I'm in shambles. \n\n\nAgain, I'm very sorry if this post isn't appropiate. I was trying to get this off my chest as my SO is basically sick of me being depressed, so I can't say this to anyone else 😢. ", "subreddit": "BodyAcceptance"}
{"post_id": "b65j05", "created_utc": 1553699525, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "b67ozb", "created_utc": 1553710787, "title": "Broke down when i saw my body in the mirror", "author": "AbbyMci", "self_text": "Having kind of a rough day to say the least. I don't really have anybody I can talk to about this so I'm here. For background info I've struggled with an eating disorder for a while, and have always lacked confidence. I'm waiting to get into a treatment program but I don't know when that will start. Today started off like it usually does. I struggle for 10 minutes to take a selfie of my that I don't think is ugly to send to my boyfriend to say good morning. Then I had a shower, and started this habit I've formed of looking obsessively in the mirror at my body. I do this several times a day and when I was evaluated for the program they called this \"body checking\". As I was doing this I just saw myself getting bigger and bigger. It was like as I looked up and down at every inch of my body it changed and looked worse. I started crying. It didn't look like me. My head is so wrapped up in what I'm supposed to look like and I don't really know how to stop those thoughts. I don't have any friends, and my boyfriend doesn't really understand this. So I just felt so lonely. I don't know if this is the right thread to post this in but I just need advice.", "subreddit": "BodyAcceptance"}
{"post_id": "b69is8", "created_utc": 1553719630, "title": "Low self worth day", "author": "wizardpeanut", "self_text": "What do you do on hard days? When you just cant stop hating on yourself? ", "subreddit": "BodyAcceptance"}
{"post_id": "b6acft", "created_utc": 1553723510, "title": "How do you accept your body, knowing you cant change the things you hate?", "author": "blemishedcucumber", "self_text": "I'm struggling really bad with body image this week and I cant stop crying at the sight of myself. There's a few things I'd love to change, but I know I'll never be able to afford it. How can I just accept the fact my body is the way it is and not compare myself to every girl I wish in looked like. I know no one can tell me how to do this stuff, but advice or help is appreciated. ", "subreddit": "BodyAcceptance"}
{"post_id": "b6bmcz", "created_utc": 1553730185, "title": "Thought i was having gender dysphoria, but its actually anxiety caused by expectations of what a woman's body should be.", "author": "illbeyrbird", "self_text": "I thought i might identify as non-binary as I hate being in a woman's body so much. I looked a little deeper and if the world wasn't constantly staring at my large breasts or making side comments about my size I wouldn't be so uncomfortable walking through a room. I've wanted to get my breasts removed so badly my whole life because I hate the kind of attention they draw. It's not that i don't identify as a woman, it's that I don't feel safe in my body.", "subreddit": "BodyAcceptance"}
{"post_id": "b6jyt4", "created_utc": 1553785878, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "b6lma9", "created_utc": 1553793825, "title": "Virgie Tovar makes her final public statement about Shrill", "author": "bad2thebean", "self_text": "Mods, please delete if you determine this breaks the rules, because this isn't really fatlogic so much as it's Virgie logic about how she is the ultimate victim.  \n\n\n[http://archive.fo/9GkxW](http://archive.fo/9GkxW)  \n\n\nTL;DR she is the victim of bullying as a result of this Shrill drama, and she had to go to the emergency room from the stress of it all. ", "subreddit": "fatlogic"}
{"post_id": "b6nv1u", "created_utc": 1553804862, "title": "I hate the way visibly aging women are treated", "author": "ClearBlue_Grace", "self_text": "This is not about me (yet). As a young woman, I see an overwhelming hatred of the natural aging process. It happens to everyone, and if you’re fortunate enough to live a long life, it is inevitable. \n\nI love skincare, simply because I think it’s a nice form of self care, but see a lot of young woman, even girls as young as 13-14 panicking about aging, and it’s ridiculous how much women are told that looking 18 when you’re actually 40 is important. Women with fine lines/wrinkles can still be beautiful; women who no longer have a “baby face” can still be cute and feminine. \n\nWhen I’m old, I’m going to be saggy and sophisticated and there’s nothing anyone is going to say to make me feel bad about it. If you believe all women are beautiful in their own way, comparing women and saying “can you believe they’re the same age??? ___ looks so much younger and better than ___!!!” is actually very hurtful and unproductive. I’m guilty of thinking this way in the past and I’ve recently realized how unimportant and insignificant it all really is. ", "subreddit": "BodyAcceptance"}
{"post_id": "b6yhjg", "created_utc": 1553872403, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "b76coa", "created_utc": 1553914927, "title": "Beating my Eating Disorder with Humor", "author": "clarelandis", "self_text": "I’m in rehab for the third time. Yes, three times in three years. This might go without saying, but, I wouldn’t recommend it. Eating disorder rehab is not nearly as fun as it sounds, and, yes, I know it sounds like a damn party. I managed to land myself in this last treatment center after a phase of a bulimia-esque eating disorder and then a brief, but severe flair of my old pal anorexia. Let me tell you, some crazy shit goes down at these places.\n\nThe first time I went to treatment, it felt a bit like I would imagine going to jail would feel. You’re searched, censored, locked in, and stripped. Well, the stripping was a me thing. It was an accident too. The nurse doing my intake assessment showed me behind a curtain and told me to take my clothes off for the examination. Shaking and pale from the nerves, I thought she said something, but I didn’t process it. Uncomfortably, I undressed, slid my clothes and shoes out from the little stall, or rather, circle on the floor encircled by a yellow curtain that was clearly meant to be cheery but just looked gross, so they could be searched, and stepped out for my exam buck-ass nude. The nurse looked confused to see me with one arm over my boobs and the other hand cupped in front of my lady parts. I think I blocked out what happened after that out of sheer embarrassment. She said something nice, and I turned around to see that she had in fact handed me a gown. In my defense, the gown was essentially transparent, so I would’ve been basically naked anyway. Great start.\n\nTreatment is a microcosm of the real world. Except it’s way worse and filled with craziness. I mean crazy in the most endearing way, at least for most people. There was the one girl I went to treatment with who stood over her roomate while she slept and watched her. Or the other one who wrote in her journal that she wanted to kill all of the other people in the building; I was pretty scared of her already, and after finding out she wanted my scalp, I steered clear of her. When we did interact, I was always super nice. I’m always super nice when I think someone wants to kill me, which actually happens a lot because I’m neurotic and paranoid like that. Especially in high school, I went out of my way to be nice to the scary kids because I didn’t want to end up dead, well, junior and senior year I didn’t want to be dead. My high school experience needs its own blog, so I won’t get into it now.\n\nBut in all seriousness, I’ve met some of the best humans in treatment. Not that I would recommend going so that you can make friends, just FYI. I think it has to do with the fact that we share everything with one another and all have this common understanding because our minds are fucked-up in similar ways. There’s something so comforting about meeting someone who is just as fucked-up as you are. Suddenly, this stranger makes your isolated existence not so lonely any more. I was shocked to find out there were people just like me because I was sixteen the first time I went to treatment, and for sixteen years prior, I didn’t think it was possible for anyone else to understand me. I thought I was this one lonely alien-like being. I met my best friend in the whole world when I went to treatment the first time, and, unlike yours truly, she’s killing this recovery thing. She lives in Pennsylvania, and although we don’t talk all that much, we’re incredibly close. When you go through something as terrifying as your first round of treatment with someone, there’s an instant connection and it’s so strong.\n\nIt’s been a journey over the last six years with my eating disorder, but it hasn’t lacked moments of humor. For those of you who are blessed enough not to know anything about treatment, there are these things called flush checks which are the disgusting and dehumanizing moments when a staff member has to look in the toilet before you flush it to make sure you’re not vomiting. One of my friends took a baggie full of soil from a potted plant and dumped it into the toilet before her flush check. She then complained about her stomach hurting and said she didn’t know what was going on. The staff member was terribly confused and concerned. Eventually, he got to the bottom of it and the plants were removed from the facility for the rest of her stay. Plants definitely get the short end of the stick in these places. No one cares about the damn plants. There was a plant in the corner of the café here, but it’s gone now because one of my friends decided to water it with her boost. Boost is this stuff that is exclusively consumed by eating disorder patients and really old people and is essentially liquid food replacement, definitely not plant food. It actually tastes pretty good, but it kills your stomach. The famous boost bomb is a real phenomenon.\n\nSo, I’m at my third treatment center and really should’ve gotten the hang of recovery by now, but whatever. I’ll get it when I get it or I won’t get it ever, not sure which one yet. This is my last stay in treatment because I’m so ready to go on and have a life. I'm so ready that I even started a blog about it (This Crazy Beautiful Life) I don't know if it will go anywhere or not, but my therapist told me I needed a damn hobby that wasn't self destructive, so I'm trying Reddit too. \n\n&amp;#x200B;\n\n&amp;#x200B;", "subreddit": "BodyAcceptance"}
{"post_id": "b7cbhz", "created_utc": 1553958687, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "b7ey69", "created_utc": 1553973858, "title": "I'm Playing a Disney Princess Next Weekend and I'm So Nervous", "author": "sadthespian", "self_text": "I've struggled with body image my whole life. I've never been skinny - always curvy, but I was bullied relentlessly up until high school (I'm 26 now). Despite that, I've been involved with theatre and performing since I was 10. \n\nThe last few years I got to my highest weight though so I haven't felt good about myself in a long time. But I just got an offer to play a Disney Princess at a birthday party (with a very generous stipend for only an hour) and I'm excited, but I'm really nervous about the costume looking right/looking like the character. I'm either going to be playing Belle or Aurora. I've played Belle twice in community theatre, but I was smaller then. My biggest fear right now is not fitting into the costumes at all. I'm trying them on tomorrow night. I have a body suit that brings me down at least a size, but I have larger breasts so dresses are tricky. For the record I'm about a size 12 right now. I have a MiracleSuit that gets me down to a standard large dress size, but I'm still worried about being mortified if neither costume fits and I lose the gig. ", "subreddit": "BodyImage"}
{"post_id": "b7ikfr", "created_utc": 1553996455, "title": "I'm done shaving", "author": "SomebodyGetMeATaco", "self_text": "I went on a 10-day field trip and made a lot of friends and it really boosted my confidence. I stopped shaving after the second day because I knew I'd be wearing layers and it didn't matter. I'm home now and my armpits are hairier than they've ever been since I was thirteen. But you know what? I don't give a shit. I'm happier with my life than I've ever been and my armpit hair makes me feel badass as fuck. I'm FINALLY getting over my bitchass eating disorder and putting on some muscle. I'm volunteering and fundraising and spending time with new friends. I'm more than my body hair and if anybody fails to understand that then they aren't worth my time. ", "subreddit": "BodyAcceptance"}
{"post_id": "b7k8ma", "created_utc": 1554009170, "title": "Learning to Fully Accept My Ever-Changing Body", "author": "fitgeek69", "self_text": "Although I had an eating disorder for 5 years, I have never experienced body dysmorphia the way I do now 2 years post recovery. To preface, my ED had nothing to do with the way I looked, I used food to punish and control myself. How I physically looked was never a part of my eating disorder for me.\n\n&amp;#x200B;\n\nYet now, I am relieved and proud to finally say that I feel fully recovered. However, I have never felt so disconnected from my body. I eat healthy and I exercise regularly. I have plenty of acne scars all across my body but I have relatively few active breakouts. \n\n&amp;#x200B;\n\nI have a body that is socially accepted. I used to be extremely skinny as a child and pre-pubescent teenager, and I had an enormous appetite. My appetite was never the same after my ED and same with metabolism. I thought I was skinny, but recently since working out the past 2 months, I went back home after my college spring break and all my family complimented me on toning up but sensing this myself, I asked them if they felt I was skinny, to which they replied they don't consider me skinny anymore. I asked because I don't consider myself skinny anymore. If I'm being honest, at this moment in time I long to be skinny, but more than anything I long for the indifference and lack of awareness I had with my body prior to ever working out consistently this year.\n\n&amp;#x200B;\n\nIt's so strange. I went from a size medium to size x-small in tops and feel like I look heavier. I always have fitness goals of wanting to look/have a very specific body type but when I make progress to achieve it, I hate how I look and feel. My clothes don't fit the same and I just don't recognize myself in the mirror.\n\n&amp;#x200B;\n\nI never judge others' appearance the way I critically pick apart mine. Partly because of how I was raised, beauty was everything to my family and according to them I never had it. I was bullied for being ugly in school. Now that I'm older and in college, it's so strange being cat-called by older men and asked on dates by my peers because they think I'm \"pretty\". I don't value beauty, if someone likes the way I look (which if I'm being quite honest I don't like the way I look) I did not do anything to earn my \"beauty\". I was simply born with certain traits others find desirable. This is why I do not compliment others appearances, at least not so casually.\n\n&amp;#x200B;\n\nSo this is how I am coming to terms with my ever-changing body as I continue to workout, tone up, get skinner in some areas and thicker in others, or maybe change in ways I do not expect:\n\nI look at myself in the mirror and do not tell myself I am beautiful. That comment does nothing for me. I look in the mirror and tell myself that this is the body of someone who has recovered from a 5 year eating disorder. Who for the past 2 years has tried so hard to aggressively love themself. I tell myself this is the body of someone who is healing, because my whole life my body has only had 1 job that it has consistently done for me: heal me. I admire the strength and years of recovery from mental illness and physical health obstacles it took me to get to this point.\n\n&amp;#x200B;\n\nAnd after affirming myself, it doesn't matter what my measurements are. The imperfections on my skin still yet to fade or the cosmetic procedures I have yet to get done. I just admire who I am as a person without the vanity attached. I don't see anything wrong with being vain, that's just not the approach I am taking to learning to accept myself. I hope by sharing this that others can relate or affirm themselves in a way that I do and genuinely feel good about themselves afterwards! Please reply with your own personal process of how YOU are learning to accept your body. I would love to hear tips because I still get sad about my body on a daily basis but that's okay.", "subreddit": "BodyAcceptance"}
{"post_id": "b7kcf8", "created_utc": 1554010045, "title": "Body acceptance is for YOU too", "author": "sylviatheslut", "self_text": "Body acceptance / body positivity is a journey and it looks different for everyone. I grew up hating my body and just being an absolute savage to it in my head. My journey went in stages the shame started with shaming myself and then shaming other people in my head as well. As I grew older I became more and more aware and accepting of others but was still so shameful and mean to myself. I would be like I’m so happy that I’m seeing more fat people love and accept their bodies but me no I’m gonna drop the weight my journey looks different. Great for them but me I’m trash I don’t deserve to be told I look good right now and just got caught in a constant binge/starvation cycle for years. Recently through reading some literature and diving into this and paying attention to the media that’s twisting this around and making us feel shameful for our bodies with these unrealistic standards and realizing how deep that affects us. The journey looks differently for everyone but just know it’s for you too. You’re allowed to accept your body and offer it some kindness and allowance, you’re allowed to stop the cycle. Acceptance is for you too no matter how much worse you think you have it I promise you that right now today body acceptance is for you too. ", "subreddit": "BodyAcceptance"}
{"post_id": "b7lwrh", "created_utc": 1554024298, "title": "Do you think i have a little girl’s body?", "author": "bearhugs777", "self_text": " My friend told me only pedophiles may find me attractive because i have a kid body. Hate to admit it hurt my feelings... do you think i look like that? Im 32 http://i66.tinypic.com/2r6gxnp.jpg", "subreddit": "BodyImage"}
{"post_id": "b7n6ay", "created_utc": 1554034798, "title": "Removing hairs", "author": "Eliuus", "self_text": "Hey! I'd like to share something. The thing is I'm ok with my body (I'm quite slim and short but I'm totally ok with it), but the only thing that I hate about myself is my hairs! I'm super hairy (I'm a man), especially below the belt and that bothers me a lot.\n\nI'd like to remove my hairs (because shaving them will only do worse) but laser hair removal is too expensive and I can't afford it. Do you know other ways of removing hairs?\n\nThanks a lot! ", "subreddit": "BodyAcceptance"}
