{"post_id": "dbmmyn", "created_utc": 1569896938, "title": "Body Mantra", "author": "JulieAMao", "self_text": "I've been thinking about sharing my body mantra here, and now I feel more encouraged to do it after doing [this self-love challenge](https://www.reddit.com/r/BodyAcceptance/comments/dbgxxo/say_something_nice_about_yourself_challenge/?utm_source=share&amp;utm_medium=web2x). We pitch in ideas here to help one another accept ourselves, right? I suffer with body image issue and self-loathing on waves. They come and go. This time around, I got the idea of writing a mantra to fight back the toxic ideas about my body planted in my brain. I memorized it and say it lovingly to myself whenever I remember, often before or after doing a yoga or an exercise. \n\n&amp;#x200B;\n\nHere is my body mantra. (what I do as I speak)\n\n    (wiping legs) Thanks for taking me to places\n    (wiping arms) connecting with people and animals\n    (rubbing belly) breathing in the world one at a time\n    (covering chest) facing it with an open heart\n    (caressing cheeks) and expressing what’s on my mind\n    You are beautiful (giving a hug) and I love you\n    You deserve respect and pleasure\n    May you be free of pain and be full of joy, love, and light\n\nIf you like it, feel free to use it yourself. You can change however you want or compose your own. I recommend adding the motions and touching parts of your bodies, especially the parts that need more love. It will work wonders. Sending love.", "subreddit": "BodyAcceptance"}
{"post_id": "dbur9y", "created_utc": 1569942635, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dc22j5", "created_utc": 1569973605, "title": "Riding the struggle bus lately", "author": "RachelTheObserver", "self_text": "Last October my mother in law was killed by extremely negligent doctors. To say my husband has been traumatized by this is an understatement. He was already struggling with severe depression and occasionally suicidal thoughts. Losing his mom just absolutely squashed any part of him that could still look forward with hope. I've strived to be everything he could need (his mother was his only family, he has few friends that are very close). He had to quit working so I'm supporting us on a not great teacher's salary. On paper, everything is fine. Our lawyers have a very air tight case to file against the hospital, my job can keep bills paid and all that. But emotionally I am drowning. I feel like I haven't had my husband here for a year. I'm lonely. \n\nAll this to say, I've been emotionally eating like a mother fucker. I've gained a not insignificant amount of weight in the last year, enough that I can feel its effect (being almost 35 and depressed also doesnt help.) My back hurts and I'm exhausted after work. My clothes are on the edge of not fitting well anymore. I'm finding it hard to muster up energy to do things I enjoy, much less go workout after work (my days at school often start at 6:30 so it's not feasible for me to exercise before school. I cant wake up at 4am. I'm not that person). \n\nI want to feel better but I dont want to get in the mindset of being hateful towards myself and my body. I'm thinking about joining the Y and doing some low impact pool classes. Over the summer I was working out a bit by dancing, but would get frustrated when i couldn't physically keep up, and would need to take many breaks. Logically i know being mad and hateful to myself about this will only hurt me. But my emotional response remains the same, hateful self talk that my mother instilled me as a child.  \n\nI'm just feeling lost, overwhelmed, tired. I needed to vent. I think I probably need to be back in therapy.", "subreddit": "BodyAcceptance"}
{"post_id": "dcbhh5", "created_utc": 1570028869, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "dcinm1", "created_utc": 1570059555, "title": "I hate my face", "author": "coffeemuffins", "self_text": "I've put on about 10 pounds.  My face is rounder. I hate seeing it in pictures.  I constantly look at old pictures my old face. I dont know what to do to feel better.", "subreddit": "BodyAcceptance"}
{"post_id": "dcmxii", "created_utc": 1570083422, "title": "Struggling to move on from the past", "author": "[deleted]", "self_text": "I know how ridiculous this may sound, so please bear with me for a bit. My issue has been that to this day, I still have trouble getting over instances in the past that have made me feel really terribly about my own body.\n\n2 years ago, I found out that my boyfriend was tuned on by one of his female friends and found her \"super hot\". I was already really upset with this friend because she didn't really get the idea of boundaries. I also felt that she was prettier than me, smarter than me, had a better personality, etc. Overall I just had low self-esteem. But most importantly at the time, she was much thinner than me. I'm relatively healthy but I've been brought up being told that I'm too big (especially by \"Asian standards\" due to my ethnic background). My confidence has been going up steadily over the past few years, but it's crashed in the past few days because my boyfriend and this girl recently started talking again. I know that there is nothing going on between them and our relationship is wonderful, but I can't stop seeing myself as this chubby, flatchested and weirdly built person all over again. I guess for me, how the body looks has been extremely important my whole life, and I really want my boyfriend to love me for the way I look (as well as for other things, of course), but I don't really feel that way sometimes.\n\nI know this is in my head. I'm relatively healthy and my weight is fine. I try my best to go to the gym and I'm proud when make time for it, but it's been so difficult lately. I'm generally an anxious person who overthinks a lot and unfortunately I'm having a hard time accessing mental health resources right now.\n\nDoes anyone have any thoughts or advice? I'd really really appreciate it. Thanks so much.", "subreddit": "BodyAcceptance"}
{"post_id": "dcoijl", "created_utc": 1570095167, "title": "“You cannot hate your body into a shape you will love.”", "author": "fuckupsomesmahtkids", "self_text": "I saw this on twitter and wanted to share with y’all. :)", "subreddit": "BodyAcceptance"}
{"post_id": "dcs6d5", "created_utc": 1570115244, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "dd1fk1", "created_utc": 1570157337, "title": "The Dress Doesn’t Look the Same", "author": "mrs-sweetiepie", "self_text": "My homecoming dance is next weekend. I couldn’t decide if I wanted to go or not. Part of my friend groups wants to go. I didn’t feel like spending money on a new dress, so I told myself that if the one from sophomore year fit, I would go. It fits, but it doesn’t look the same. It’s tighter around my arms and butt. I don’t like it. I took it off right away and buried it in the back of my closet. I hated what I saw in the mirror. The pictures from sophomore dance are pretty much the only pictures I have ever liked of myself. I feel fat and ugly. I like a guy who is so popular and pretty with straight teeth and nice skin. And I look like a mess compared to him and all his friends. He is the kind of guy who would go for skinny girls who always wear dresses and don’t constantly have paint dried on their hands or clothes. I don’t want to go to homecoming now that I can’t even fit right in my old dress. It just proves how much I’ve glowed down during high school. My confidence is down the drain. My dress is hidden in my closet. And my heart is not doing too well emotionally.", "subreddit": "BodyAcceptance"}
{"post_id": "dd8ne8", "created_utc": 1570201789, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ddiyjy", "created_utc": 1570252544, "title": "Too skinny", "author": "littlecherrybomb", "self_text": "I hate how skinny I am. I hate it so so much. idk what I’m doing. I guess I’m just ranting. I just feel like shit looking in the mirror with how skinny I am and seeing my A-cup boobs. I just wanna feel sexy 😞", "subreddit": "BodyAcceptance"}
{"post_id": "ddodu9", "created_utc": 1570287984, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "ddor34", "created_utc": 1570289750, "title": "How to be a soft girl when tall", "author": "postpostpostpost_inf", "self_text": "Every tall girl positivity seems to be \"omg amazon warrior goddess such a strong wander waman model rock your height\". I don't like that strength is expected of me given my body size. In the lesbian community, I am expected to top and be dominant in sex and treat normal-height girls as \"my pocket girlfriend\". No matter what body type I have there is always a stereotype. If I am conventionally attractive I am a \"fat booty thicc femdom massive girl\", if not then I am \"prude virgin who needs to hit the gym and eat more\".", "subreddit": "BodyAcceptance"}
{"post_id": "ddur9b", "created_utc": 1570316148, "title": "Question for an artist: tattoos on a fat body?", "author": "meganatious", "self_text": "Tl;dr: I’m worried that my fabulous tattoo artist might be ashamed of having their art on a fat body.\n\nI  have a fat body, I know that. It’s a fact. I’m learning to love me for me, fatness be damned. I have a couple tattoos already, one on the inside of both forearms and one on my ankle, probably the places with the least amount of fat. Next week I’m going to get a new piece done by an incredible artist who I adore. It’s a bigger piece and I’ve been wanting it on the outside of my thigh, arguably one of the fattest places on my body. \n\nThis artist has worked with me before, one of my forearm pieces is his. But I have a new fear of him regretting spending time and effort on a piece that will be seen in all its glory on a fat woman’s thigh. I guess I’m just looking for some piece of mind from other tattoo artists out there who have worked on fat bodies before. I’m so excited for this new piece but I’m rethinking placement.", "subreddit": "BodyAcceptance"}
{"post_id": "ddyyfu", "created_utc": 1570338706, "title": "A moment where I should've spoken up", "author": "[deleted]", "self_text": "The other day my aunt (aunt 1) was expressing how she keeps unintentionally gaining weight because of her medication to my other aunt (aunt 2 - who is very conventionally thin). Aunt 1 was like \"teach me how I can be skinny like you\". And internally I wanted to say \"it's okay to be fat. There's nothing wrong in that. I understand that you don't like being this size because it's not something you're able to control right now. It's the side effect of a necessary medication. But it is also okay to be just as you are. Even if your body is changing. As long as you feel healthy and you're taking care of yourself, it doesn't matter what size you are\". But instead, I said nothing because I was worried about how Aunt 2 (the thin one) would react and that she might debate with me. So I didn't say anything and aunt 2 replied \"stop eating carbs\" Lmao! I know aunt 1 just needs validation and acceptance but instead she's being met with \"stop eating bread and rice\". I'm just sad about how deeply women in my family feel that being fat is so undesirable.", "subreddit": "BodyAcceptance"}
{"post_id": "de0hle", "created_utc": 1570350079, "title": "Wearing a t-shirt without a bra at home?", "author": "tinyfreckle", "self_text": "So it's getting a bit hotter where I live and I've been wearing t-shirts with no bra for bed (and pj pants as well). But whenever I do my mum makes a big song and dance and tells me to put a second top on over it or a jumper or something to cover up the fact that I have boobs/nipples because apparently it will make my father and brother uncomfortable. Is that true? I'm 19 by the way and my brother is 17. I don't have huge boobs and my shirts completely covers them it's just that I'm not wearing a bra under them. \n\nTBH this has made me quite self conscious about my body and made me consider just staying in my room at night instead of watching TV with my family.", "subreddit": "BodyAcceptance"}
{"post_id": "dee5wr", "created_utc": 1570420025, "title": "I don’t know what I am doing here", "author": "Tux_n_Steph", "self_text": "I am maybe 3 weeks into this reddit group and I’m rapidly  disillusioned by all the active body hate I am witnessing in this group. It’s jarring to see so many people fixating on in their bodies in such unhealthy ways. I want to scream “it’s just a body we are all SO VERY lucky to have them!!” Don’t we all know we are lucky to have them?? I thought this would be a nurturing safe space of body neutrality or acceptance but it’s very triggering to see all this self hate. I know how hard it is to struggle to feel ok in a world that tells everyday you are inadequate and that you must buy something to make you better, more desirable, more comfortable  (gym membership, clothing, makeup etc) but this is fucking lie. Don’t we all know this is a lie? I thought this was a place for people who know this is a lie... I know the goal of feeling great everyday is a high ass bar but this should be the place to celebrate triumphant moments of body acceptance, right? Or am I in the wrong group?", "subreddit": "BodyAcceptance"}
{"post_id": "degms8", "created_utc": 1570437193, "title": "It was my 20th birthday yesterday and I want to make peace with my body now", "author": "downvoticator", "self_text": "I used to always hear that your 20s would be the time your “body looks its best” and i would panic because if this is the best then why is it not good enough for me? And I realized yesterday while I was eating with my friends that I will never have a body that is free of flaws but I can always have a body that is good enough for me like whenever I want to. My legs carried me across London and the museum and hills and rivers this week. My shoulders and back and arms held my bag full of books and gifts and notes from friends. My face was good enough for smiling and making babies laugh with silly faces and for looking to see all the beautiful things I’ve seen. I wanna start being more grateful to my body. I don’t wanna spend my 20s the same way I spent my teenage years. It makes me very nervous to be okay with it but that’s okay.", "subreddit": "BodyAcceptance"}
{"post_id": "dev2g2", "created_utc": 1570508637, "title": "Body Proportions", "author": "GTLMonty99", "self_text": "My body is so out of proportion and there’s nothing I can do about it because it’s bone. I don’t look like a regular human being. My heads huge, torso is big, but arms are small. I have a big butt and legs, but small feet. My body is so weird. You must understand that it is hard to accept this thing", "subreddit": "BodyAcceptance"}
{"post_id": "df18kv", "created_utc": 1570547199, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "df5ji7", "created_utc": 1570565778, "title": "Learning to like tagged photos &lt;3", "author": "Shuiner", "self_text": "My dad recently visited my husband and I for the first time since we were married. He took a picture of us and posted it to Facebook. It was from a bad angel and generally unflattering (as are most of his pictures lol). I immediately wanted to hide it from my timeline. \n\nBut instead I went away from Facebook and thought for a while about how great it was to see my dad, how proud he is of me, and how much love was in that picture. Did it really matter if the picture wasn't flattering? \n\nIt's still me at a happy moment, and that deserves to be commemorated!! Instead of being embarrassed, I should treasure the memory. My life was so full of love at that moment, so why was I worrying about a double chin?!\n\nSo I took another look and now I kinda love it :)", "subreddit": "BodyAcceptance"}
{"post_id": "df96sd", "created_utc": 1570581113, "title": "I liked being me until I entered high school", "author": "torquatoo", "self_text": "I was fat from a young age, but I never had so much trouble with it, I even joked about it, but after I started high school everything changed, I really didn't care at first, but over time, More and more people cursed and mocked me, I started not to accept myself, and today I am very sensitive about the subject. Relatives, colleagues and even friends began to stress my shape as I got older, and now I feel so sad, it seems that being fat sums up my whole being. (sorry for the google translator english)", "subreddit": "BodyAcceptance"}
{"post_id": "dfcbxl", "created_utc": 1570597636, "title": "How do you gain sexual confidence", "author": "hdicidkekckke", "self_text": "I used to be a big girl... I lost 50 lbs from not eating but I wouldn't really call myself anorexic. I'm still a little chubby and I've had a bf for 3 fucking years and I want him to be able to actually look at my lady parts but I'm too self conscious. He thinks I'm hot he says but I just cannot fucking bring myself to so anything besides missionary... I need help... how tf do girls bigger than me have no problem", "subreddit": "BodyImage"}
{"post_id": "dficoi", "created_utc": 1570633664, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "dfjm5n", "created_utc": 1570639034, "title": "How to be confident when you struggle with anxiety.", "author": "Christiangirl98", "self_text": "I struggle a lot with my anxiety when it comes to my looks, I don’t feel like I am beautiful enough sometimes and it gets the better of me. Any advice ?", "subreddit": "BodyAcceptance"}
{"post_id": "dfoqbb", "created_utc": 1570660818, "title": "I’ve struggled with accepting my body and everything else, then I got cheated on and it got so much worse.", "author": "IDontWantKids99", "self_text": "I never liked my body so much at first, though there were days where I thought I looked good. So I had some days where I was hell confident! But ever since I got cheated on, I’ve completely hate every aspect of me. It’s been a year and I find myself deeper into hatred of my body.", "subreddit": "BodyAcceptance"}
{"post_id": "dfqrl6", "created_utc": 1570670543, "title": "I am Happy and Beautiful", "author": "purrfectpaige", "self_text": "The last 8 years of my life have included an off and on battle with anxiety, depression and an eating disorder. Those things were at their worst from 8th-10th grade and then again in my freshman and sophomore years of college. \n\nLately, I've been looking back on pictures of myself from 3-4 years ago (first 2 years of college) and wishing I was that thin again. \n\nLuckily, my boyfriend keeps reminding me that, even though I was thinner, I was not healthy or happy. I was struggling with extreme depression and anxiety, and also having a relapse with my eating disorder. \n\nWithin the last 2 years of my life, I have found true happiness. Along with gaining this happiness, I have also gained weight. While I have been struggling with the way I look lately, I am so happy to say that I have not turned back to my eating disorder to try to \"fix\" this.\n\nI am going to be healthy, keep my happiness, and love my beauty no matter how much I weigh.", "subreddit": "BodyAcceptance"}
{"post_id": "dfsnjp", "created_utc": 1570680671, "title": "We need to stop Body Shaming our President", "author": "CookingPapa23", "self_text": "Title says it all. I am over everyone attacking the appearance and physique of Mr President. I get it, Donald Trump is  a nasty nasty man, who has done and said a lot of things that have upset people, but for god's sake, when you insult his body you insult millions of other people who look the same. It is not ok to criticise his appearance. Say whatever you will about Mr President's politics, his speech or his character, but by bringing his body into this you normalise hate speech and violence against people of size. I've seen so many illustrations, cartoons, comments, and even blow up kites in the streets that only body shame the president . This is harmful. I hope we can all be more mindful and address these 'tactics' because they do more harm than good. THink of the message you are actually saying. I hope we can all be more aware of this in our current climate which is already fatphobic enough. All of us need to consider the voices and experiences of Fat people in everything we do, including standing up to the President.", "subreddit": "BodyAcceptance"}
{"post_id": "dfxg85", "created_utc": 1570711303, "title": "How can I change body acceptance - from a good idea - into a belief I have about myself?", "author": "MaybeAThrowaway7501", "self_text": "Hi there. A bit about me: I'm a man in my mid-20s and I can't remember ever having positive body image. Without really having a male role model growing up, puberty was an interesting time back in the day. Now that I've grown into my body - with traditionally masculine traits such as body hair (chest hair, etc.) - I don't really have a positive lens to look through and view myself.\n\nI've made great leaps and strides in the last couple of years in terms of accepting and loving who I am as a person - what values, character traits, hobbies, etc that I have. However I'm trying to find the piece of the puzzle that can extend this acceptance (and confidence) to my body.\n\nWhen looking online, I am having a hard time finding resources that I could relate to, when it comes to male body image. I'm hoping to find some way to take the shame and insecurity around things like body hair, and turn it into acceptance - a positive, confident belief I have about myself. \n\nLooking to get this discussion started, and if others have resources, that would be much appreciated! :)", "subreddit": "BodyAcceptance"}
{"post_id": "dfywoe", "created_utc": 1570718155, "title": "I’m fine until I’m triggered.", "author": "shot_in_the_head", "self_text": "I will feel confident and beautiful one day and then something triggers me and I hate myself. It can be anything, it can be something someone says or something on tv. Yesterday, it was sex scenes with a girl riding someone with her tits out everywhere. It makes me so uncomfortable and self conscious. Even if I’m by myself but especially when I’m with my fiancé. She had a perfect body and it was just on display like rubbing it in my face that she’s hot and he can look at her and it’s okay for him to because it on tv. I know it’s not necessarily rational. I just don’t know what to do other than see a therapist. But I can’t afford one, and I have zero time to see one. I just want to stop comparing myself and just feel beautiful without letting someone else’s beauty control me. I post on here frequently, it’s because I have really no one to confide in on this topic. So I’m sorry if I’m repetitive I just need some outlet.", "subreddit": "BodyAcceptance"}
{"post_id": "dfzcmt", "created_utc": 1570720042, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "dg5kc5", "created_utc": 1570746090, "title": "Body shaming from someone you trust and respect hurts deeply :(", "author": "futuregoatfarmer", "self_text": "My boss is someone who has taught me so much, does a lot for us and has been a personal mentor to me. She also makes fairly regular, not-so-veiled comments about my weight culminating in an outright rude comment today. It's the unsolicited, \"Have you lost some weight? You look great!\" and \"Stop losing weight, you're going to waste away!\" every so often that stings a bit but I can usually brush off. Today in a staff meeting we somehow got on the topic of scrub top sizes and she busts out with, \"every one in the field seems to be small, except...\" while starting to point at me, sees my face, and awkwardly trails away while trying to reel it back with a comment about big boobs! I honestly didn't know how to respond and just laughed. I suck at confrontation but feel like I should say something at this point, but I honestly don't know how :( I have a history of ED and every time she makes a comment like this I slip back to unhealthy eating patterns, skipping meals etc. for a bit. Just hurts man", "subreddit": "BodyAcceptance"}
{"post_id": "dg6s6r", "created_utc": 1570751778, "title": "Small breast acceptance", "author": "MoonlightPrincessa", "self_text": "Today is one of those days where I’m feeling insecure and down. Normally I’m the first to say “embrace your body!” “Small boobs are cute and sexy,” etc. And on most days I truly do love my boobs. I don’t even wear bras anymore, it’s been such an uphill climb to try and love myself as is. But today is not a day where I do.\nI feel gross, like my body isn’t feminine enough. I  just feel like no man will ever find me attractive, body wise let alone even facially.\nI hate feeling like this. And to everyone who is also feeling this way today, I apologize. We’re in this together.\n\nI hope you all have a lovely night and feel better💕", "subreddit": "BodyAcceptance"}
{"post_id": "dggix3", "created_utc": 1570806587, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dgt78h", "created_utc": 1570874651, "title": "I had my confidence shattered today", "author": "TurningBlueArrows", "self_text": "Ive been insecured with my penis for a very long time, and today i just hate my penis completely. Back then i used like my penis during certain days where things are alright, and sometimes i dont like my penis when im feeling extra insecured. My penis is about 5.5 inches in length and 5.2 inches in girth when erect, which i know is statistically average. But i cant help, but feel like its still too small. Today, a girl and i were talking dirty and swapping pics and she asked for a dick pic, so i sent her one, and she replied with \"Your dick is small, but cute.\" I felt so shattered and embarassed that i stopped talking to her and i cut all ties with her. I dont like my penis anymore, and i find everything about it ugly. All i can think about is how lucky those big guys who post on penis subreddits and ratemybody are. Im sad, and im crying right now. I hate everything about me. I tried to accept my body, but how am i supposed to accept my body and my penis if i get shit like this. It makes no sense.", "subreddit": "BodyAcceptance"}
{"post_id": "dgu5ue", "created_utc": 1570881185, "title": "Why do I feel insecure about my big feet and hands?", "author": "[deleted]", "self_text": "Like literally that's what they are: feet and hands. I don't think anyone cares about them, except for maybe foot fetishists. But I still feel like I'm not womanly or feminine because of it. They aren't even huge, just a bit bigger than the average. Have you experienced social stigma around this, or is this completely just in my mind?", "subreddit": "BodyAcceptance"}
{"post_id": "dgvn8y", "created_utc": 1570889520, "title": "Why do people think it’s okay to comment on my weight all the time?", "author": "Ojay_xo", "self_text": "I’m a small person (female,22). 5’4” roughly 110-115 lbs. I did competitive gymnastics growing up and my metabolism is ridiculously fast, even after I quit the sport. society here in the Midwest has told me that if I say that statement to anyone that’s not the same way, I’m “bragging”. I’m not. I’m just trying to give context. \n\nWhen I’m at work (retail), customers will say stuff like\n “oh you must eat like a bird!”\n“Oh my gosh you’re so thin! ...well you must not eat very much”\n“You’re thin as a rail! You need to eat more”\nI’m just trying to make small talk at the registers sometimes and these people turn it into a questionnaire about my eating habits. I always say “yeah I eat a lot actually but my metabolism is super fast. It’s a blessing and a curse” but most people don’t like that answer. They just kinda say “really? Oh.” And it’s annoying bc I know in their heads their thinking yeah right lady. \nThis is a legit conversation I had with a coworker\nMe: *walks by*\nHer: oh my gosh you’re so thin!!!\nMe: ....yeah I’ve always been this way. It’s a blessing and a curse. \nHer: well do you eat!???\nMe: ....yeah?? \nAnd I just walked away. Another time one of my coworkers was suggesting a burger place for lunch and she interrupted herself and said “wait do you eat?” And I was just kinda set back. I don’t understand why literally everyone thinks just bc I’m thin that it’s okay to comment on my weight. Maybe I don’t wanna be thin! \n\nOnce, I walked by two customers talking to each other and I heard one of em say, “oh my god look she’s so skinny” in this kinda rude judgy tone. Another time an old coworker came in to shop and she straight up asked me, “are you getting thinner?” And her face kinda contorted all weird and showed disgust. \nAny time I’m helping a customer in the plus size section and they talk about some problem they maybe are having with the way a piece of clothing is fitting, they always throw in, “oh well you wouldn’t know, you’re tiny” and it’s like yeah lady I’m tiny. I, too, have many problems finding that perfect dress that fits just right. But I can’t say that. \n\nSo basically if you’re thin in the Midwest, society is gonna harass you about it and tear down your self esteem with these weird comments that make you feel like you look ugly and too thin. \nSometimes I come home and ask my bf if I’m too skinny or if I look like I’m dying or something bc people treat me like this. I’m just sick of it. I think that if it’s not okay to fat shame people, it shouldn’t be okay to skinny shame people either. (That means you too, Meghan trainor. )", "subreddit": "BodyAcceptance"}
{"post_id": "dgwbat", "created_utc": 1570892783, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "dh2sb3", "created_utc": 1570923403, "title": "23M, I'm abnormally skinny and I hate my body", "author": "RealUncleWeasel", "self_text": "I think I lost the genetic lottery because no matter what I do I just can't gain weight. What other people consider to be \"skinny\" men looks totally healthy to me. I'm abnormally skinny, almost anemic. I'm 6'4\" and 185 pounds, and I look like a bean pole, even though I eat right and work out. I still have no arm definition. I still barely have biceps, or a chest, or back muscles. My face doesn't look cut or angular, it's undefined. I don't look masculine. I barely look like a real person. I feel like I'm trapped in a 17 year old's body. People tell me that I'm fine, but I don't believe it at all. I want to feel normal. I want to feel attractive, and be attractive. Right now I feel diminutive, weak and invisible. How do I learn to love myself?", "subreddit": "BodyAcceptance"}
{"post_id": "dhheaq", "created_utc": 1571004697, "title": "I feel very inadequate", "author": "prototype1B", "self_text": "One issue I really struggle with is how inadequate I constantly feel around beautiful, attractive women. \n\nWithin the last couple of years this has also leaked into porn watching. My sex drive has lowered considerably over the years, and I really only watch porn once a month if at all. I always feel disgusted with myself during or afterwards. I keep focusing on how attractive and desirable the porn stars are to men, even amateur ones are bombshells, meanwhile I'm absolutely hideous and undesirable. I wish I had their faces and I wish I had their bodies, I wish my ass wasn't so flat and I wish my breasts developed normally. It's shallow and sick but I get so jealous of those women even though I'm really not that type of person at all to have ONS or FWBs, I'm just jealous they are desired by many and are very experienced with sex. I'm closer to 30 than I am I to 20 and I'm still a virgin, pretty pathetic right. \n\nI feel undeserving of any man liking me or being attracted to me. I would never believe them if they said they did either. Compared to beautiful women I don't feel like a woman at all. Like I don't even belong to the same species. Sorry this sounds incredibly dramatic and annoying but this is how I feel. I know how stupid it sounds. It's really soul crushing and makes me extremely upset to think about . I know that most men really enjoy porn and beautiful women so I just feel hopeless. I have nothing of value to offer anyone and I truly deserve to be alone.", "subreddit": "BodyAcceptance"}
{"post_id": "dhssal", "created_utc": 1571069565, "title": "Meta Monday-A plague is on our house", "author": "maybesaydie", "self_text": "October has been a bad month for the mods of r/fatlogic. Our  /u/GetOffMyLawn_ has a very bad and lingering case of the flu, /u/SomethingIwontRegret has a badly broken leg and I have a kidney infection. If we are slow to respond to a modmail, we apologize in advance. \n\n\nEnough whining from us. The selfie post is Monday, Nov. 2nd so get your progress pics and Halloween shots ready.\n\n\nTake this opportunity to chat with your fellow fatlogic community members. No rants please.\n\nUntil next week, \n\n r/fatlogic mods", "subreddit": "fatlogic"}
{"post_id": "dhtdum", "created_utc": 1571072057, "title": "Quitting Burlesque Helped My Body Confidence", "author": "LowriLlew", "self_text": "Hope [this](https://restlessmagazine.net/quitting-burlesque-helped-my-body-confidence/) is okay to post! I've dabbled in freelance writing for a few years, but this is the first time someone has wanted me to write about my own experiences. I felt pretty vulnerable sharing my insecurities to this extent, but I'm happy with how the piece turned out. Interested to know whether anyone here has tried burlesque, and if so, what effect did it have on your self-esteem?\n\nHope you enjoy :-)", "subreddit": "BodyAcceptance"}
{"post_id": "dhy9gc", "created_utc": 1571092086, "title": "Tips for advocating for yourself at the doctor?", "author": "Pugshugpugs", "self_text": "Hi,\n\nDoes anyone have tips or anecdotes in regards to the topic of weight stigma in a medical setting? I have struggled really hard with ED behaviors in the past and am now far from \"thin\". I have always had huge weight fluctuations. This is largely due to my endocrine disorders. I have finally decided to accept my natural size and shape, but modern medicine has not come this far. Share your tips/stories?!", "subreddit": "BodyAcceptance"}
{"post_id": "dhytai", "created_utc": 1571094516, "title": "I don’t know how to feel about myself", "author": "Rhys_r16", "self_text": "Nobody really calls me ugly, except for like those really petty individuals. I wouldn’t say I’m ugly, it’s just whenever I look in the mirror I don’t see anything that sticks out as attractive or as a redeeming physical feature. I’m a short guy, my hair is alright but has started receding at a young age (I can cover it successfully), my nose is big but fits my face, my ears are really small, smaller than my pinky and I have a jawline but it isn’t by no means sharp. I look myself in a mirror and I don’t feel ugly or attractive. Just neither. I ask myself what do people find attractive in me and I can’t really see anything. And it does get demotivating at time’s because I feel like everyone has at least one feature that they can say is an attractive feature to them and others. My best feature used to be my hair but as you can imagine I’ve had to come to terms with the fact that it’s going to be gone by the time I’m 20 and as a result my hair has lost that status as it is thinning. I don’t know if this applies to this sub or anything I just wanted to get this off my chest", "subreddit": "BodyAcceptance"}
{"post_id": "di97rg", "created_utc": 1571152072, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "din3kh", "created_utc": 1571220017, "title": "Trying to love myself!", "author": "SensitiveLilFuck", "self_text": "There is alot I don't like about my body, the hair I have despite being female due to PCOS. My smallish saggyish boobs despite being 19. But I'm human, and I want to love myself. I sooo many beautiful bodys with \"imperfections\" so why can't I also view my body as beautiful! \n\nThis is going to be my attempt, I am hoping to find some sexual partners and feel vulnerable! And feel accepted. I might post on other body positively subreddits at some point to try feel better. I'm sick of not liking myself, my body is enough!\n\nThat is all :)!", "subreddit": "BodyAcceptance"}
{"post_id": "diqlt0", "created_utc": 1571238513, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "dix2mb", "created_utc": 1571265319, "title": "Body changes", "author": "leslie_no_thank_you", "self_text": "Hi all! New here. Over the past two years I have gained about 60-80 pounds from my previous weight at 140 due to hormonal birth control and anxiety/depression medication. I was never a girl that worried too much about my weight until this rapid weight gain and it has been a self confidence struggle to learn to love this new body that doesn’t always feel like mine but I feel like I have made a ton of progress. Over the past year specifically I have really been putting in a lot of work to love myself and my body, but one area I have been lacking in is my fashion. I used to love expressing myself through my clothes, and since I have gained some weight that love went out the window. Now when I try on things I just feel sad and depressed and then end up wearing jeans that are worn down in the thigh area and men’s tee shirts, etc. I want to feel cute again when I look in the mirror. Does anyone have any tips on styling/ tips / places to shop to help me feel more like myself again? If it helps I am a size 14 in pants and about 5’8. Would love any help. Xx", "subreddit": "BodyAcceptance"}
{"post_id": "dixffa", "created_utc": 1571266908, "title": "Diet Culture at Work *Vent*", "author": "bitecake", "self_text": "I have coworkers who are into Diet Culture.  Whole30, unhealthy juice cleanses, obsessing over 5 pounds, complimenting skinny people on their skinniness, it's all they talk about *every day for years.*   One has catch phrase \"I love you like a fat kid loves cake\"  and is incredibly immature, vain and vapid.  It's a buzz kill when there's free pizza or donuts and they bitch about it messing up their diets.  I mostly say \"no thanks\" to treats, but their obnoxious whining makes my own \"no\" feel harder.\n\nOne of them has a chubby tween daughter and it breaks my heart to hear her brag about hounding her about food.  Encouraging healthfulness would be great, but what she's doing isn't that.\n\nA different co-worker gained extra weight during her pregnancy, and today I overheard the Dieters talking about her and how \"uncomfortable\" she is with her overweight body *according to them.*  Dieter says, \"I, of all people, do not care that she gained weight, she does not need to be so awkward around me.\".  The conversation ended with them patting themselves on the back for being \"so nice\" to Overweight Mama.", "subreddit": "BodyAcceptance"}
{"post_id": "dj7kmp", "created_utc": 1571324354, "title": "Starting to feel superself concious about my looks and personality", "author": "apatheticallyhere", "self_text": "Im 26 f and Ive been dating a 35 yo man for the last 9 months. Things mostly seem to be going really  well but we really don't talk about our feelings much. I tried to tell him I love him and got no reply. Seperate from then I've tried to express to him that I'm feeling insecure about myself. I don't feel I have anything to offer besides my body and even that isn't ANYTHING to brag about.  When I said that to him he didn't say much besides that he likes how I look. I couldnt get up the courage after that to say much more in person without breaking down. I asked him over text after if he was happy with me or if I can do anything to make him happier and he just said it makes him happy when I'm happy and that hes not great at that sort of thing. I have to say he does treat me so well and I love him a lot but I'm beginning to feel that he isn't having the same thoughts about me. I guess mostly I just don't know what to do now. I want to ve with him but I feel empty and I don't want to force him into saying he loves me but I just wish I knew how to ask him to communicate more without being to scared to communicate that to him in the first place.", "subreddit": "BodyAcceptance"}
{"post_id": "dj7oyd", "created_utc": 1571324864, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "djdg1s", "created_utc": 1571349487, "title": "About to start working soon, how do I dress in a way that doesn't trigger my body dysmorphia without looking like a slob?", "author": "kenmayy", "self_text": "Sorry if this doesn't belong in this sub, but I don't know where else to ask.\n\nI'm 5' tall, 140 lbs and hate my body, I struggle with eating disorders bit that's not the point of this post.\n\nThe only clothes I feel comfortable wearing are men's joggers, they have to be lose fit. It can me any material, Chino, cotton, as long as it's joggers. I only feel comfortable in t-shirts, I also never wear a bra because it feels too feminine. I usually also wear big hoodies to cover my chest area just to be decent and hide the no bra thing.\n\nMy question is, what kind of clothes can I wear to not trigger my BD, I'm afraid if I go in for an interview I'll be looked at like a mess and nobody will hire me, my hair is unkept because that's how I like it, I dont wear makeup either. I'm too afraid to touch woman's clothes because I think I'll look like an idiot, just some fat idiot trying to look like a girl. \n\nAre employers/interviews generally accepting of those kinds of clothes?", "subreddit": "BodyAcceptance"}
{"post_id": "djj2p7", "created_utc": 1571377542, "title": "What’s it matter what I think", "author": "breezy-beaver", "self_text": "Two years ago I hated myself because I was ugly- it’s starting to come back. I kept looking in the mirror and telling myself i was attractive and now, when I look in the mirror i see an attractive person. Nobody else does though. I’ve started going out more, and nobody seems interested in me, Attractiveness is inherently decided by other people. What’s it matter what I think if all the guys I like wholeheartedly disagree?", "subreddit": "BodyImage"}
{"post_id": "djk3jm", "created_utc": 1571384244, "title": "Struggling to feel sexy", "author": "littlestpupai", "self_text": "I’ve been with my boyfriend for 6 years and I would say that our sex life is still going pretty strong.  But the other day I impulsively bought some lingerie, thinking it might be fun to surprise him with it this weekend.  I’ve never worn lingerie for him before and I was excited to showcase my body in a new way.\n\nWell my plan backfired.  I received it in the mail today and I just tried it on.  It made me feel awful about my body.  I’ve always been pretty slender but as I’ve gotten older I’ve put on a bit of a spare tire around my waist.  I felt like that was all I could notice about my body in the lingerie.  That and how the thigh highs cut into my legs causing them to bulge, and the amount of cellulite in my butt and thighs.  I felt disgusting, to be honest. \n\nI think the problem is that I was looking at the model in the product photos and envisioning that my body would look the same as hers in it.  And then it was really jarring to see the reality.  I want to say fuck it, this is my body and it’s beautiful.  But when I look in the mirror I don’t feel that way.  I feel embarrassed.  I wanted to feel sexy for my partner but now, instead, I want to hide my body in shame.\n\nI don’t know what the answer is but I thought it might help me feel better to share how I was feeling.  Any insight and advice is appreciated.", "subreddit": "BodyAcceptance"}
{"post_id": "djouil", "created_utc": 1571411386, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "djsoch", "created_utc": 1571427626, "title": "K-pop made me insecure about height", "author": "postpostpostpost_inf", "self_text": "I stopped listening to kpop because most of fanbase, and even plenty of idols, tend to be short, while I am 5'11. I never liked kpop to begin with but I wanted to be a part of a subculture, while darker ones like goth are not from 2019, so I got into it. Besides, a lot of fans have an aesthetic that revolves around being small.\n\nK-pop in general is full of excessive idealism.", "subreddit": "BodyAcceptance"}
{"post_id": "dk03od", "created_utc": 1571467212, "title": "22F learning to love herself day by day", "author": "Ness_quik", "self_text": "Due to mental health struggles I’ve been dealing with the past 6 years, the internalization of mainstream media, and shitty at-home mirrors, I’ve had an extremely difficult time loving myself and my body. In high school I somewhat exercised but after I graduated I stopped completely, and didn’t start back up until a earlier this year (I still don’t exercise as much as I want, tho). I’ve grown to develop a belly which I have a hard time loving. Ample breast size and decent waist, but covered by my rolls. Shapely legs. I cry over wanting a more hourglass-shape even though a couple people tell me I’m not too far off from it (I just think they’re being nice). I know I can achieve an athletic hourglass physique at the gym, but I don’t have all time and resources I’d like to get the gym on a daily basis. Anyways, I’m slowly trying to improve how I see myself. I don’t have any full-length mirrors in my room so I usually use the tv reflection even though it’s not a good indicator of how I look. I hope to see better days for my self-love. Thanks for reading", "subreddit": "BodyAcceptance"}
{"post_id": "dk4xv2", "created_utc": 1571497600, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "dk7575", "created_utc": 1571507435, "title": "As I started getting more into fitness I started to feel a bit more low about myself... Is that normal? How can I start improving my mindset?", "author": "[deleted]", "self_text": "I started working out consistently to improve my body. I thought it was disgusting and unfeminine. As I started getting \"results\" and an increase in muscle size, I became a bit more confident in myself. However I constantly compared myself to fitness influencers with great genetics and put myself down. I would go on instagram, look at other models, and feel this sick feeling in my stomach. My body isn't amazing. Even after 2 years of working out, my pudgy stomach is still there, my love handles are present, my butt and hips are still small, and I still feel terrible with how I look. And whenever I go to the gym I feel judged by guys and those girls with the sexy bodies that I personally wish I had (flat stomach, big butt, and overall toned physique). \n\nMy boyfriend is big on fitness too and used to make an occasional comment or two about a \"thick\" girl or a girl who clearly has a different body from my own (let's just say a trendy body - the big butt thing). I told him to stop and he complied and listened, but the words he said in the past to me just can't seem to go away. He tells me he loves my butt the way it is and my stomach, and especially my legs. But I'm always comparing myself to other women with different bodies from mine. I feel like my body isn't enough for him as well because my butt isn't big enough and my stomach isn't small enough... His comments about other girls really affected my confidence. Help? How can I start improving my mindset? I hate feeling this way and wish I could feel secure in my own skin as I go to the gym or even as I have sex with my boyfriend. Thank you.", "subreddit": "BodyAcceptance"}
{"post_id": "dkbmjx", "created_utc": 1571528140, "title": "Hi. I’m Very Much New Here.", "author": "rebecca_astor", "self_text": "Hey gang.                                                                      \n\nDefinitely new to this subreddit, and the whole idea of body acceptance to begin with. I actually wrote about accepting myself when others don’t in our modern world of online dating. If anyone wants to give it a read, well, I’d love to hear from you or just share this! Keep shining, all you crazy diamonds!                                                \n\n\nhttps://arewesweethearts.com/2019/10/17/tinder-and-the-art-of-self-loathing/", "subreddit": "BodyAcceptance"}
{"post_id": "dkbnc2", "created_utc": 1571528245, "title": "New member here, body image is poor", "author": "GSS55", "self_text": "Hi All,\n\nReally glad I found this reddit.\n\nI am 33, from UK, and struggle a lot with my body image and self  esteem. I have a condition (which has caused about a million anomalies in my body - ok that's an exaggeration - the issues aren't life threatening but serious enough to require management to avoid complications - some of which can be severe).\n\n&amp;#x200B;\n\nAnyway, I was born with large feet and getting shoes/trainers is a nightmare. I've found lots of choice now, mostly in the USA (so I can't even try shoes before I buy, making it a big gamble). It does not help that most shoes are ugly and when you look at shows by feature, I need everything. e.g. wide toe box, extra depth, stretchable, etc.\n\n&amp;#x200B;\n\nOk, so the shoes I have dealt with and being able to get them from USA helps.\n\nA few years ago I developed a symptom of my primary condition which means my legs got a bit bigger. Jeans used to be easy to wear and find, but now I have limited choice, and like with shoes, need to get from USA. I also don't want jeans that are too baggy. I won't feel attractive in that (or ugly shoes). Today I threw a tantrum as I am fed up with my current jeans that are loose but just catch on the biggest point of my calf. I am lucky that my leg swelling is not noticeable in public and I have no pain or tiredness. On top of all this, I decided to try on an old pair of jeans I outgrew, no idea why, when I already did this when the swelling happened and the conclusion was they are too tight to wear. Not sure what I was looking to achieve there, probably just want to go back to old times...\n\nI discussed this with friends and one friend kind of helped, but from both, they put it down to first world problems. Most of my friends think I look fine (I also struggle with my facial looks, and my rejection in dating does not help).\n\n&amp;#x200B;\n\nI attend counselling and my counsellor is fantastic - great knowledge, I usually learn new things, empathetic, good listening skills, etc, but I don't expect anything amazing from her on this topic (or I am cynical). We have delved into this topic but it is just one of many topics and then I am ok, but then I relapse, like with my tantrum above (which is really my first ever, but probably not last).\n\n&amp;#x200B;\n\nI don't expect any magic tricks to tackle this issue but any online resources to help with body image is appreciated. I am single, god knows how the issues above would impact on a relationship...", "subreddit": "BodyAcceptance"}
{"post_id": "dkemf2", "created_utc": 1571543893, "title": "Compared to Romans", "author": "MyBackstageSeat", "self_text": "Yesterday I had my senior portraits done and have already gotten some sneak peaks back that I adore. However, I couldn't help but immediately notice those parts of my body that I feel insecure about-my hips, my tummy, my legs, my arms (basically my entire body). Like this sub's description, we are constantly bombarded with the \"ideal body\" within today's society. So, I was instantly examining myself under that microscope. I felt so insecure, like I had no \"figure\" in comparison to the women that are plastered in front of us.  \n\nBut then, I took a step back and picked up a different lens.  I decided to look at my body under the beauty standards of Ancient Greece and Rome. I looked up statues of Venus and Aphrodite, the respective goddesses of beauty, and admired that they have tummies and hips and bumps and rolls just like me! AND they were regarded as the epitomes of beauty. This is something I do every now and again to remind myself that a lot of today's beauty standards aren't of human bodies, but of medically altered bodies. Bodies that are stretched, and pinched, and pushed to an extreme the doesn't resemble its natural course. \n\nThe Greeks and Romans just loved the human body for what it was- tissue, fat, and flesh. And that is how I choose to love my body. I hope that sharing my method of body acceptance and appreciation can lend itself to others- men and women alike- to appreciate their bodies for what they are- bodies!", "subreddit": "BodyAcceptance"}
{"post_id": "dksbia", "created_utc": 1571616877, "title": "My boyfriend is insecure. (Possibly NSFW)", "author": "TeaPennyroyal", "self_text": "My (19F) boyfriend of 1 year(27M) is extremely insecure about his penis size. It is relatively small, probably 4.5inches when erect— but I love it. Our sex life is incredible, and while he usually finishes pretty early, he still satisfies me completely. I truly believe he’s the perfect size for me, fits right inside and even goes all the way to the back, but he doesn’t believe me.\nHe hates me looking at his penis when it’s soft, I wish he would be more comfortable and allow me to love his imperfections.\nAny advice on how to boost his confidence?", "subreddit": "BodyAcceptance"}
{"post_id": "dkuaik", "created_utc": 1571627016, "title": "Nude pictures", "author": "ProgAce23", "self_text": "So I've recently had the idea to start taking nude photos of myself to help keep my self confidence up.  Does doing that actually help boost a person's view of themselves?  Who here has done this and has felt better about their body?", "subreddit": "BodyAcceptance"}
{"post_id": "dl8eo3", "created_utc": 1571698276, "title": "META MONDAY: Apparently there is no more actual fatlogic to be found...", "author": "maybesaydie", "self_text": "...so people are just posting anything. People are shitty to fat people because they're fat. It happens and fat people complaining about that is not fatlogic. Don't post that. The politics of fatness is just that--politics--and we don't allow politics. Don't post that.\n\nThis is not r/fatpeoplehate. We are  amazed that we still have to remind people that it isn't. \n\nFeel free to complain about your oppression below.\n\n\n\n\n^^^We're ^^^not ^^^angry, ^^^just ^^^disappointed", "subreddit": "fatlogic"}
{"post_id": "dlc4ta", "created_utc": 1571715633, "title": "Please read:/ *Please leave advice", "author": "shortbrokepinkhoe", "self_text": "hey:) i’m really struggling on body issue. I’m normally very horny, and i’d like to have sex, but i’m afraid to because of how i view myself. i’m about 5’, and have small boobs. (32A) or less. I have stretch marks , and on my butt i have little bumps, I have a good figure, and am toned, but don’t have “feminine” features i’d like to see, and nothikg i’ve done has worked. It’s hard to explain this to partners because I always make it akward and feel like i’m gonna make it unenjoyable for them . what should i do ?", "subreddit": "BodyAcceptance"}
{"post_id": "dlcvyw", "created_utc": 1571719882, "title": "Girlfriend has been having body confidence issues and I want to help her", "author": "dingledonger115", "self_text": "My (m17) girlfriend (f17)’s self confidence issues are impacting our relationship.\n\nLike the title says. But here is more of a backstory.\n\nWe started dating a year and a half ago in our junior year of high school. Things started out slow but we started making out and doing more sexual things. Everything up to sex. Over this summer, we didn’t really do much of anything. We hung out rarely and never did anything like we used to. She has been telling me recently that her self confidence is really low and is disgusted with herself when she looks in the mirror, and if she thinks of herself like that, how can I think she is beautiful. \n\nI truly do think her and her body is beautiful, and I try to tell her that whenever I get the chance. I don’t only want her to have a self confidence boost so we can do more sexual things, but also so she can see her body the way I see it. As beautiful and amazing. I hate it when she tells me her body is ugly and disgusting and it makes me really sad. She wants to do more things with me but tells me just thinking about her body stops her. What can I do to help her with her body confidence?", "subreddit": "BodyAcceptance"}
{"post_id": "dlj7of", "created_utc": 1571756821, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dlj8ef", "created_utc": 1571756909, "title": "Been struggling for a long time..", "author": "Mr_SteELO_Your_Elo", "self_text": "I'm new here, so hopefully I don't break any rules with the contents of this post.. but I'm a 22 year old man with really bad dysmorphia/self image. I believe it was pushed upon me by the years I spent wrestling and how closely I tied my identity to my athletics. When I stopped running, when I stopped weight cutting, when I stopped watching what I ate to the extreme, I didn't become horrendously overweight..\n\n\nI became average. But average is a nightmare for me, I'm completely unable to process and accept myself, because I'm not at that high standard I used to hold myself to. I used to maintain 7% body fat for most of the year, and now I loathe myself.\n\nI don't mean to put anybody down if they are looking to accept themselves as they are. I'm seeking the same thing. I'd love to get into shape for the great way it made me feel, but unfortunately I'm driven by a need to \"fix myself\" and I want to stop this toxic mentality, but I cannot break the cycle and it's killing me inside. And the worst part is, nobody I've talked to understands. By most accounts, I'm already in decent shape. I'm just not ever enough for myself.\n\nThanks for letting me vent.", "subreddit": "BodyAcceptance"}
{"post_id": "dllprm", "created_utc": 1571767320, "title": "I Feel Bad About Myself", "author": "fayenicillin", "self_text": "I went to the mall to take my ID pictures taken. While waiting to get my copies, there’s this male staff. He was the one cutting the pictures into its designated size. Before me, there’s this girl (she’s really pretty\\~) and when its her turn to get the photos, the guy suddenly became “too concerned” to this girl.  Like giving her photos with delicate care like his life depends on it and telling her softly to access their site to get the soft copy of her photo then asking her if all went well with accessing the site. While me, on the other hand, drops my photo on the floor. Uneven cutting of my photos and giving my copies like it's a big burden to him.\n\nThis made me insecure. Lol! I'm sorry for being petty. I don't have someone to share this story, that's why I posted it here.", "subreddit": "BodyAcceptance"}
{"post_id": "dlujai", "created_utc": 1571807582, "title": "How fat was I before??", "author": "beantoes1610", "self_text": "Whenever someone says that I’ve lost weight or that I look better, the only thing I can wonder is how fat I was before. My university had homecoming last week and naturally I saw alumni I had known from previous years. A lot of them mentioned that I looked good and that I had lost weight. I still hate myself the same amount so how fat was I back then?? Even if I have lost weight, I still feel like an exploded can of crescent rolls. Whenever someone says that I’ve lost weight or that I look better, I can’t help but ignore what they say, and my mind only wonders how fat I was back then. I feel like shit about my body now so I can’t imagine how bad I should’ve felt a few years ago.", "subreddit": "BodyImage"}
{"post_id": "dma145", "created_utc": 1571884235, "title": "i genuinely feel ugly (tw: eating disorder)", "author": "blossompiggy", "self_text": "i (21f) spend a significant portion of my life trying to be more confident. \n\nabout a year and a half ago, i started seeing an eating disorder &amp; body image specialist. at the time, i was binge eating and occasionally purging. i saw my therapist for a while and she was so great. we worked on a lot of my food-related issues and things really started to improve. i began intuitive eating and exercising not as punishment, but as pleasure. i started to care more about how i treated myself &amp; how i loved myself in general. \n\nin may, i graduated from college &amp; moved home to save money. i’m back home with my parents (a trigger for me with eating problems) and since being home &amp; losing a lot of the supports i had (free, regular counseling provided by school, fitness center &amp; fitness classes i LOVED, friends). here at home i live in a rural area. i’ve tried getting involved but it’s been difficult to meet friends, no matter fitness classes, and therapy is expensive (but i am planning on going back in the next two weeks)\n\nsince being home, i have been flooded by the feelings of worthlessness again. i feel genuinely ugly. i do not feel like a beautiful person anymore. my weight (5’3 and 200lbs) is something i’ve come to terms with &amp; i know my eating disorder gets worse when i try to extreme control it, but beyond that i truly believe i am an ugly person &amp; i don’t know how to change my mentality", "subreddit": "BodyImage"}
{"post_id": "dmc5iq", "created_utc": 1571896734, "title": "My Journey to become the bear I know I can be.", "author": "NikoTaco02", "self_text": "I was born a woman. My mom has always been thin, and has been quite a perfectionist. My father has always believed that appearences and self-dispicline are the most important aspects of life. At least that is how he has acted.\n\nWhen I was in first grade, I was chubby. I have always had a sweet tooth and I have never been interested in the kind of excercise my parents were. I enjoyed swimming, they wanted me to walk, run, do gymnastics or any other strenuous activities I didnt find Joy in, unlike swimming.\n\nI was forced into bike rides and walks on a regular basis, often crying while walking. I was often rewarded with food after my walk.\n\nI was bullied pretty bad for other aspects of my life, and once during a bike ride I told my Mother that if we dont go home asap I would ride my bike under a car. That was when She realized I dont just disliken what they were forcing me to do, I hated it.\n\nI got quite depressed from the bullying and turned to food as a source of comfort. All the way up to seventh grade I heard derogatory comments about my weight, and was made feel like I was worthless and small for not being able to keep up with my athletic family whenever I was forced to go with them. Once my father and brother took me jogging, and once I couldnt keep up they told me they would be going home at their own pace and to follow them at my own. I cried my way home and locked myself in a small space next to our front door because I felt like I didn't deserve to be let in.\n\nI was 9.\n\nNow, I am categorized as obese. Food has been a signifigant comfort in my life after all the trauma I have had to go through.\n\nI have identified as a male for four years, and have been allowing myself to like the things I used to like before I went to school. Stuffed animals, hugs and most of all, myself.\n\nI have always been both physically and mentally strong. Way stronger than most people my age Who dont go to the gym. I am stronger than my Mother. In some aspects, stronger than my father.\n\nMy ideal body is large, strong and hairy. I relate to elephants and bears with their strong and majesthetic physiques. I have accepted my body, and even learned to embrace it. My parents cannot understand my liking of my tattood large body, but that doesnt matter. It is finally my body to do as I please with. \n\nI want to be a sensitive and huggable large man. I want to be all my father was not. I want to be accept and love my flaws like my Mother never could. I want to be unafraid and unapologetically myself like my brother fears. \n\nI want to be the best bear I can be.", "subreddit": "BodyAcceptance"}
{"post_id": "dmhqke", "created_utc": 1571929722, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "dmnsi6", "created_utc": 1571955243, "title": "What do I say when someone says \"you look skinny?\"", "author": "sundaisy825", "self_text": "In the last couple of months I've lost about 15 pounds. With that, coworkers and friends have been saying things along the lines of \"you look so skinny\". Not only do most of the comments not sound like compliments, none of them feel like compliments. I dont want to be told I look skinny. I feel uncomfortable and awkward and almost separated from everyone else in a way. And I really dont want my body commented on, frankly. I would also love to promote body positivity where I can because I dont think my coworkers hear enough about it. \n\nWhen this happens, I tend to just give an awkward \"thank you\" but I'm looking for some better answers I can give. Any ideas?", "subreddit": "BodyAcceptance"}
{"post_id": "dmysdp", "created_utc": 1572016181, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dn6n8b", "created_utc": 1572050706, "title": "I was happier when I was younger", "author": "bbanaenaes", "self_text": "I remember being a happy little 10 year old in elementary school.  I never had to worry about my body or looks.  Then middle school happened and relentless bullying about my weight.  Literally my friend group would constantly make fun of me. I was the butt of every joke they told. Now, as a junior in high school, I'm finally learning to love my curves. It's taken a lot of willpower and acceptance and it's still a slow process to actually accepting myself completely, but I know there could be a point in my life where I'm finally ok with myself and confident ( sorry for the rant and yes I did dump those toxic friends for much much better ones)", "subreddit": "BodyAcceptance"}
{"post_id": "dn6yjy", "created_utc": 1572052322, "title": "Strange body shape or skinnyfat? The world may never know", "author": "Pan_the_Lamb", "self_text": "The body positivity movement often makes me feel worse about myself, because bigger women than me often don't have the things I hate about my own body. I've learned to stop comparing myself to equal weight or skinnier women, but It's harder when I weigh less than someone and all I can think of is their tummy looks better than mine \n\nI've had this muffin top for as long as I remember. I probably had it as a baby. And I'm not skinny like I used to be, but I'm not fat either. I was skinny as a teen and I still had it.\n\nIf I look at myself in the mirror naked there's a dark shadow between my tummy and my crotch, and no amount of sucking in or Instagram poses can make it go away.\n\nI just don't understand. I don't even really care if my tummy is flat or not, I just hate the shadow. It looks so strange. It's gotten to the point where I think I must be shaped strangely because a lot of girls the same size as me or with more fat on them still transition smoothly from tummy to crotch. Whereas with me it's more like tummy.. tummy..STOP...crotch. my mom always said I was \"long crotched\" because pants fit me weird when I was a kid. And we're the same height but her legs are noticeably longer than mine.\n\nI just don't get it. And I wish I was shaped differently. I look like I'm squishing out of a lot of my pants even if they're loose.", "subreddit": "BodyAcceptance"}
{"post_id": "dnef7d", "created_utc": 1572099410, "title": "Love yourself!", "author": "sammspiess1", "self_text": "I’m not just talking about loving what you see in the mirror, I’m talking about loving everything about yourself.  \nLaugh at your flaws and silly mistakes \nAnd stay humble when you achieve great successes! \nLove yourself for every hobby you’re interested in, every weird fact that you know, everything that makes you unique..\nDon’t try to fit in because no one really “fits in” we’re all just finding our way on this silly little path we call our life.\nStop hating yourself for your flaws, stop hating yourself for not being as good as whoever or as strong as whoever and just embrace who you are! Love your body, love your mind, remember you are your own best friend, make sure to treat yourself accordingly :)", "subreddit": "BodyAcceptance"}
{"post_id": "dnf15w", "created_utc": 1572102414, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "dngzq3", "created_utc": 1572111182, "title": "I’m uncomfortable when he touches my stomach..", "author": "Ilona-Grace", "self_text": "This is a thing for me in all my relationships, I cannot stand having my stomach touched during cuddling. I was bullied a lot growing up about having a little poochy belly, and I can’t seem to let it go and enjoy cuddles... any advice on how to tell him I don’t like it OR to get over it???", "subreddit": "BodyAcceptance"}
{"post_id": "dnjc1u", "created_utc": 1572121921, "title": "Some logic in fatlogic", "author": "alanitoo", "self_text": "I've posted on here a lot. I am the OC of this post https://imgur.com/qRCAzsk which has over 130,000 views and often gets reposted on other subs. \n\nAnyway. I used to post on this sub a lot when I was manic. And I was diagnosed with Bipolar 1 a few months later. I had to deal with a lot of the drugs that madgastronomer posted on the tumblr site 'thisisthinprivilege'. \n\nI realized a lot of the drugs made me hungry. And I know logic. I gain weight when I overeat. But for a lot of these drugs it was either. Take the pill, feel better, but you will get hungry. And if you don't eat, a horrific depression set in. \n\nSo I just want you to know that I am beginning to understand the other side. It's logical to overeat if the alternative is horrific depression.", "subreddit": "fatlogic"}
{"post_id": "dnli3x", "created_utc": 1572132213, "title": "im confused, and i would appreciate some advice", "author": "booketydies", "self_text": "i’m genuinely so confused and depressed. i don’t have an eating disorder but i’ve been struggling with my weight for as long as i can remember and its recently getting worryingly worse. \n\nthe first time i really thought about my weight was when i was probably about five and i was in the car and i looked and my thighs and i was not living for it, i wasn’t fat but i really felt like it; but because i was a kid i just kind of shoved it to the back of my mind and did shit normally - it didn’t effect me but i was aware of it if u know what i mean.\n\nthe idea of body weight really started to consume my thoughts when i got into secondary school though (age 11). i was okay(ish) with my own body, but the thought kind of lingered, you know? \n\nbut at this time me and my sister (2 years older) shared a room. let me preface the next thought by saying something; I AM AWARED HOW SHITTY THIS SEEMS BUT I WAS A KID AND BITCHES BE RUTHLESS SO LET ME LIVE I STILL FEEL TERRIBLE ABOUT THIS ALL THE TIME. because me and my sister shared a room and only had one mirror which was on my side it was pretty regular for her to try on outfits and shit in the mirror and i would be able to see, but i would look at her and just think to myself, ‘wow shes so fat,’ and ‘her tummy isn’t flat,’ and i used to be like ‘i hope i never look like that.’ kicker is she wasn’t, and still isn’t, fat. like yeah shes a little chubby but like its fine.\n\nflash forward to like the summer holidays after year 8 (ages 13), karma was really a bitch and i was SO insecure about my weight. to the point where i wouldn’t eat all day, and then only eat dinner so my mum wouldn’t get suspicious. thing is i knew i wasn’t fat but i felt like it if that makes sense, i had a flat tummy and a weirdly small waist (which i was chill with), but my THIGHS, i shit you not they stressed me out so much. i did pretty intense dance classes (including ballet), and if you have ever seen or done ballet you know that takes mad muscle in your legs. so naturally, my legs were pretty chonky, and i was not having it. i remember my mum and sister used to call me lesbian legs and shit like that and it really took a toll on my confidence (not that theres anything wrong with the gays, they’re alright), it was just hurt that they were okay with having a laugh at my expense.\n\naround the christmas break of year 9 (age 14) was where shit kinda hit that fan, for a while i had been wanting to quit dance, i really enjoyed it and made loads of good friends there, but leaving had always been in the back of my mind because i was sick of the muscle-y legs. but i needed an excuse. so when the main teacher there left, i seized the opportunity and after a while of nagging my reluctant dad, i quit. I QUIT A PASSION I LOVED BECAUSE I DIDNT LIKE HAVING MUSCLE-Y FUCKING LEGS, FOR GODS FUCKING SAKE WHAT IS WRONG WITH ME. \n\nand in addition to this, around the same time my mum and her ex boyfriend (who, may i add, i think has given me some mindset problems; like i’ve never gotten on with my mum because of him, he teared down my confidence, make me scared to share my emotions and feelings, and made me feel isolated from everyone else. when i told my mum this - respectfully, cause it was a touchy subject - she would scream at me which kinda made me more shy of sharing my thoughts and feelings, which is probably why i’m discussing my body image issues on reddit when i have literally told no one about this). wow i went off on a tangent, but anyways, my mum and her ex had a messy break up back in september and it kinda dragged out and to make a long story short, at this time i would get in from school; feel depressed because pf hormones i guess; be hungry as shit; my mum would say she could her voices shouting over the road from our house (where he ex lived oops)(also: this made everyone think she was crazy because who cant hear even the loudest of shouting when there is a busy main road in between the houses); she would shout at me for not being able to hear the voices; i would sit in my room alone and feel guilty and unable to share my thoughts; then my sister would get home from her boyfriends at 10pm and shout at me for not helping our mum even though MY SISTER DIDN’T KNOW HALF OF THE SITUATION BECAUSE SHE WAS NEVER HOME, AND SHE WOULDN’T LISTEN TO ME WHEN I TRIED TO COMMUNICATE HOW TERRIFYING IT IS TO A FOURTEEN YEAR OLD WHEN AN AUTHORITATIVE FIGURE IS SHOUTING AT YOU FOR NOT BEING ABLE TO HEAR VOICES. \n\nto summarise, i was in a bad situation and i think i might of been depressed lol. \n\nbut the point of that tangent, i moved in with my dad because my mum wasn’t stable at the time.\n\nnow this may all seem irrelevant but this is probably the most important part, because at my dads he was lowkey concerned about my eating but like wouldn’t  straight up say it. like he accepted i wouldn’t eat breakfast because i said it made me feel sick. but his girlfriend (who was probably more concerned that him because i assume she gets what its like to be a teenage girl and wanting to lose weight to feel like we fit in), she would buy me food to eat after school (healthy food, but still food) and i always ate it because i have no self control and felt bad and didn’t want to disappoint them i guess.\n\nbecause my metabolism (i’m not a doctor i’m just making educated guesses at this point) wasn’t used to much food at all i put on some weight on my legs which pretty much brought me back to square one. the muscle that was no longer in use had now turned into fat and i was putting on weight. so now my legs weren’t even just big they were also JIGGLY FOR CHRISTS SAKE.\n\nmind you i still wasn’t even particularly fat, like i had a flat stomach, tiny waist, but big legs. i wasn’t fat, and i knew it, but i FELT fat.\n\nmy living arrangement and weight gain stayed the same until about may, by then i was visiting my mum on fridays to saturdays and she was becoming more stable. and my dad was getting an extension (which if you have ever had one you will know they’re a nightmare). so i had to go and stay with my mum for a while. by now my body was used to much more food that previously, i was eating two solid meals per day, but would also like binge eat a lot during the day. i tried to purge, but found out i have very little of a gag reflex when i’m in control, like i would literally sit bu the toilet with my fingers pretty damn far down my throats pressing hard on the back of my tongue and nothing was happening, i was pretty fucking devastated say the least.\n\nbut nonetheless i moved back into my mums house, planning to cut down on the food big time. but i couldn’t, and it was literally so heart breaking and frustrating to me. \n\nif you couldn’t tell food and weight was all i could think about now, and i knew it was bad.\n\ni would constantly tell myself, ‘okay next week only one meal like old times,’ and when i couldn’t control myself it would be, ‘okay no food at all next week,’ and i couldn’t do that remotely. i felt so useless, which made me feel so depressed and isolated. i think this is when i began to realise this was becoming a problem. i would begin to eat a food item and halfway through i wouldn’t  be able to eat it anymore because it made me feel disgusting.\n\nanother incident i would like to bring up is one time in the car when my mum offered me a biscuit, i declined, and she said with the most disgust in her voice, ‘why are you starving yourself,’ i cried about that like a week later, it hurt that she wasn’t at all understanding, like mental health isn’t something we talk about unless its hers. she proper fishes for sympathy all the time but when i try and help or offer support she shouts at me saying that i wouldn’t understand cause i’m a kid. that kinda sucked.\n\n\nanother quick incident, last month, for the first time in literally my whole life i wanted to talk about my mental health to my mum, i seriously thought (and still kinda think) i’m depressed, and i want to feel better. so i told her about what i was feeling and my thoughts on the subject, and bitch, let me tell you, the most invalidating thing i have ever experienced was (and still is) being told, ‘you’re not depressed, its just hormones,’ and yes. this may be true, but you don’t say that, i put myself in a vulnerable position (which was a big arse step) only to get dismissed.\n\nthe unhealthy body image continued till year 10 (age 15, now) in this past month things have gotten worryingly worse, last week i literally went on the biggest food binge ever, i mean PROPER BINGE, everyday for a week i ate until it hurt, physically hurt my stomach. and i think this because i grew 1 inch taller in a week (mad ik) but it made me feel so shitty. not only do i now have big jiggly legs, my stomach isn’t flat anymore, like it isn’t huge but it makes a big difference because i have pretty small hips so i kinda just lost my waistline and i look like a cereal box. it makes me feel so disgusting. most of all i’ve just had a week break for half term, so i’m scares that when i go back people are going to notice that i’ve put on weight.\n\ni think i want to cut down on food, like one meal a day, like i used to, and then slowly cut down more. idk i’m going to see how it goes, because as of now i’m more concerned about my stomach than my legs, but still, i want to lose weight.\n\nthanks for reading this long arse post, i just really need advice, or maybe just someone to say they understand, i just don’t want to feel alone i guess.", "subreddit": "BodyImage"}
{"post_id": "do72my", "created_utc": 1572259144, "title": "Are my horrible feelings about how “flat” i am valid?", "author": "crashband105", "self_text": "i am a 19 year old girl who currently weighs around 8 stone (about 50kg). i am a size 6 (i am from the UK) and 5ft 1. i have very big legs for my body (calves and thighs) and my boobs are small but there’s still a bit there, i am about a 28B. i’d compare them to the size of tennis balls, they fit perfectly in the palm of your hands. so basically, i’m small as fuck. i get called petite a lot and i quite like it. i’ve had men tell me they were mostly attracted to me for my small stature and build. however, this also applies to the bum department.\n\ni used to get bullied a lot when being “thick” became the trend when i was about 15. people would say i was built like an ironing board and post things on social media about how flat i was. i HATE my butt. like, despise it. it’s so flat and compared to the rest of my body it looks weird, almost caved in. people always tell me it’s fine and not that bad but truly it is. there is absolutely nothing there. i don’t have too bad of a relationship with my body but my arse is the thing i cant bear to look at. \n\nsomething that upsets me is recently, i tried to talk about my problems with my body, how horrible the bullying made me feel and how much it ruined my body image. when i mentioned how horrible i feel about my butt, i got basically told that that isn’t actual body shaming because i am a conventionally attractive skinny female. for once i felt like people would understand how horrible it’s been being told for years im flat and a “skinny bitch” but i just got told that it’s not valid because of my low weight. \n\nis this true? can i not say what’s happened to me is a form of body shaming? if i’m wrong then that’s fine really, i just want to know if the people who told me this stuff were wrong for saying so or not", "subreddit": "BodyAcceptance"}
{"post_id": "do9kbz", "created_utc": 1572272846, "title": "Think I look ok but anxious over how others will precieve me", "author": "peepocho", "self_text": "I'm not conventionally attractive. Before, I was trying my hardest to gain muscle so that I could sort of  sculpt myself to become conventionally attractive. It worked physically, but I wasn't  any happier mentally. Plus I was bloating badly day after day so food wasn't making me feel good. Now I'm underweight and very not conventionally attractive. I have broad shoulders, slim hips and a near straight waist.\n\nI think I look ok enough when I look in the mirror, but whenever someone is complimenting me or a guy is looking at me I just think \"They probably think I have a better waist or proportions than I actually have\". I tend to wear what I like but I feel like clothes are still covering up a lot of my figure. I find it hard to believe that no guy is going to be put off by me when I undress in front of them.\n\nDealing with this reality feels pretty hard for me. I'm trying accepting that I'll be seen as ugly by others.", "subreddit": "BodyAcceptance"}
{"post_id": "dohzhb", "created_utc": 1572308088, "title": "Body image books", "author": "GSS55", "self_text": "Hi all,\nCa anyone recommend any good books etc for body image acceptance?", "subreddit": "BodyImage"}
{"post_id": "doqs3i", "created_utc": 1572360148, "title": "Insecure about my body, especially my chest.", "author": "City-Of-Fear", "self_text": "I’m probably gonna miss out so much but anyways as the title suggest I’m insecure about my body. I’m female ,19, and have always been insecure about the way I look. But it’s gotten worse over the years due to abusive relationship, terrible friends , bulling ,my medical issues, mental health ,and autism. The thing I’m most insecure about tho is my boobs. My left boob is a 32 E but my right boob barley fits into a 32 D cup. So as you can see there’s a bit of a size difference, one hangs way lower than the other and not only that but they sag , and that’s partially due to the curve in my spine (scoliosis). Basically my insecurities about my chest have gotten so bad that every time I see boobs on a film or in a tv show, or on social media, I cry, so I’m reduce to watching kids films most of the time. When ever I get triggered I hide under my covers, or behind a cushion and I’ll cry for hours. I can’t look at my naked body in the mirror or I feel sick, I hate having to bath because having to touch my boobs makes me want to cry and throw up, I keep my shirt on when I’m intimate with my partner (which isn’t often due to all this) and I don’t ever let him touch them, I hide under covers to get dressed and undressed. \n\nTo make matters worse , I have a clothing issue which means I find it extremely uncomfortable to wear certain clothes, including bras, which means I’m never wearing one, which makes my boobs look saggier and just grosser.\n\nI honestly at this point don’t know what to do, I’ve struggled with mental health , self harm, suicidal thoughts for years and I’d been clean for almost a year really and now it’s getting to the point where all those thoughts are coming back and I just can’t take it, I spend 90% of my time crying and think about how much I hate my body, and I really try not to but it’s just always in the back of my mind ya know. \n\nSo like could someone just tell me what to do cause I really don’t know anymore? Sorry if this doesn’t make sense and for wasting people’s time.", "subreddit": "BodyAcceptance"}
{"post_id": "dor4eh", "created_utc": 1572361629, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "dos5kp", "created_utc": 1572366139, "title": "Advice for how to counter a friend’s negative comments about their own body?", "author": "instant_tush", "self_text": "I (23F) have a friend (22F) who very frequently oscillates between saying she feels good about her body one day and that she feels “fat and ugly” a different day. She’s making these comments about herself on posts she makes on her finsta account (fake instagram account;an account not connected to her identity for those who don’t know). She struggles with other mental health issues that she is also candid about, but I think she’s also struggling with body dysmorphia and may not know it, since she’s not actually fat, and even if she was that wouldn’t make her “ugly”.\n\n I am bigger than her, and although still fairly straight-sized, I’m kind of on the border between straight- and plus-size. I am also very comfortable in my body for the most part, but seeing these posts she makes about herself can sometimes get to me, and it also just makes my heart hurt for her that she is struggling with accepting her body and saying such negative things about herself. \n\nI don’t want to unfollow her, as she is a close friend and I follow her finsta to stay up to date on how she is doing in general, not just mental health stuff. I would really just like some advice or suggestions for things I could comment on these posts she makes or message her that would counter her negative body speak, support her and lift her up as a friend, while also not perpetuating the idea she has internalized that fat=ugly, bad, etc. As of right now, my tactic is to just kind of ignore the posts, which I realize is not great, but I am at a loss for what else to do.\n\nDisclaimer: I am not trying to single-handedly solve her body image issues. I know that is not my job and that she needs to talk to her therapist about this. I’m simply looking for how to support her as a close female friend. \n\nTL;DR: Friend makes negative comments about her body on social media, need suggestions for how to counter it/support her without perpetuating “fat=ugly,bad,etc”.", "subreddit": "BodyAcceptance"}
{"post_id": "dovn93", "created_utc": 1572380693, "title": "Uncomfortable sitting", "author": "creatureoftheniiight", "self_text": "I've always struggled with body dysmorphia. I've never been comfortable in my own skin. However, in the past month or two, I've become really aware of how my stomach feels when I'm sitting down and it's driving me insane. It's like I can feel every fold in my stomach and I can't get comfortable. I obsess on it and I feel so guilty every time I eat, but I can't deprive myself of food because I've already been there and I know it'll get out of hand. My therapist tries to help, but she just doesn't seem to understand where I'm coming from. Anyone relate? Suggestions?", "subreddit": "BodyAcceptance"}
{"post_id": "dp71f2", "created_utc": 1572443602, "title": "Sharing \"Embrace Your Individuality\"", "author": "JulieAMao", "self_text": "I cried. [3 mins](https://www.facebook.com/EvolveBlog/videos/1363519597162984/UzpfSTE0ODA0MTI4ODI6MTAyMTUyMDE2NTg3NDMwNDE/)", "subreddit": "BodyAcceptance"}
{"post_id": "dp80t5", "created_utc": 1572448108, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "dpbtsc", "created_utc": 1572465163, "title": "Insecure about my body , My entire body", "author": "SWAG39", "self_text": "I (18M) have keratosis pilaris skin condition which is basically having reddish , bumpy and rough skin texture all over your body and I'm very insecure about it . I've never had a gf and I'm about to go to college and I've always had that mindset that nobody would like me because of the way that my body look and the fact that it's appearance is ugly af. Is that a turn off for girls ? I feel like I'll never get a that I like .", "subreddit": "BodyAcceptance"}
{"post_id": "dpoun3", "created_utc": 1572534490, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
