{"post_id": "abisiq", "created_utc": 1546355110, "title": "Happy New Year!", "author": "mizmoose", "self_text": "###This New Year, embrace the person you already are.\n###Make resolutions that will enhance your life as a whole.\n\n\n\n**Resolve** to combat every negative thought with a positive one. \n\n**Resolve** to remind yourself that the mean things you tell yourself are words you'd never say to anyone else.\n\n**Resolve** to remember that just as you don't notice flaws in other bodies, others don't see flaws in yours.  \n\n**Resolve** to break the idea that foods are *good* or *bad* and must be rigidly restricted.\n\n**Resolve** to pay attention to what your body wants to eat, mindful of health and moderation, but without guilt and shame.\n\n**Resolve** to not use exercise as a means to make yourself feel bad, or as a punishment, instead of something that feels good.\n\n**Resolve** *(if you choose)* to find or continue exercise that makes you happy and is enjoyable. (If you want to start exercising, you don't have to start by going to a gym -- unless you want to!)\n\n**Resolve** to treat your body, your mind, your soul, your whole self, as you would treat anyone else, and as you wish others would treat you.\n\n###You are awesome just as you are and we're happy you're here.", "subreddit": "BodyAcceptance"}
{"post_id": "abiuah", "created_utc": 1546355529, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "abpmiq", "created_utc": 1546401637, "title": "How Can I boost my body confidence?", "author": "MorganPassager", "self_text": "I am at my final straw. I lost a ton of weight, got down to a medium, fell in love, and I look alright (think that statue with aphrodite that has no arms, with DD boobs) I know I have a symmetrical face. People tell me I'm pretty. I simply do not believe them. It's like I try, and no matter how much I try, my brain just cannot allow me to accept it. I just think everyone lying to me and they hate my body and face as much as I do.\n\n&amp;#x200B;\n\nI have tried. I have listened, I have thanked people for compliments, but I simply hate myself. I look in the mirror and I simply hate my face and my body. I cannot stand either one. Is something wrong with me? How can I boost my body confidence? How can I learn to love myself?\n\n&amp;#x200B;", "subreddit": "BodyAcceptance"}
{"post_id": "abu7fe", "created_utc": 1546441881, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "ac6jir", "created_utc": 1546528227, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "acc5ud", "created_utc": 1546560915, "title": "Dealing with different countries' beauty standards", "author": "anacat1331", "self_text": "I've seen plenty of body positivity in the US, but I don't feel fully comfortable among my own community and don't know how to. Somehow everything that American body positive bloggers post doesn't seem applicable to my reality and doesn't help me at all.\n\nI'm Brazilian, and in my city people go to the beach a lot. It's pretty nice how everyone, regardless of age or body type, feels comfortable wearing a bikini; I've seen grandmas wear things that would make some foreign girls blush. Still, standards here are pretty high. Everyone, regardless of gender, tends to work out a lot and holds their idea of attractiveness very high in their list of priorities. I work out and am in average body shape and weight, but I keep feeling like if I don't look like a carnival queen, I'm not attractive and am wasting my youth. Even though I'm not overweight, my lower belly fat and unimpressive butt often make me want to cry. With university stress, I just can't afford the time or money to become that level of fit, but also the idea that people here have of fatness in general is so deeply engrained in my mind that even researching body acceptance feels embarrassing to me. I feel like I'm obsessing over my body image too much, maybe at body dismorphia levels (haven't talked to a professional about it and I wouldn't dare to diagnose myself though, disclaimer).\n\nI've tried looking into the Brazilian body positivity scene but it seems so small it discourages me. Any ideas on how to start loving myself as I am now?", "subreddit": "BodyAcceptance"}
{"post_id": "acj1kl", "created_utc": 1546614796, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "acuvra", "created_utc": 1546701007, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "acv257", "created_utc": 1546702310, "title": "Diet Culture/Eating Disorders", "author": "Frostedeyes", "self_text": "As you all know, at this time of year, diet culture is everywhere, and it’s masked as so-called “detox” teas and unsustainable eating and exercise habits. Paleo, Atkins, WW, and the list goes on and on. Let’s not forget counting macros/calories/whatever crap! \n\nAll of this is marketed as “health” and “healthy” to do so, to the point that people will develop a cult like attitude with regards to “eating right” and exercising. These people tend to praise all and any kind of weight loss, even if they are already are ideal according to our society. But it’s never enough for them. They will exercise for several hours a week while eating like a bird and as little as medically allowed as possible. And if you gain weight or stay the same, no matter your size, they will shame you endlessly. \n\nAnd, as a result of diet culture, we brush over how deadly eating disorders are and how prevalent they are in society. Around 2/3 people who have eating disorders or behaviors of disordered eating are not underweight. If they are not underweight, and therefore, never seek help, the actual rate of eating disorders is much higher than we would like to believe. And diet culture is so toxic that even if suffers of eating disorders regain weight, they will be shamed and ridiculed for “gaining too much.” \n\nPeople, who fully embrace diet culture, are not in favor of health, but mostly, with arrogance, they prescribe to a notion that is false and damaging. ", "subreddit": "BodyAcceptance"}
{"post_id": "acv5it", "created_utc": 1546702992, "title": "Facial Scars; How they’ve affected your life and was acceptance easy?", "author": "OLD-AJTAP", "self_text": "[m18] Just over a year ago I was involved in a mountain biking accident that left me with 65 facial stitches and the replacement of several front teeth. \n\nA year on and the healing process has been good to me. Right now, I’m left with a jagged, faded pink line about a cm wide and a finger long spanning from underneath my nose. It’s caused the very top-right of my lip to curl a little which as an ex put, makes it look like I’m smiling slightly when sleeping. I’ve come to accept and love my new appearance and in my field as a bicycle mechanic, it’s something of a badge. \n\nI know for some however, it’s different story. After an accident or operation, looking into the mirror and seeing a near familiar face is daunting. To hold memories of ones face pre-scarring, to the process of slowly accepting what will now be the cover to your book is not easy. For a solid few months there it got pretty dark, something I’m sure is synonymous to all those having experienced something similar. \n\nSo that’s what I want to know! How has your life been living with facial scars, as minor or major as they may be? Has there been any take-away of living with a story permanently painted across your front? Was acceptance easy? \n\nThis is my first post here so I hope it’s all g and that my question thrown into the void gets a response! \n\n", "subreddit": "BodyAcceptance"}
{"post_id": "ad12r8", "created_utc": 1546740030, "title": "(27M) Skinny guys can be insecure too for the record", "author": "KidA508", "self_text": "I would just like to take a minute to speak on things from the opposite end of the spectrum.  I have been skinny my entire life. As a teenager it never really bothered me. But into my early twenties it really became a controlling factor in my life. It got to the point where I wouldn't even leave the house unless it was absolutely necessary. \n\n  I became so obsessed with my insecurities that I let it dictate how I would live my life. I would tell myself awful things. I would look in the mirror and not only be disgusted, but overwhelmingly sad as well. I honestly felt that no one was going to love me because of the way that I look and i actually believed it. I suppose to a point I still do believe it. I've done everything i can to change my appearance to be more pleasing for others. I went and got all my teeth fixed so that they are \"perfect\" now, I began spending an insane amount of time in the gym and would eat so much that i would be sick. I gained weight, got in shape, had a good smile, and here's the kicker...\n\n  It didnt change a thing about how i felt about myself.  This is truly an inside job. Its something that i struggle with on a daily basis. Changing our cognitive habits is more difficult than I could've imagined.  But I know that true acceptance comes from within as corny as it sounds. Theres nothing wrong with exercise and healthy living but dont do it to appease some sick standard that society has set. So for anyone struggling with BDD as I do I encourage you to not give up on yourself, and most importantly work on yourself from the inside out. \n\nTDLR: my main focus for this post was to share my experience with BDD from a skinny Male perspective.  I find that often times everyone thinks that skinny people are happy about being skinny but I'm here to tell you that it isnt always the case. ", "subreddit": "BodyAcceptance"}
{"post_id": "adit81", "created_utc": 1546875556, "title": "Meta Monday - What's on your mind?", "author": "GetOffMyLawn_", "self_text": "Happy New Year! Let's hope it's a good one.\n\nThe thread is open for all discussions: rants, raves, sanity, suggestions, whatever. Or post a pic of your cat. \n\n", "subreddit": "fatlogic"}
{"post_id": "aduw5e", "created_utc": 1546959137, "title": "STUFF't -- New 18+ plus size friendly Discord community ♥", "author": "nalliya", "self_text": "Hi everyone! I got the OK from mods before posting this.\n\nSTUFF’t is an 18+ community focused on friendships. We are a welcoming and fun community for everyone. NSFW content is not allowed, and we kick toxic people. All roles and channels that are not specifically for moderation or demographic purposes are visible and available for you to join. When we have enough people, we will do events (i.e. book clubs, gaming, giveaways). Although we are a community for plus size individuals, we are not exclusive. If you are looking for a new &amp; active community you can grow with, please join us!\n\nPlease do not hesitate to DM me if you have any questions.\n\n[https://discord.gg/WPsStFv](https://discord.gg/WPsStFv)", "subreddit": "BodyAcceptance"}
{"post_id": "adv2qv", "created_utc": 1546960213, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "ae7pee", "created_utc": 1547046677, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "aeiz28", "created_utc": 1547125655, "title": "How do I learn to just accept it?", "author": "damitschloe", "self_text": "Hey guys, hoping this is the right place to post! \nI’m a 20 year old girl that’s hated my boobs for as long as I could remember. I’m naturally slim (size 6/8) but did gain a lot of weight at one point when I was young which was then followed by a period of anorexia (Everything’s fine now!). The thing is my boobs slightly sag, have stretch marks and larger then average areolas. It messes with my confidence so much, I can’t even wear low cut tops because I hate my stretch marks and with the one boyfriend I had I always kept my bra on (he always told me my body was beautiful but I was his first so I didn’t believe him). I’ve thought about cosmetic surgery and there’s even this camouflage tattoo you can get to fill in stretch marks but I’m too scared to do all that. I do consider myself okay looking and get a fair amount of male attention but never take it far as I’m scared of it getting to the point of sex and then them seeing my body. So yeah how haveyou guys learned to just accept it and love yourself? ", "subreddit": "BodyAcceptance"}
{"post_id": "aeju6g", "created_utc": 1547133091, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "aewasv", "created_utc": 1547219605, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "aey4qp", "created_utc": 1547230360, "title": "Looking for advice..", "author": "hannah_burton13", "self_text": "Never posted here before but I’m looking for advice or just to see if anyone else feels what I feel. I’ve been heavy my entire life and struggled constantly with my weight. I got very sick at the beginning of last June and since then, I have been on several restricted diets and pretty much unable to keep most foods down. Because of this, naturally, I lost weight. Since June I’ve lost 85 pounds and I’m really unable to wrap my head around it. I’m going to continue to lose weight until I’m able to have surgery to fix what’s wrong with me but I figured I would at least be happy with myself now that I’m under 200 pounds and that hasn’t happened to me in god knows how long. Is it normal to still feel discouraged and unhappy with myself even though I’ve lost so much? ", "subreddit": "BodyAcceptance"}
{"post_id": "af86oc", "created_utc": 1547305828, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "afnb1f", "created_utc": 1547410529, "title": "How do you learn to love your body when it feels like 99 percent of the world finds it hideous?", "author": "SenMahogany", "self_text": "I've posted about this before in different forums but never here. I'm glad I found this forum. I'm sick and tired of hating myself and my body but I don't know how to start loving it. Unfortunately we don't live in a vacuum and what society portrays and what other people say does affect me. I've been called ugly all my life and my body type is not considered beautiful anywhere in the world. I have never had a serious boyfriend and haven't dated in years. I'm not asked out period. I have a very muscular athletic body type and am a size 8/10 depending on the clothing brand. Between a Serena Williams (who is always being criticized for her body and referred to as a man or other racist derogatory terms) and Jada Pinkett Smith(who is beautiful but I look nothing like besides somewhat body wise) body type. I am short with broad shoulders, narrow hips, knock kneed, dark skin and I have very stereotypical black facial features, Like if a racist was doing a drawing that's what I would look like; big eyes, big nose, big lips and no high cheekbones to speak of. And adult acne as a great bonus. I hate my facial features, body and body type; there is nothing considered \"feminine\" about it. On top of that I have these horrible knock kneed legs that make me look so disproportionate. No one finds knock knees attractive and I feel so uncomfortable wearing shorts or skirts. I am working out but no matter how hard I do I can not change genetics or bone structure and it gets me very depressed and think why bother. So I am wondering if anyone has a similar body type and even if they don't if they have any advice for learning to love and embrace it.", "subreddit": "BodyAcceptance"}
{"post_id": "afw2kl", "created_utc": 1547474475, "title": "Anyone else with strabismus?", "author": "ClearBlue_Grace", "self_text": "Hello everyone. I’ve had eye problems throughout my entire life. I was recently diagnosed with Klippel-Feil, and strabismus is one of its associated conditions. I’ve had several eye surgeries throughout my life, and according to a lot of people, my eyes look fine. I was told by my eye doctor at my last appointment a few months ago that “I bet no one can tell that you have strabismus just by looking at you”. I don’t know if maybe my mind just doesn’t see the improvements or what, but I still have a very hard time making eye contact, or letting people take pictures of me. I can take pictures of myself okay but I really have to focus on how to position my eyes so they don’t look derpy and ugly. It’s like just because they apparently look fine, doesn’t mean the psychological effects it’s had on me all these years is just going to disappear. I just feel like my eyes look so derpy and wonky all the time and it always puts a major dent in my confidence. I was just wondering, who else here has strabismus, and how has it affected you emotionally? I feel like I’ll never like my eyes and it makes me really sad. A lot of people put importance on making eye contact with people either for professional, or romantic purposes and I feel like because of that I’m not going to succeed in either of those things. ", "subreddit": "BodyAcceptance"}
{"post_id": "afxbr2", "created_utc": 1547482526, "title": "Award Ceremony: Best of r/fatlogic 20118", "author": "maybesaydie", "self_text": "The Gold Train has arrived, we've hijacked our share and without further ado bring to you your winners.\n\n\nThanks to everyone who submitted nominations. A Participation Prize is coming your way.", "subreddit": "fatlogic"}
{"post_id": "ag9fi0", "created_utc": 1547565005, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "agm1qd", "created_utc": 1547651466, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "agyoez", "created_utc": 1547737846, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "ah8uur", "created_utc": 1547804425, "title": "some fat logic from Withings", "author": "CADEYRN437", "self_text": "&amp;#x200B;\n\nhttps://i.redd.it/kduutg1j07b21.png", "subreddit": "fatlogic"}
{"post_id": "ahbecy", "created_utc": 1547824391, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "ahmtm2", "created_utc": 1547910597, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "ahtox1", "created_utc": 1547954467, "title": "Cellulite", "author": "haklana", "self_text": "How do people really feel about cellulite ? I'm an 18yo female and all my weight goes to my thighs and butt, so I have it in those places. I only weigh 117lb though ? I've been really insecure about it for a couple years, I get so paranoid to wear shorts or anything showing my legs because I feel people look at it. ", "subreddit": "BodyAcceptance"}
{"post_id": "ahvkrd", "created_utc": 1547971309, "title": "Body hair?", "author": "loijay", "self_text": "I kind of like my body hair but I am currently quite dedicated to my razor. I've thought about getting IPL or taking more drastic measures to have it permanently removed, but for some reason that idea makes me sad ? Partly because it's caving to societal pressures, partly because it's permanent, and partly because I have some sentimental attachment to the idea of 'natural' things.\n\n&amp;#x200B;\n\nDoes anyone else have this strangely conflicted relationship with their body hair?", "subreddit": "BodyAcceptance"}
{"post_id": "ai1u8t", "created_utc": 1548015550, "title": "Amazing what just talking about stuff does...", "author": "Cae22", "self_text": "The other day, I (20f) looked in the mirror and started crying at what I saw. Flat chest, but big lower half, cellulite, etc., so I talked to my bf (21m) about it. I expressed that sometimes when I have sex, I think of how ugly I am and get out of \"the mood\". He was incredibly kind and understanding and reassured me that he thinks I'm beautiful and sexy. He suggested we don't have sex until I feel ready and confident enough to, but I didn't want that, so I decided not to let my mind win....\n\nThe next day, I was feeling good. I actually ate and did some shopping. I bought my first piece of lingerie, which was a huge deal because the last time I tried shopping for lingerie, I ended up crying and leaving with nothing. I surprised by bf with it and he was proud of me. I was proud of myself. \n\nMoral of the story: don't let your negative thoughts win!", "subreddit": "BodyAcceptance"}
{"post_id": "ai5qsw", "created_utc": 1548040252, "title": "Hip Dips - what exactly are they?", "author": "haklana", "self_text": "I have hip dips, but where do they come from and can they be 'fixed' by working out ? \nI'm not sure if they come from lack of exercise, or if it's simply just shape or bone structure? \nI compare myself way too often to other females, and I wish I didn't have the dips.. ", "subreddit": "BodyAcceptance"}
{"post_id": "ai9kto", "created_utc": 1548072968, "title": "Small boobs.... extremely depressed", "author": "wheeldojo", "self_text": "very day without a doubt I look at myself in the mirror with complete dispise. I have absolutely no boobs. I mean flat as a mf chopping board. \n\nIn high school I tried everything from the massages to the oils to the bras. I thought that by this age, 20, I would grow at least something! \n\nWith time I've grown more and more bitter and angry with myself. I get extremely jealous of other women. I cant go swimming or find good clothes. Overall it's such a drainer on my social life and my confidence. It makes me severally depressed and some nights I just look at my self and cry.\n\nI've been with my boyfriend for a year now and I have never had sex with him without my shirt off. I'm so embarrassed... he doesn't even make the effort to make me comfortable by trying t take it off it the act. I've spoken to him about plastic surgery and ofc he doesn't like the idea but I'm really considering it.\n\nI just want to feel happy with myself.. I cant see myself getting over this. I get by using padded bras but I hate them.\n\nI think what I'm asking for here is... is it worth seeing a therapist? Will this go away with time? ", "subreddit": "BodyAcceptance"}
{"post_id": "aibl2m", "created_utc": 1548087350, "title": "Meta Monday: Casual Conversation", "author": "maybesaydie", "self_text": "Today we're doing something free form. Ask questions, brag about your progress, complain about the weather, talk about clothes, ask the mods questions-whatever you'd like.\n\nPlease, no politics.", "subreddit": "fatlogic"}
{"post_id": "aiioq8", "created_utc": 1548128053, "title": "Help/Tips", "author": "haklana", "self_text": "Are there any tips or things that have helped you all accept and love your bodies? I've had body image issues for a long time and it's so emotionally exhausting dealing with them, idk how to love myself. ", "subreddit": "BodyAcceptance"}
{"post_id": "ailib8", "created_utc": 1548152261, "title": "Got my head shaved for medical reasons and I don't want to show myself in public", "author": "ScaredRefrigerator", "self_text": "Always had long hair to cover up the excessive width of my face and my nonexistent collarbones. Always had bangs to frame my features. But then I got a halo brace and doctors said that there was no option but to shave my head (even though people don't usually have to, according to Google images) and I can't even wear a wig because of pins sticking out of my skull and holy cow I look so fat. My shoulders, my face and my neck.\n\nI feel so bare and exposed it's almost vulgar. How long is it going to take for it to grow to even ear length? I know there's a saying that if someone doesn't like you just because your hairstyle changed they never really liked you, but I freakin hate myself right now.\n\nI don't want to see my extended family. I don't want to see my friends. Will they laugh? Pity me? Or maybe save a horrendous photo and grace my eyes with it ten years down the line for the shits and giggles under the guise of 'look how far you've come'. I'm tired of people asking what happened. Would be nice to sit tight in my room and wait for it to pass, no?", "subreddit": "BodyAcceptance"}
{"post_id": "ainqas", "created_utc": 1548169835, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "aiosm2", "created_utc": 1548176182, "title": "I need some advice and guidance please", "author": "asabrow", "self_text": "I've fallen out of love with myself. A love that took a whole decade to build and now it's gone. I don't know where I went wrong, I don't know where to pick up from or how to move on from this. I've completely forgotten how depressing hating yourself can be. If anyone's been through this please let me know how to fix this, it's been so long that I've forgotten which way to go from square one. -A", "subreddit": "BodyAcceptance"}
{"post_id": "aiu4gi", "created_utc": 1548205987, "title": "I'm a small scrawny ugly stupid worthless \"man\" and I don't know what to do.", "author": "Mayo_Tayo", "self_text": "I'm 18m 145lbs and 5'9\". I know I'm average height for amab but everyone still makes fun of my height especially cuz I'm in north carolina which is taller on average. I do identify as male but I don't feel like enough of a man to really call myself that. I was born with type 3 RTA and miraculously outgrew it at 8 so my growth was stunted. I feel so insecure and weak and like no matter what I do I will never be wanted or sexy or anything like that. How do you fix this? How do I get bigger? How do I become comfortable in my body? I am so sad and I don't know what to do. I literally don't like any physical feature I have and sometimes when I look in the mirror I almost don't even recognize myself. I also have depression and am medicated with effexir and lithium. Please I need help I am so desperate.", "subreddit": "BodyAcceptance"}
{"post_id": "aixghu", "created_utc": 1548230175, "title": "Body image issues in gay culture", "author": "dat_boi_dreadkn0t", "self_text": "Hiya! So I (20m) have been struggling with my body image for quite some time. Media has shown me that if I don't have the \"adonis factor\" finding a partner will be impossible.  Of course that's irrational to assume but I can't shake the ever looming pressure to have a perfect body. What actually is accepting myself? I needed to get it out bc this question bounces around in my head constantly.", "subreddit": "BodyAcceptance"}
{"post_id": "aj0mmo", "created_utc": 1548256294, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "ajdbth", "created_utc": 1548342656, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "ajdkvn", "created_utc": 1548344182, "title": "Obese after anorexia", "author": "sunflowey", "self_text": "I grew up slightly overweight, and it got to me so much that once I started dieting it became an obsession and I slowly fell into eating disorders. After being OSFED for a few years and going to a psychologist supposedly specialised in EDs, who basically made me understand that at 19 of bmi i was too fat to have an ED, I obviously ended up falling into the spiral of anorexia nervosa. I reached 12 of bmi, almost died, it made me drop out and lose my friends, my boyfriend at the time and everything, but after lot of therapy, antidepressants, and seeing nutritionists and psychiatrists all the time I somehow got over that ED. I started eating. Well, I started binge eating. The first three months I gained 20lbs a month. Then 10lbs a month. Then I managed to slow down and now I maintain and eat normally I guess, so I'm already happy about that achievement.\n\nBut now not even one year after the end of my anorexia I stand in the obese category. And it hurts so much. Doctors keep telling me to lose weight and give me their so called diet advice (which I know sucks because I have so much more knowledge on the subject). My mom fat shames me every time she sees me, thanksfully I moved from home so she only does during the holidays but it hurts so much. Everyone and their son tells me how they are \"worried\" about my \"health\". No one was ever woried about my health when I was at an healthy weight but couldn't sleep at night and spent all my time counting calories. Obviously they just think being fat is bad. Which I don't think is overall. I follow lots of body positivity instagram accounts and there are so many fat girls I think look awesome but I still can't seem to accept myself and everytime I think I made an achievement in that regard someone has to come criticise my weight.\nI don't want to diet ever again because I know that if I start I'm just gonna go back to disordered eating forever, and I don't understand how doctors specifically told I have an history of eating disorders and severe anorexia can even be allowed to suggest dieting to me.\nWay too often, I'm seeing my mind consider I should either die or lose 65lbs.\n\nI know I'm not the only one in that case and plenty of recovered anorexics end up obese but how the hell do I cope with that. I'm already so stressed about my studies and so many other things and wanting to cry when I see myself in the mirror doesn't help. I know my body image is still way better than when I was anorexic but it still is really painful.\n\nI just made an account to post that because so many people know my normal username and I don't feel comfortable with them seeing that.\nI've read the rules and I don't think I broke them but if I did or if that kind of post is not allowed please let me know.", "subreddit": "BodyAcceptance"}
{"post_id": "ajkniu", "created_utc": 1548385472, "title": "Hi, new here. I am a 35 year old woman with a history of ED. I’m afraid I’m relapsing due to difficulty accepting my new, post baby body. (Crosspost ED)", "author": "MadamPotpourri", "self_text": "It’s been 9 years since the worst of my ED/orthorexia. At the worse I obsessively calorie counted and exercised, which would flip flop into binge cycles. It lasted about... 3 years? \n\nI had a period of calm but then I was lucky enough to birth the most wonderful babies on the planet (I edited out “beautiful” because I’m trying my hardest not to unconsciously suck them into my bullshit.) Unfortunately, it has wreaked havoc on my body dysmorphia. \n\nI tried to go at it “smart,” just get into some fitness apps and some “safe” diets. Hahaha! After two months I could feel myself slipping into dangerous waters. \n\nObjectively, I know what I would tell my daughter if she was in this position (I pray she never, ever is, another reason I want to nip this in the bud), but it’s so hard to tell my inner critic. Never thin enough, always looking at food like a trap. Constantly poking and prodding myself in the mirror.\n\nI’ve cut the triggering habits like apps and fitness forums, cut way down on pressuring myself to eat or exercise a certain way. But I can’t stop the voice in my head that’s constantly grading me, whispering to me to put xxx food away, or to go ahead and cram it all in my face cause it’s a lost cause anyway. \n\nYes, I’ve been to therapy before, it’s not practical just this moment because I just quit my toxic job (and it’s sexy health insurance) and logistically it’s tight. Yes, I have considered online therapy and will probably pursue it once I can get my new work situation in order.", "subreddit": "BodyAcceptance"}
{"post_id": "ajlrhw", "created_utc": 1548393340, "title": "Stretched and saggy breasts 22f", "author": "LaterallyMi", "self_text": "I have the saggiest boobs ever. I’m 22, lost about 70 lbs and still going. Went from like a 36/38G+ to now a very very skin-saggy 34DD. No way my breast fat is actually that much- I just need that size so no skin sticks out.\n\nI am trying to be okay with this. Accept it as my body. But I’m so young and have good sex to be had and I feel so often like I can’t let anyone see them. 2 men have and they were ~okay with it- one truly didn’t care and the other did make comments but truthfully I find them warranted- my boobs are SO saggy and stretched out. \n\nI want to accept it, I really do. But I feel like the only girl my age that can’t have cleavage out. Or wear a bathing suit top. I need to accept it. It’s just so hard. No one else my age has breast THIS saggy. ", "subreddit": "BodyAcceptance"}
{"post_id": "ajpyif", "created_utc": 1548429210, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "ajxoc6", "created_utc": 1548476641, "title": "I find myself ugly", "author": "almond_ale", "self_text": "I understand that other people may not find me ugly, and some people have told me I am pretty, but *I* find myself ugly. I can't imagine how anyone can look at me, because I find myself repulsive. It's something that never really made sense to me, because it's as if what I see and what others see is completely different. It's very hard to be in this body most of the time.", "subreddit": "BodyAcceptance"}
{"post_id": "ajzphh", "created_utc": 1548497145, "title": "My body doesnt respond to food the way it should and I need advice how to look past it to learn to love my body more", "author": "mearaowl", "self_text": "Im not sure how I can best explain what the situation is, but i’ll try my best. It comes down to me having (had) an ED, my body not responding to food as it should (gaining weight when eating less than average) and not being believed by a lot of professionals, despite proving them during therapy that it really is the way my body reacts (they monitored my food intake and saw the scale). Its been hard to stand by my story and I have lost a lot of confidence while still having issues with how I see my body.\n\nThe story:\n\nI have had an eating disorder since I was 9 years old (currently 21). I have started treatment a year ago, which ended a month ago or so. During the years when I suffered the most from ED I starved myself to the point there were days I didnt eat at all, never bingeeating to compensate, just if anyones wondering.\n\nThing is: i have never been underweight like most people with my lifestyle would. When I started treatment and explained the way I lived for so long, my therapist did not believe me when I said that I ate like that and never really lost weight. I actually gained 30 kilos (66? pounds?) at my worst.  I know that should technically not be possible and some dieticians I spoke to when I was trying to lose weight told me that it could be hormonal issues or “starvation mode”, which people now think is a myth. When my therapist didnt believe me I felt not taken serious, as if I had just convinced myself that I ate too little, while I did not like my body, just to avoid real dieting. I KNOW what I ate during those years, because that was my entire problem, being obsessively about restricting food intake for more than 10 years. Anyway, I tried to move past my therapists view, and really tried to focus on getting better and getting a better relation with food, so i was no longer terrified of it.\n\nTherapy has ended and I am now able to eat a little more normal and I am really trying to make progress with starting to love my body more. It stopped because I was doing considerably better, but Im still not there yet.\nWhat I now struggle with is that I am now gaining even more weight when eating more (still not even “normal people level” and Yes, i eat healthy and exercise). I get anxious because I am so afraid of still putting on more, and I dont know why that happens and what I can do to stop it (my doctor just says Its probably just stress or something and that I should wait it out, but Its really hard to just do nothing when it in itself produces a lot of stress)\nIt gets in the way of my focus of improving acceptance to my body and to love my body more. \n\nI would like to know how I can try to look past my gaining weight and what I can do to care a little less about people (professionals) not believing i have (had) an ED where I starved myself. It has just been so awful having to explain myself over and over and not been believed when I was so fragile. I have moments where I fall back in my old eating pattern, because I hope that this time I will actually really lose weight (instead of gaining like in my last ED episodes)\n\nI dont want that, I just want to start loving my body no matter what diet and what people assume. I would love to hear how you think I could try to start getting a little confidence back.\n\nI know my story sounds fake, that there will be people reading this thinking I made it up to convince my overweight body that Its not really my fault that I am gaining weight etc. \nIts not what Im asking: you dont have to understand, because i dont either. I just want to know what I can do under these circumstances that can make me love my body more. I need support, not critics\n", "subreddit": "BodyAcceptance"}
{"post_id": "ak1ltu", "created_utc": 1548515415, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.\n", "subreddit": "fatlogic"}
{"post_id": "akj2lh", "created_utc": 1548644111, "title": "Body negativity post-surgery", "author": "pacifisht", "self_text": "I had a surgery about 4-5 months ago on my knee and was on crutches for about 3 months and am still at low activity. \n\nI am really struggling with my overall appearance and body acceptance now, which is something I didn’t suffer from greatly even when in middle/high school. I gained about 25 lbs being sedentary for so long and a good majority of clothing doesn’t fit anymore which is quite disheartening. I used to be a competitive swimmer and was pretty in shape, so going from that to this while still in what’s made out as “my physical prime” is rough. \n\nAnother issue is that my thigh muscle essentially disappeared in the surgical leg as there was a gap between injury and surgery and due to some nerve damage, it’s taken a while to gain back. It’s super noticeable if I wear old pants, as my calves/thighs are different sizes and clothing is either baggy/tight depending on which leg it is, which isn’t just uncomfortable but also a reminder that I have funny legs now\n\nI want to drop that weight and such to lessen strain on my knee, but it’s been a struggle doing that within my limits recently. I just wanted to share how I felt with someone as everyone around me says “oh it’ll come back!” Or “you look the same to me” (which I know is true to some extent) but won’t help me talk through these feelings. \n\nTLDR: broke my knee and now have weight gain and muscle loss insecurity following surgery ", "subreddit": "BodyAcceptance"}
{"post_id": "akop71", "created_utc": 1548690705, "title": "Meta Monday: Questions?", "author": "maybesaydie", "self_text": "Do you have complaints, compliments or issues that would benefit from the input of our crack team of mods? Want to yell at us about something? Do you have questions for members of the community? Avail yourself of this opportunity.", "subreddit": "fatlogic"}
{"post_id": "al0wim", "created_utc": 1548774608, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.\n", "subreddit": "fatlogic"}
{"post_id": "aldl3y", "created_utc": 1548861083, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.\n", "subreddit": "fatlogic"}
{"post_id": "alfhlr", "created_utc": 1548871641, "title": "Need help (again) appreciating my slim figure (26f)", "author": "drunkdadalert", "self_text": "My whole life I’ve been bullied for my figure. Im very slim and have very small boobs. There was a point in my life where I hated HATED the way i looked to the point of suicide ideation. That didn’t really change until i was 23. I was doing pretty good in the body confidence area until just last week. \n\nI had a person, whom i considered a good guy friend, just completely rip me down. Im the type of girl who is vulgar, and I can take offensive jokes quite well so people love pushing my buttons to get a reaction. Well this MF is known to make jokes about my body, i let it slide a couple times because im sure he doesn’t realize how sensitive i am based on my tough exterior. Well the last time he made little boob jokes, i told him its really fucked up and i draw the line there. I thought he understood that but then i hit my breaking point. \n\nIn about four hours time he managed to make jokes along the lines of “oh dont you want to upgrade to at least a handful and a half? Ill buy your tits for you” 3 times in four hours. I finally lost my damn mind and went full rage mode..i was ready to strangle him. \n\nIt was so triggering to me that I haven’t felt good about myself since then. Now i look in the mirror and just see a hideous, skinny twig. Logically i know i look good but my lifetime of insecurities are stronger than my logic by a long shot.\n\nHow do I pick myself back up again? I just want to feel good about myself and love my body, but it seems that no matter what you look like someone is going to try and tear you down. How can i let my logic prevail??? ", "subreddit": "BodyAcceptance"}
{"post_id": "allm6s", "created_utc": 1548907946, "title": "I can’t stop being anxious about myself", "author": "BABB00", "self_text": "First things first, I’m a TWIG. My legs are  basically the same as my thighs, I’m flat, no butt, and I’m convinced I’m ugly. I’m young, yeah, but I don’t want any of the “oH yOuRE sTiLl gRiWiNG B.S. and dont get me started of the oH bUt yOuRe lUXkY yoUrE sKiNnY. basically every girl but me has SOMETHING. Even confidence. I have nothing. Except my pErsOnAliTY, which is the biggest ego crusher ever. I have GAD, SAD, and depression from genetically my moms side. I was misdiagnosed a lot when I was little and I was REALLY malnourished since I had undiagnosed/untreated gastroparesis. And one of my friends told me, “well you can’t just change your body shape that’s like telling a black person how they got black! You’re born with it.” And I’m scared this is true. I don’t want to be a stick. I’m extremely self conscious and it’s worse in PE where we have to wear shorts and everyone but me has thighs. I’m a bony twig with no hope and after months on months I’ve come here finally. Please help me I don’t know what to do", "subreddit": "BodyAcceptance"}
{"post_id": "alqdt3", "created_utc": 1548947498, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "aluryc", "created_utc": 1548971864, "title": "Tips to feel more attractive? Easy ways to boost my self esteem?", "author": "AlwaysBoredAndHungry", "self_text": "Lately been feeling unattractive and just not pretty and I know looks aren't that I important, but I want to feel attractive. Any tips from fellow ladies to boost my self esteem?", "subreddit": "BodyAcceptance"}
{"post_id": "alvdxv", "created_utc": 1548975373, "title": "Lose Skin After Weight Loss a Couple Years Ago.", "author": "zerocaffeine", "self_text": "Hello there, \nMy first time posting on this forum and have came to the realization that my struggle is valid (beat myself up about not being worth the time). \nA little of two years ago I fell into the worse time in my ED and lost a good 70 pounds. At the time I guess I was too caught up in the fact that I reach a goal weight and shrugged off the skin that was left behind. Now that it’s two years later and I’ve been lucky enough to have maintained the 160 pounds, give or take ten or so pounds.  \n\nLately, I’ve taken a heavy obsession over this skin. I feel like it’s all anyone sees when I’m out. I have cellulite, and sadly it’s hereditary. The skin is the worst around my rib cage, lower sides, and inner thighs. I just want to be able to go outside and not fixate my emotional and mental time on this. I don’t go a waking minute not thinking about how gross I must look. I’ve looked into surgery, and even consulted my doctor, but he said I don’t meet the requirements - sadly never will. I also exercise pretty routinely and focus on toning, drinking a shit ton of water, etc. \n", "subreddit": "BodyAcceptance"}
