{"post_id": "bvltjs", "created_utc": 1559402047, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bw88z6", "created_utc": 1559549845, "title": "MetaMonday: No Stupid Questions", "author": "maybesaydie", "self_text": "June is upon us. Take this opportunity to ask the community any questions you may have about weight loss, fitness and general wellness.", "subreddit": "fatlogic"}
{"post_id": "bwb8ml", "created_utc": 1559571916, "title": "Reddit &amp; Body Acceptance", "author": "jules_rules17", "self_text": "Is Reddit a place of body acceptance to you? I recently joined, and I’ve been finding a lot of fatphobia here. \n\nA little background: \nI’ve been more of an Instagram user, where the algorithm and what/who you follow really seems to set the tone of the feed. Here, it seems there is no escaping the fatphobia/body mod pushers. Am I alone in these feelings or experiences?", "subreddit": "BodyAcceptance"}
{"post_id": "bwebkr", "created_utc": 1559587641, "title": "Looking for advice on how to speak to my inlaws about their body shaming and how it might effect their children.", "author": "CityoftheMoon17", "self_text": "I recently went to my inlaws and up on the fridge was a piece of paper with their names (mum, dad, son, daughter) alongside starting weights and columns for weekly weigh ins. My husband has spent years speaking with councilors about his body dismorphia and was pretty badly triggered after seeing it. We were both so blown away we didnt know what to say to his parents.\n\nHis sister is only 14 and at an age where she should be learning to embrace what her healthy body can do. It breaks my heart hearing her say she CAN'T become a dancer anymore because she is overweight, which is not the case! My brother-in-law is 18 and wants to gain muscle but hes not 'allowed' to gain weight which is also pretty sickening to hear. After looking at their weights, none of them are even overweight! Its purely down to the fact they aren't accepting of how they look! I suspect it is more my mother-in-law doesnt accept the way she looks and is projecting onto everyone else.\n\nHow do we approach this sensitively so they can begin to understand the potential harm it may have on their children and how to begin educating and understanding body acceptance?", "subreddit": "BodyAcceptance"}
{"post_id": "bwpth0", "created_utc": 1559661071, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bwwinc", "created_utc": 1559695892, "title": "Only 23, feeling unworthy and different in this body after weight loss. These horrible thoughts follow me everywhere. How to make sense of it all and live a meaningful life despite not feeling good in my skin?", "author": "babypeach_", "self_text": "Warning: This post is pretty damn negative and I don't want to make someone in a similar situation feel shittier. The reason I'm writing is because I realize my experience is not helpful or healthy or  based on accurate assumptions, but despite this, I still struggle. And I'm hoping someone has a recommendation. I see a therapist who is extremely helpful and I take anti-anxiety medication. I don't exercise regularly and I don't meditate even though I want to be a person who does both things. My life is generally a mess right now (recently out of a long-term relationship, failed out of college, dysfunctional family, poor) so this fixation on my body is definitely being exacerbated by it.\n\nHi. 23 F, shouting into the void because I feel trapped in a body whose mercy I feel tirelessly at. Sorry for the stream of consciousness. I'm suffocating.\n\nI'm really struggling right now and hoping to find someone else who relates because I feel so alone. A lot of posts on here are about people concerned with their size, which is something I currently — for the first time in my life — actually feel less worried about because I've lost some weight, but I relate to it. I'm tall and I guess somewhat slender now. 5.9 and 137 pounds. My highest weight was 170, my \"normal\" weight was around in 150. I've basically fluctuated with the wind my entire life, and it just so happens I'm thin now because I'm a poor struggling student and have no money to buy food. So it's not like I really earned anything.\n\nSometimes I wish I could go back to just wishing I was skinnier, because change was always possible, rather than having permanent changes that only MAYBE surgery could fix. (Or maybe it's just because I have other, more troublesome things that I've been obsessing over: my skin. My stretch marks, which are plentiful. My tits, which hang low now and are loose.)\n\nI can't look in the mirror anymore. I've always, always had poor body image. When I was 5, I asked my mom if I was fat because my little tummy bulged like 5-year-old bellies do. I discovered my \"hip dips\" at 11, and stared at them in the mirror wishing they'd go away. If I looked a little longer, I thought they might. At 13, I developed an eating disorder that would last through high school. My face was routinely shoved with food, then in front of a toilet. I watched pounds trickle off when I had weeks of self-control, then I'd watch them flood back in the moment I couldn't stop thinking about binging. I dreamed about the life I would live when I finally got skinny. The person I would become. In these fantasies, I was someone different. Not just thinner, but a different body frame. Different face. Different self. So I realize that my poor body image is deeply rooted in a floundering relationship with my self and my self-worth. My parents were largely absent in my teenage years. My mom died when I was 6, so I didn't have her as a role model. My borderline step-mom led me to believe that my experiences were ultimately silly, and that I was an idiot, an ugly and fat. I had no self-esteem. My dad told me, when I was 17, that I had the body of a 30-year-old. So they definitely didn't help.\n\nI feel stuck in skin I can barely stand to look at. I can hardly look in the mirror. I'm having a very hard time accepting that this is my body now, when my former body feels so close but so far. I used to inspect myself before showering when I was younger, yeah maybe wishing certain areas were smaller but feeling overall okay with how things looked. I still felt worthy of a lover, I wanted to be seen naked, I could look at my bare body and feel good.\n\nNow, I guess from weight change, my thighs are literally covered in white, deep and thick stretchmarks. It used to be my favorite part of my body, like my upper thighs. And now there's stretchmarks basically a quarter of the way down my thighs, and halfway around. They're like several inches long, and overlapping, and the texture is just totally different. I can hardly stomach looking at them some days. It doesn't feel like my body. My ass is smaller and again covered in stretchmarks. Like there's grooves, it's not just lines. And they go up my hips and towards my back, another area I used to love.\n\nMy boobs are a whole other beast. I've always been self-conscious of how they're not perky, they're looser, my nipples are wider. But after weight loss, they got smaller and just deflated. The skin is stretched, crepey and wrinkles in my bra. And they're saggy as shit. I just feel horrible looking in the mirror, despite looking decent when I'm in clothes. I used to love being naked. I want to love being naked again! I've always held out hope that plastic surgery could help them, and I even saw a top-rated plastic surgeon in my city last week for a consultation. (I'm very willing to go through surgery if it means a better experience in my skin). He told me there wasn't much he could do based on the anatomy of my tits. They're not quite deflated enough that he felt it was worth the money and scars, and implants wouldn't help.\n\nI sat in my car and just cried. Not even a plastic surgeon could help me, and stretch marks can't be fixed either. At least weight is changeable, I just feel absolutely stuck now. I can't picture myself being vulnerable with someone else. I don't want to be in my underwear around my friends, whereas I used to be teased for being super open with my body. I couldn't take off my bra during sex with my ex-boyfriend, and now that I'm recently single again, I'm struggling to imagine someone choosing my body over some other hotter 23-year-old's. Why am I going through this when I'm so young? I want to enjoy my body. It feels like I've had kids and this is my post-baby body when I haven't. Why are none of my friends going through this? Why do I have to feel this way, when I have a slew of other issues I need to deal with? I literally called out of work today because I felt so run down by this negative experience with myself.\n\nI'm constantly comparing myself to other people. When I see someone, I immediately imagine them naked (not in a sexual way), and picture their smooth skin and normal tits. I'm not an idiot, I know most people don't have tight perky boobs and perfect bodies, but I still feel like their flawed bodies are better than mine.\n\nI feel inherently apart from and less than other people, because of my body and other things. I'm scared of missing out. I'm an incredibly aesthetic person and feel inspired by beauty. How can I live an enjoyable life if I no longer enjoy this vessel carrying me? It feels like because of these changes, I can't do certain things. I can't have afternoon sex with the daylight sun on me because it makes my stretchmarks more noticeable. I can't have a hot stranger take off my dress and have steamy, random sex. I can't go swim in the river the way I used to. I can't go braless, ever. I feel like self-care isn't worth it, grooming myself isn't worth it, planning for my future isn't worth it because my body is just going to continue to get uglier.\n\nI know all these things are not objectively true, and they might seem vain or whatever, but it's the most painful part of all: not feeling free in my body any more.\n\nWhat is the point of this all if I can't enjoy my own body? It's making me feel like my life isn't worth living.", "subreddit": "BodyAcceptance"}
{"post_id": "bx3omb", "created_utc": 1559747564, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "bx5f6k", "created_utc": 1559756399, "title": "Tip: See others how you want to be seen", "author": "Emma2181", "self_text": "Something that has helped me be a lot more accepting of myself is to look for the beauty in others. A common strategy to try to feel good about yourself is to put others down and compare yourself favorably, but because we assume other people think like ourselves, this strategy backfires because we think people are constantly judging us harshly. \n\nWhen you go around thinking everyone is beautiful, the world in general seems like a more accepting place, and it feels much better. This is what has worked for me, but it does take some conscious re-wiring of old thought patterns. Hope this helps someone!", "subreddit": "BodyAcceptance"}
{"post_id": "bx70nc", "created_utc": 1559764265, "title": "Hey turns out all female models/celebrities are skinny men, and they have always been skinny men. Please share around if you like. Both of these channels have alot of this content.", "author": "UrAbaTTery", "self_text": "All celebrities, media, politicians, they can do it to the baby in utero, out comes male body structure, female parts and vice versa. You can ignore the religion speak as it's just as fake as these women. They've been doing this TO you intentionally, the entire time.\n\n[https://www.youtube.com/watch?v=99L1fgTirII](https://www.youtube.com/watch?v=99L1fgTirII)\n\nHow its done \n\n[https://youtu.be/-m59i6XUsq0?t=1](https://youtu.be/-m59i6XUsq0?t=1)", "subreddit": "BodyImage"}
{"post_id": "bx8o5s", "created_utc": 1559772648, "title": "Attempt at community", "author": "ashtenzer", "self_text": "I’m so annoyed...I just posted to my local city’s subreddit trying to start a group where body positive fat people could get together and hang out. Not surprisingly, I was met with stupid questions and remarks about being unhealthy. I’m so sick of it. I wish I had a group of fat friends who understood and would fight alongside me, but at the moment, I feel like I’m fighting alone. I’m seriously considering moving to a city where they have these clubs created already.", "subreddit": "BodyAcceptance"}
{"post_id": "bxb8ob", "created_utc": 1559787552, "title": "Facebook groups and Twitter users to follow", "author": "enska2", "self_text": "Hi! Lately I've been getting really into Facebook groups and would love to join some about body acceptance. I searched for a while yesterday but didn't find much. Is anyone here a member of any groups? (I like them because they can be closed, moderated, and relatively free from trolls).\n\nI also really like the Twitter body acceptance community and can't get enough of it. My favorite is @yrfatfriend who is wonderful and, IMO, life changing. Who else do you all find inspiring?\n\nI see a lot of Instagram users in this sub's info, so I'll be checking those out! I just recently started using Instagram more and I'm pretty saturated with kittens right now. ☺️", "subreddit": "BodyAcceptance"}
{"post_id": "bxbmfn", "created_utc": 1559789928, "title": "Dental health", "author": "wageovsin", "self_text": "So some of this is my own doing. I have a energy drink addiction. Some was from being violently jumped years back. But anyways most of my teeth are rotted out. Uppers are all the way. Lowers are going.  Has anyone else experienced this.  Its soul crushing.  You just know everyone is judging you or being repulsed. And the price to fix it all is a lot", "subreddit": "BodyAcceptance"}
{"post_id": "bxc6ly", "created_utc": 1559793601, "title": "From size S to M, learning to accept my changing body", "author": "tikitall", "self_text": "Let me start this post with some background...\n\nGenetically, I have a very tall, very thin, and very lanky body frame. My 5\"4\" mother is the size of a child and this 5\"6.5\" former beauty queen had  inherited her bone structure.\n\nAll throughout high school and even college I've weighed about 115 lbs and to me, that was normal! No diets, no eating disorders. Just me going about trying to live my best life.\n\nFlash forward to 26 and here I am weighing 140 lbs. By no means am I fat. In fact, I still look incredibly skinny! Still tall, still lanky, just filled out in all the right places. However, I'm struggling with the idea that I am now a size medium.\n\nIt's silly, I know. But it hit me today as I just received my new summer bikini in the mail. I ordered a medium because in the past I've ordered a small to no avail and when I tried it on IT FIT PERFECTLY.\n\nI've had to donate so much of my wardrobe to my skinnier friends and it has killed me. So many size 2 dresses, gone. The cutest going out outfit, buh bye. Small size bikinis, out the door.\n\nI know this may sound shallow of me but I need to remind you that I was a former beauty queen and had done some modeling. It's engrained in my brain that small is beautiful, even though I still look and feel \"beautiful\".\n\nI see girl's younger than me, these \"Instagram models\" who I used to look like flaunting themselves, and their bodies, in skimpy outfits (or none at all) all over social media. I used to have a career in social where I had to see this all the time and it really diminishes my self image.\n\nYes, I am no longer a 19 year old beauty queen but I am beautiful, \"curvy\", and fully enjoying my DDs. But there is something deep down inside of me that cringes when I have to admit I am a size medium.\n\nI know that vanity sizing is a thing and maybe that somewhat comes into play but the truth of the matter is is that I just need to accept it and be confident. Accept that I am no longer and will never choose to be a size 2 and that I should love myself just the way I am. But it is so difficult in today's social media driven culture to be self accepting.\n\nThank you for reading my rant, I hope that others can take something away from this. I am still learning and growing as a person and hope to come to accept myself and my new norm.\n\nAlthough there are others who deal with much more extreme forms of body dysmorphia please understand my background and why I feel the way I do. I don't want to invalidate anyone's experience (although it seems like I'm invalidating my own).\n\nPlease comment with any questions, comments or concerns.\n\nThank you for reading.", "subreddit": "BodyAcceptance"}
{"post_id": "bxdhz7", "created_utc": 1559803162, "title": "XL Pixie Cut", "author": "GoingGoingGone95", "self_text": "Hi all. This is my first time posting in this group. I’ve been stalking for a while and appreciating the supportive community!!! \n\nI was wondering if there were any plus size ladies who have short pixie cuts? I’ve had the same hair cut (jaw length bob with side swept bangs, also my hair is naturally curly) for almost 6 years. I’be always liked it, and that’s probably why I keep going back to it BUT I’ve always wanted it SHORT. I used to have really long hair, like down to my ass, because I was always told that big girls should have long hair to hide the fact that they’re big, and I totally believed it (I was in high school and had absolutely 0 self confidence). \n\nBut now I’m older and am filled with a lot of self love (thankfully from surrounding myself with such body positive people) and I’m finally ready to take the plunge. My hair stylist is great, but I still have that voice in the back of my head that says “you have to hide the roundness of your face/double chin/weirdly shaped head”. How do you guys deal with that tiny voice in the back of your head that tells you that you’re not —blank— enough to make a change?\nAdditionally, are there any of my gorgeous plus size ladies who’ve done the deed and chopped your hair??? What was your experience like (good/bad/traumatic)? Do you love it? \n\nYou guys are great! And thank you in advanced &lt;3", "subreddit": "BodyAcceptance"}
{"post_id": "bxhu9b", "created_utc": 1559833909, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "bxpilh", "created_utc": 1559875793, "title": "Any tips on getting back into (healthy) exercise?", "author": "meepmeepcuriouscat", "self_text": "Hi there!\n\nI'm looking for any advice one could give on exercise and motivation. About 9 years ago, I started developing disordered eating habits, although I've been eating pretty regularly for the past 5 years. But since exercising was a part of the problem, I've avoided it for the past 5 years, as it always makes me feel very self-conscious.\n\nI've gained weight recently due to drinking and snacking more, and because my new job is comparatively sedentary. I need to get active as there's a history of high blood pressure in my family, so I'd like to avoid that. Problem is, I don't know what exercise to do! Gyms make me compare myself relentlessly to others, and running was what I did 9 years ago. If anyone has a suggestion, I'd like to hear it, please.\n\nEDIT: I just took my first walk! It was about 18 minutes long, two laps round the hill near my place and back. I'm sitting down for 5 minutes to stretch and drink water before I shower. Since I drink (alcohol) about half the time, I'll leave y'all w this piece of advice: if you drink, that's no reason not to exercise! Just drink water before and after! That walk felt great. Thanks, all of you supportive redditors. I never knew moving could feel anything but punitive, and now I know better :)", "subreddit": "BodyAcceptance"}
{"post_id": "bxvrbc", "created_utc": 1559920403, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "by2fp5", "created_utc": 1559956999, "title": "Online Coaching?", "author": "loveforall13", "self_text": "Hey! So I have been in ED recovery for about a year now, but I relapsed a bit during the school year. I have been gaining a little weight but I still am restricting/am scared of gaining weight/am over-exercising. My question is, have any of you tried those private coaching sessions that podcasters/bloggers/Instagrammers have? I follow some amazing ED recovery accounts and they seem to just verify my thoughts out loud. I’m a bit hesitant because it is a lot of money and I have such a great treatment team, but I just feel like I haven’t completely put myself all into recovery. Any thoughts?\n\nThis is a program I was just looking at — I just watched one of her videos and it was my thoughts exactly. https://damnthediets.com/private-coaching/", "subreddit": "BodyAcceptance"}
{"post_id": "by8wgk", "created_utc": 1560006596, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "bya5h1", "created_utc": 1560013820, "title": "A Retrospective Approach To How Self-Identified Men Understand Eating and Body Image Survey", "author": "Brygavj", "self_text": "Hi everyone! I am a clinical psychology doctoral student and a part of my requirement is to complete a study for my dissertation. Said study had to be redesigned due to a lack of participation. The premise of the study remains the same, however, the important changes are that it has been opened to include all **self-identified men** and a survey has been created. **If you self-identify as a man** and wish to share your experience with eating and body image, I would greatly appreciate your participation. This study would help make a contribution to the psychological field, specifically the eating disorder + body image field. Thank you in advance for your participation. The first 100 people to complete the entire survey will be prompted with the following step needed to receive compensation for their time.", "subreddit": "BodyImage"}
{"post_id": "byd0vh", "created_utc": 1560030623, "title": "Could I have Body Dysmorphic Disorder?", "author": "unhealthyhabits98", "self_text": "(Sorry, this is a very long read)\n\nHi everyone,\n\nI am a 20 year old female from the UK.\n\nI feel very stupid posting this but experiencing frequent lows has made me realise that I may need help, but I’m not sure if I’m overreacting or making a big deal out of nothing as I understand everyone has their insecurities. It’s been especially difficult to manage these feelings for a year or so and have been previously diagnosed with anxiety and depression. Alongside this, I have psoriasis and arthritis which I am currently on medication to control my symptoms.\n\nI used to be significantly overweight throughout adolescence and have lost 4 stone during the summer last year within a short amount of time. In fact, towards the end of last year near Christmas, I am sure that I was developing an eating disorder as I dropped well under 7stone. Friends and family commented on my weight being worried for me as I looked unwell, however, whenever I looked in the mirror I never saw this. I am 5ft tall and currently weigh 7 stone.\n\nAlthough I’ve put on some healthy weight since and know I should probably put on some more, I still can’t help but punish myself and compare myself to others. I feel as if my short height makes this worse as I have short legs and hate my thighs which is where I put most of my weight and muscle on. I know that we all come in different shapes and sizes, but I can’t help with feeling disgusted and fixated on my own weight and height, especially when I look at myself in the mirror. \n\nI don’t compare myself to others who are short or a similar build, and I don’t think that there’s anything wrong with them but only with myself. BUT I do compare myself to those who are tall and very slim, to the extent of becoming envious of them. I fixate on other things too but I think my weight and height are the main issues right now. I’ve pretty much quit all social media as I think it’s one of the main causes of why I have such low self-esteem, and so have come to the realisation that such unhealthy behaviour is not normal. Since I have tried to accept and love myself but I’m still struggling to overcome this.\n\nI am hoping to call the doctors on Monday for an appointment but I’m not sure how to discuss this with them as I feel so silly with being honest. Can anyone please offer some advice as I’m not sure what to do or what to say.\n\nThank you for taking the time to read this.", "subreddit": "BodyAcceptance"}
{"post_id": "bydlbz", "created_utc": 1560034093, "title": "Had stomachs sleeve surgery", "author": "jamesofearth3", "self_text": "I'm a 35 year old heterosexual male I was 520 lbs and dropped  down to 240 but now I have 5hese ugly socks of empty sick It makes me look disgusting i feel unattractive and like less of a man", "subreddit": "BodyImage"}
{"post_id": "bydou7", "created_utc": 1560034692, "title": "My body is gross and I feel gross", "author": "jamesofearth3", "self_text": "I'm a 35 to male and I used to weigh 520lbs but I dropped to 230 now I have these empty sacks of skin. I felt like a grotesqe creature. I feel unattractive and like less of a man", "subreddit": "BodyImage"}
{"post_id": "byffm9", "created_utc": 1560046097, "title": "For my entire life, I have feared becoming a \"wolf-man\"", "author": "Maximus_Decimus92", "self_text": "I have abnormal amounts of body hair. I think I may have a rare genetic disorder. I'm 27 years old. My hair is black and very thick. It's all over my hands, just above my knuckles in patches, my shoulders, thick eyebrows, etc... It's always made me feel unevolved and ashamed compared to other men I see. I'm embarrassed to go out in public or even wear short sleeve shirts.\n\nIf it was just on my arms or legs I would be fine with that, but I'm also growing abnormal amounts on my face. It grows so far up it's almost going to my eye socket. Someone in middle school once said, \"He's growing hair up that fair? Must be another species.\" I still remember that. I'm mortified of knicking peach fuzz with a razor (is it really peach fuzz for me if it's dark and visible?) and it growing in even more coarse and visible. I try to shave as little as possible for this reason. I fear my entire face will be covered in dark black hair and I'll look like a freak. I saw a documentary a decade ago about a man with this condition, and it has frightened me every day ever since.\n\nI don't know what could be causing this. I avoid eating too much processed foods, don't take any drugs, etc...\n\nI'm so paranoid I think it is God punishing me and smiting me (I'm not religious, but I'm starting to think it could be this) for masturbating, looking at porn, and having casual sex with a dozen or so women so far in my life and using them for pleasure. I just want to feel like a normal human being. I don't right now. I don;t take pictures, I hate how I look. I don't want to become a wolfman.\n\nDoes masturbation cause abnormal hair growth? I try to avoid masturbating for as long as I can, but eventually can't help my primal urges. After I masturbated for two nights in a row, today I just noticed a thick, dark hair that grew out of the side of my nostril that's a few centimeters long.\n\nThere's even hair all along the underside shaft of my penis, and tiny hair follicles ALL over it. THIS IS NOT NORMAL.\n\nI'm scared. I get frustrated and cry over this, and isolate myself. I don't know what to do. I used to want kids, but I don't think so anymore. I don't want to pass on this inferior trait to anyone, no one deserves that. I'm starting to feel so inferior that I have no reason to exist and am a genetic fluke.", "subreddit": "BodyAcceptance"}
{"post_id": "bylk2r", "created_utc": 1560095284, "title": "I can’t go to graduation because of my insecurities.", "author": "batoot111", "self_text": "My HS graduation is upcoming next week, and if you knew me 3 years ago, you would not believe i’m the girl that would skip graduation, but here i am, i just.. i can’t, i want to but i can’t, i tried being that confident girl, hosted a Halloween party last year, and even tho i improvised EVERYTHING from my makeup look to my dress, i still looked like shit on the day of the party, then i gave myself another chance, I attended the finale project, and again, i failed Badly, it’s like..whenever i have an event coming up i just have to look bad, no matter how hard i try, so I decided to just..skip on graduation because spoiler alert, i know i’m gonna look hideous, all my friends are super mad rn, saying shit like “if you didn’t come, you’re gonna ruin it for me!”, as in i’m gonna ruin their happiness?? Ugh fuck this shit, i hate myself so fucking much", "subreddit": "BodyAcceptance"}
{"post_id": "byt8t9", "created_utc": 1560139432, "title": "What is wrong with a lot of Reddit?", "author": "punk_loki", "self_text": "There was a sanity Sunday post on r/Instagramreality where a YouTuber named Drew had posted on his insta saying he was chilling with his belly and there was a picture of him. \n\nIn the comments all these people were attacking him and saying he is overweight and unhealthy and if he doesn’t hit the gym he will get heart disease and die. And people going on to say that anyone praising people who don’t have flat stomachs is just encouraging people to be unhealthy. \n\nI tried responding with “just let people post pictures of themselves and don’t tell them they are gonna die every time you see a picture of them. Don’t make people hide their bodies from you” \n\nAnd people actually have been arguing back at me. Some of my comments have been downvoted. Drew’s body is really normal looking too. \n\nI don’t get it. It’s like most of Reddit is just Dennis from Its Always Sunny. Craziness\n\n\nEdit: there was so much arguing that the mods closed commenting on the post", "subreddit": "BodyAcceptance"}
{"post_id": "byyvv3", "created_utc": 1560178846, "title": "Meta Monday", "author": "maybesaydie", "self_text": "Once again we need to discuss what is and isn't fatlogic since there seems to be some confusion. What's **not** fatlogic? Someone making a post about how it sucks to be called names because they're fat. An example of fatlogic is someone saying that calories don't matter or that they can't lose weight at all. Things in that vein. We're not here to laugh at fat people's appearance. You want to do that,  voat.com awaits your submission.\n\nPlease report any submissions that concern you.", "subreddit": "fatlogic"}
{"post_id": "bzdorv", "created_utc": 1560265861, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "bzmqmm", "created_utc": 1560314144, "title": "I genuinely hate my body and I've started attaching it to my self worth.", "author": "This_Conclusion", "self_text": "I'm a 16 year old gay boy and I want to crawl out of my skin. I feel like I'm never going to experience love or sex or so many things that are big parts of just being human.  I'm 270 lbs and 6'1 and I feel like a gross melted candle every time I look into a mirror. Every single online space and forum and sub where I should feel welcome is a fatphobic minefield and I'm beginning to internalize that if I'm not super muscular or skinny I don't deserve love. I don't want to hate my body and I know that losing weight isn't going to help that, but I don't know how to internalize that. Can anybody relate?", "subreddit": "BodyAcceptance"}
{"post_id": "bzsfn8", "created_utc": 1560352450, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "c03c7j", "created_utc": 1560415539, "title": "I'm struggling with feeling bad about my body although I look normal", "author": "straca95", "self_text": "I am a woman in my early 20s and struggling with the way I look, although I look quite normal. I weight normal and have a cute face. Also, I like to think of myself as a quite rational person who understands how women are being made into feeling self-consious about the way they look and that is why it bothers me so much. I used to live in a very small town where everybody knows eachother, they look at you and comment everything. My ex boyfriend was a manipulative abuser who convinced me I look like shit over the years. Also, my mother puts a lot into the way she looks, dieting all the time and never feeling happy about herself. She comments the way I look every time she gets a chance, but never says anything nice. She never misses an opportunity to remind me I have a pimple or something I'm wearing isn't really flattering for my figure. She does this in a really nasty way and its hurtful but she doesn't seem to understand why although we talked about it. However, 5 years ago I moved to go to unviersity and surrounded myself with really supportive friends and found a new boyfriend who treats me like a queen. When I'm away from home I find myself thinking I look amazing and wearing everything I like, short and tight clothes or whatever. And every time I get back home for holidays I feel awful again and change my clothes 5 times in the morning because I don't like how it looks on me even though I've been loving that outfit before I came home. This is becoming quite exhausting and I hate that I can stop feeling this way although I know it is stupid. Sometimes it ruins my whole day and I don't feel comfortable running into people I know cause I think they must be thinking how I look, and I started avoiding having sex or going to the beach where I know someone will see me.", "subreddit": "BodyAcceptance"}
{"post_id": "c05atn", "created_utc": 1560429486, "title": "My shoulders grew again :/", "author": "peepocho", "self_text": "They were already quite broad but now they jumped up an inch and a half all around.\n\nMy shoulders are part of the reason why I'm just counting on gaining weight to have a more balanced look since my waist is as blocky as waists can get.", "subreddit": "BodyAcceptance"}
{"post_id": "c05no4", "created_utc": 1560431557, "title": "Curvy Girls Dolls", "author": "bobonaca", "self_text": "Have you all seen the Curvy Girls Dolls? They're doing a kickstarter at the moment.\n\nWhat do you think of them? I've seen some people getting pretty annoyed with their existence, but I'm really excited for them and hope they reach their fundraising goal.\n\nI may not be plus sized myself anymore, but seeing beautiful dolls that are heavier makes me feel really happy.", "subreddit": "BodyAcceptance"}
{"post_id": "c09761", "created_utc": 1560449217, "title": "My mom’s coworker called my ass flat, and my mom proceeded to egg her on about it.", "author": "yuichun", "self_text": "Maybe I’m making a big deal out of nothing, but I’ve been feeling awful ever since I picked up my mom at work yesterday. My mom and I have virtually the same body type except that I‘m more muscular... And, I don’t have her “bubble butt.” \nWell, my mom, her coworker and I were walking to the car to put stuff in her trunk, and her coworker, practically out of nowhere, is like “wow, yuichun’s butt is on the flatter side, huh?”\nI’ve always been super self conscious about it. I do little things every day (ex., walking up two stairs at a time) to promote my ass “rounding” because it’s really been getting to me lately. But after said coworker says this, my mom is like “yeah, she has a total pancake butt.”\nWhich... not to toot my own horn, but it definitely isn’t *that* flat. There’s roundness. If I wear a thong it looks cute. From my profile my butt’s definitely out further than my back. But I’ve been feeling horrible since then. I can’t help that I wasn’t blessed with a perfect instagram model body..\nI don’t know what I hoped to accomplish by posting this here. I guess I’m just hoping you guys have similar stories or words of encouragement. Thank you.", "subreddit": "BodyAcceptance"}
{"post_id": "c0b9yx", "created_utc": 1560459320, "title": "I've been reading about body acceptance, and slowly but surely, I'm learning to embrace my curves.", "author": "erkullurrkul", "self_text": "As I was looking in the mirror today, I realized that I really love my hips in particular. Thighs too. I'm still trying to get over the fact that I have a sizable belly, but even that is starting to not bother me as much. I'm actually looking forward to buying new clothes once I get paid, even if I'll be buying clothes in a larger size. Yay! I've been thinking about turning some of my older tshirts into a quilt. I use to keep them in my closet as \"motivators\" but I think I'm finally ready to recycle and donate them because even if I did lose weight there are just some shirts I won't ever be able to fit back into (clothes I've had for 5+years etc) Other things I've improved on is the way I look at and feel about food. As a diabetic I still have to count carbs. But I don't really go beyond that to an obsessive extent the way I use to. That's not to say I'm going to Burger King 5 times a week (even though the bacon cheeseburger I had from there today was delicious \\^\\_\\^). My goal is simply to have a balanced diet. And I think that's how it should be for everyone.\n\n&amp;#x200B;\n\nI think loving yourself first is an important step in life whether or not you are on a fitness journey and I'm happy that I'm finally learning to not attach my self image to my self worth. Being healthy doesn't seem like such a burden when things are that way. I wish everyone luck who is struggling with their self image and/or low self esteem. I truly think being more positive about our lovely bodies will help us all in the long run.", "subreddit": "BodyAcceptance"}
{"post_id": "c0boil", "created_utc": 1560461375, "title": "Retail worker called me fat.", "author": "fossa-", "self_text": "This happened about a year ago when I was bra shopping with my grandma. See, i was bra shopping for my parents wedding since I was a bride maid and I needed a brownish nude bra for my dress. \n\nWe were having trouble finding my size so my grandma asked an employee to help us which was completely understandable. The worker pulled serval bras and went into the fitting room to help me and to see the fit of the bras. Which, honestly now that I'm typing I realised that was a bit weird. The fact I had no privacy at all. \n\n At this point everything was fine, we even ended up finding a pretty comfortable bra.  But, at the end when everything was paid for my grandma told me that the worker said to her \"you need to have your granddaughter loose some weight.\" But while she was telling me she was laughing. \nI wasn't. I don't know what hurt more, the lady saying that or my grandma not realizing how shitty that was. \n\nNeedless to say, it ruined my mood. My grandma and I were supposed to go get lunch, but I ended up skipping lunch and dinner that day. And my boyfriend had to convience me to eat breakfast in the morning. \n\nBut, recently I've been able to accept my body more. I don't think I'm even that fat tbh. I have a little chub but??? So what.", "subreddit": "BodyAcceptance"}
{"post_id": "c0l9i8", "created_utc": 1560525275, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "c0n9l2", "created_utc": 1560535597, "title": "Fat Logic for Men: GQ and How Not to Talk About Men’s Bodies", "author": "fojiaotu", "self_text": "Article link: https://splinternews.com/gq-and-how-not-to-talk-about-men-s-bodies-1835493091\n\nChoice quotes:\n\n* \"At the least heavy point in my adulthood years ago, when I was essentially starving myself on a diet plan and running every day in anticipation of a 5K, I weighed roughly 260 pounds. I was fucking miserable.\"\n\n* \"It’s been a lifelong struggle for me to come to terms with the fact that this is just how my body is; that it can waver in size, but there’s always going to be a baseline of fatness\"\n\n* \"I was never able to limit myself to just four foods. And when I looked in the mirror at 260 pounds, I felt the same way I did at 300, only hungrier.\"\n\n* \"Rouse’s body is his own deal, just like mine is my own deal. The idea that his is the ideal body, however, or something close to it, means there’s an opposite of that. And for people like myself, this is just another reminder that a body like mine is something to be avoided. \"\n\n* \"offer advice to your readers on how to eat and exercise without glorifying malnourishment and exercise to the point of overexertion\"\n\nSame old BS.", "subreddit": "fatlogic"}
{"post_id": "c0orwo", "created_utc": 1560543500, "title": "My body dysmorphia is ruining my relationship", "author": "_beaniethebean_", "self_text": "and i mean like sleeping with clothes on, especially in recent time just because my partner brought it to my attention, refusing to wear clothes that show even the tiniest inch of skin in public or infront if someone else so i’m dying outside in summer weather. i genuinely believe once i achieve my  unachievable “ideal body” all this will go away but as of now i’m just consumed with working out all the time and restricting my diet to almost unhealthy levels.\n\nthis has our a strain on my relationship and my partner wishes i could learn to accept and love myself the way they do to me but the problem is i don’t know how :/ how do you accept your body and build the confidence? ive never been able to fathom it, especially feeling grotesque everytime i look at myself in the mirror", "subreddit": "BodyAcceptance"}
{"post_id": "c0p5km", "created_utc": 1560545604, "title": "I really hate the number of things I hate about my body that I genuinely can't control", "author": "UmbralApocrypha", "self_text": "It sucks not being able to accept them or make them change, I wish it were the things I could control that were bothering me instead so at least I could do something to feel better", "subreddit": "BodyImage"}
{"post_id": "c0tod6", "created_utc": 1560574831, "title": "I’m a teenage boy with stretch marks and I hate myself for it.", "author": "lacpoer", "self_text": "I realize I’m not the intended demographic of this sub, but here goes. I have a hard time talking about this cause guys never talk about body insecurity or just insecurities in general, but in the past few months I’ve developed stretch marks on my lower back and I’m extremely insecure about them.\n\nI’m in pretty good shape and I even consider myself kind of attractive, but I don’t feel comfortable going to the beach or even being shirtless around anybody anymore. These pretty big sometimes red, sometimes purple marks are very common on my lower back, and it makes me mad cause I wasn’t even fat when I got them. I was in better shape that I even am now.\n\nI just want some motivation that’s not cliche. I’m even embarrassed to be shirtless around my family. I’m just so sick of it.", "subreddit": "BodyAcceptance"}
{"post_id": "c0yaog", "created_utc": 1560611447, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "c151d5", "created_utc": 1560651214, "title": "Negative self image AND IM TIRED OF IT", "author": "Thisislife1980", "self_text": "I have always struggled with self image. I've always had a low self esteem. In my 38 years there have been some years I was actually confident w my looks, but I feel like I've always needed others validation. I am usually one to get mens attention.l, usually younger men.I recently went on a trip w my 18 year old daughter for her graduation. This time she was the one who got all the attention and it made me feel absolutely horrible about myself! And made me feel like an awful mother cause I should have felt happy for her! I ABSOLUTELY HATE FEELING LIKE THIS! THIS IS NOT NORMAL! I also hate when ppl take pics off me off guard I literally want to puke. Any suggestions? Any books i can read?? I know I should probably seek therapy again😭😭", "subreddit": "BodyAcceptance"}
{"post_id": "c1b4zh", "created_utc": 1560699044, "title": "Can we all just show thesedolls some love?", "author": "apatheticallyhere", "self_text": "So I happened upon the Curvy Girls dolls a little while back though and have been following on facebook. They are the cutest little things. As someone who suffered with body imsge problems due to weight for a long time I love seeing a representation of bigger girls in the media. I also love that they've given their dolls characters and have included things like a ttansgendered doll. What are peoples thoughts on a these dolls? Also what do you see the main audience being for these dolls?...for reference curvygirlsdolls.com", "subreddit": "BodyAcceptance"}
{"post_id": "c1c38j", "created_utc": 1560704195, "title": "It’s like the universe is testing me.", "author": "batoot111", "self_text": "Long story short i saw this gorgeous girl while applying for something, i felt my body dysmorphia come up and i envied her but that was all..right?\n\nIn the exact same day, i’m working out at the gym, and guess who shows up? the EXACT same girl, except now i can see her figure and its exactly what i aspire/dream to be, i know this sounds like some kind of lie..but i swear i’m not lying, i wish i was, god, i hate myself, why is the universe doing this to me?! What did i do?", "subreddit": "BodyAcceptance"}
{"post_id": "c1eo8g", "created_utc": 1560717683, "title": "Can't focus on anything but how ugly I am", "author": "imnevergold", "self_text": "I found myself going down a rabbit hole yesterday. I have been getting into sustainable fashion and I've found that it's really helped a lot with my body dysmorphia because a lot of sustainable fashion brands also promote body positivity and natural beauty and since the main focus is on the environment and not yourself it makes it a lot easier to accept yourself as is since you feel like you're doing good and being a part of something bigger. I've included this just in case this is helpful to anyone else. Anyway, I always knew a large part of my insecurity stemmed from social media and social media \"influencers\". I know the saying goes you're not ugly just broke, but I saw a video of a girl with this perfect face talking about all the fillers she had gotten done and she had basically had half her face done like she had lip, cheek, under eye, and nose fillers but she looked soooo good. She also had a breast augmentation and as someone who has only recently started to be confident with my flat chest that really started up my dysmorphia again. I would love to have enough money to get fillers all over my face, especially my nose. I would love to also get my boobs done and ugh idk I guess I wish I wasn't broke so I wouldn't be ugly basically.", "subreddit": "BodyAcceptance"}
{"post_id": "c1gmvj", "created_utc": 1560728765, "title": "My body", "author": "ArticFox09", "self_text": "I feel so down and gross about my body. I feel like a fat cow and just like shit. Like yes I know I've gained weight and it makes me upset I let myself drink to much cokes and just junk food. We stopped doing meals at the house and I think its really affecting my weight as well. I just fucking hate myself right now.", "subreddit": "BodyImage"}
{"post_id": "c1gmvy", "created_utc": 1560728767, "title": "How do I stop comparing myself to others?", "author": "eukarythotic", "self_text": "Recently I’ve been incredibly down about my body, I don’t know exactly what triggered it but it’s affecting me really badly.\nI’ve become pretty good with allowing myself to eat intuitively, however working on body acceptance still hasn’t happened, and I can’t stop comparing myself to people I know and thinking that maybe I should set their body as my goal. I don’t want to undo all the progress I made with intuitive eating by aiming for a body I probably can’t achieve, but I have no clue how to stop comparing my body to everyone I know.", "subreddit": "BodyAcceptance"}
{"post_id": "c1jkys", "created_utc": 1560747953, "title": "Wife’s Body Acceptance", "author": "chapito96", "self_text": "My wife and I recently got married about 8 months ago and so far it has been the greatest 8 months of my life. Along the way, my wife’s eating disorder has continued to worsen and present itself more. Before being married I knew she dealt with the insecurity of thinking she was “fat” or not a certain body type and what not. As of late it has only worsened and she is absolutely controlled by this thinking that she is far, not skinny (to her definition). Any kind of exercising, putting on workout clothes, eating, or anything like that triggers her and she gets into a mood of thinking she is awfully overweight and what not.\n\nIt has gotten to the point that I feel terrible if I go at for a run or bike ride in the morning. She feels like I burn too many calories and that she herself is not allowed to eat the daily amount of food because I was out burning calories. She constantly tries to less than I do and monitors what others eat or say about her. Instagram is an awful trigger that she can just not let go of. We have been visiting a therapist but I feel like there has been no progress. She refuses to go to a therapist or center that specializes in ED treatment and recovery. She doesn’t want to solve this ED issue because she feels she will get fat and this is her “safety net.” \n\nAny suggestions? I as a husband love her and want her to be better and happy with herself. It is something that comes up daily and it is hard for me to cope with due to my frustrations and emotions getting the best of me. I am improving and I realize she is experiencing something that is 100x greater than my frustrations and difficulties with her ED. \n\nShe doesn’t trust me as well when I respond to her questions about if she’s fat or whatever it may be. Frankly, she doesn’t trust anyone’s opinion. She believes everyone is out to tell her what she wants to hear.", "subreddit": "BodyAcceptance"}
{"post_id": "c1lgbe", "created_utc": 1560763355, "title": "How can I stop being so insecure about my scoliosis?", "author": "basslineheart", "self_text": "I've been born with a rather curved spine, so I got a combination of kyphosis and scoliosis. I've been working on it, and most of my friends whom I open up to about this tell me I've got great posture, I suppose because I don't slouch and always try to be upright. Still, when I look at myself from the side in the mirror, or in some photos, I feel like a hunchback.\n\nThis is something thst really depresses me, yet the people I talk to about it always tell me they never noticed this about me...does anybody have any Tipps or suggestions how I can stop this vicious circle of one day being accepting of the fact thst I'm just \"curvy\" and the next feeling like an evil witch out of a cartoon, with a huge hunchback, envious of those with straight spines?", "subreddit": "BodyAcceptance"}
{"post_id": "c1owa8", "created_utc": 1560785412, "title": "Meta Monday: Subreddit Business", "author": "maybesaydie", "self_text": "* Over the weekend we had to remove some comments involving Holocaust Denial. Should you be unfortunate enough to hold such mistaken and conspiratorial views bringing them into this subreddit will result in an instant ban. And, as always, please keep discussions about politics in the appropriate subreddit.\n \n\n* The next selfie post will be THURSDAY~~Friday~~, July 4\n\n* Questions for the mods can be asked below.", "subreddit": "fatlogic"}
{"post_id": "c1rlxy", "created_utc": 1560798274, "title": "Dealing with past plastic surgery", "author": "miscified230", "self_text": "I had cosmetic surgery when I was younger and I really regret it. \n\nIt didn’t turn out well, but I’m posting more because I feel bad about messing with my body and about how much I hated myself at the time, and that there’s nothing I can do about it now.\n\nI do wish I could have my old body back.\n\nWondering if anyone has any thoughts about dealing with and accepting this? Has anyone been through anything similar?", "subreddit": "BodyAcceptance"}
{"post_id": "c1t4vo", "created_utc": 1560805644, "title": "Rate your confidence in your ability to engage in healthy eating and exercise - take part in a short research questionnaire", "author": "emily8881", "self_text": "  \n\nHello, I would really love if anyone could share their thoughts about healthy eating and exercise. I am part of a research project investigating factors that influence our ability to reach and maintain a healthy weight. \n\nHave you had long-term issues with your weight? Do you consider yourself to be currently overweight? If so, please follow this link to take part in a research questionnaire. It takes 10-15 minutes to complete and will ask you to rate your confidence in your ability to engage in healthy eating or exercise in a range of scenarios. \n\nAll responses are anonymous and confidential and only accessible to a small research team at the University of Hertfordshire. The aim is for the results to be used to inform weight loss groups and interventions so individuals can be supported to achieve better outcomes. Thank you in advance! Any responses would be so gratefully received. \n\n[https://herts.eu.qualtrics.com/jfe/form/SV\\_eR1ifcW1JbPKQMR](https://herts.eu.qualtrics.com/jfe/form/SV_eR1ifcW1JbPKQMR)", "subreddit": "fatlogic"}
{"post_id": "c1y0f2", "created_utc": 1560833945, "title": "PARTICIPANTS WANTED", "author": "bodyimageproject", "self_text": "I am doing research (IRB APPROVED) on the impact of self disclosure specifically related to body image and sexual satisfaction in relationships.\n\nIf you are interested in participating, are 18 or older, and in a relationship of 3 months or longer, please pm me or reply to this thread so we can arrange an interview for your participation.\n\nSerious inquiries only.", "subreddit": "BodyImage"}
{"post_id": "c217zp", "created_utc": 1560858176, "title": "Body insecurity with keloids", "author": "Tishle", "self_text": "I have keloids on my body which makes me feel insecure and as a lady it makes it hard for me. \n\nIt’s mostly hidden but I feel people will be disappointed if they come close to me and get to know it especially intimately. Don’t know how to overcome it", "subreddit": "BodyAcceptance"}
{"post_id": "c23ff7", "created_utc": 1560870736, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "c24ich", "created_utc": 1560876021, "title": "Las Vegas", "author": "Lgel7", "self_text": "Hi guys. I am set to go to Las Vegas this coming weekend for my high school friend's bachelorette weekend. I was underweight in high school and I am now \"overweight\" according to BMI standards. My friends are very supportive and accepting, but knowing we'll be spending a day at the pool and we'll be trying to go to a club one night is making me very nervous and self-conscious. Maybe if I'm drunk enough I'll be able to make it through the weekend? Could use some support if any of you have any ideas or tips for how to have a fun weekend and not let patriarchy/unrealistic beauty standards/etc. ruin my fun! Would greatly appreciate it!", "subreddit": "BodyAcceptance"}
{"post_id": "c28pqh", "created_utc": 1560896129, "title": "I'm a 26 year old guy, I have a lot of insecurity about not being manly.", "author": "Cyclone619y2j", "self_text": "I'm short (5'7) and skinny with narrow shoulders. I can't really lift weights due to chronic injuries. That's made me feel horrible and insecure.\n\nI don't look manly. I can't see why any women wouldn't be interested in me at all given how I don't resemble the guys they tend to chase.\n\nI don't feel like women desire me at all.  Maybe, they might settle with me when they are older and have had their fun with the hot guys.\n\nBut it's already crippled my self-esteem\n\nI get zero matches online. That makes me feel so shitty. As if I'm completely worthless.\n\nIt's messing with other things in life because all I can think about is this. I can't move on and focus on other things because I'm always depressed about how I can't be attractive to woman.\n\nI look around and I always see tall and buff guys with girls chasing them. Even if I was in a relationship, it wouldn't work because I'm scarred now. I just don't feel attractive.", "subreddit": "BodyAcceptance"}
{"post_id": "c2a0l4", "created_utc": 1560903386, "title": "(17) Male and extremely insecure", "author": "howcanifeelgood", "self_text": " \n\nMy body and height is leading me to depression as girls have rejected me because of it I'm 5'5 and underweight my crush said I was too short and when I was talking to a close friend he said I look malnourished my weight isn't even that bad but my height is what really gets me as my friends fuck with me for it and I don't wanna look bad and tell them to stop because then they will know I'm insecure that is why I made a new account for this post. I've finished growing and I'm 4 inches from average height. After my crush denied me for my height I looked at a bunch of tinder posts and other things where they say height matters and how its harder for short guys to get girls and other things what has just made my self hatred more pure I really wanna accept myself before my depression gets worst.\n\nSorry for rambling I'm just really sad right now", "subreddit": "BodyAcceptance"}
{"post_id": "c2aidz", "created_utc": 1560906239, "title": "15yo Female struggling with body positivity", "author": "MissPugLover24", "self_text": "Backstory: I have growth hormone deficiency, meaning that I don’t grow at a nearly fast enough rate and I have to take shots daily to grow. I had to have a small medicinal implant to stop me from getting my period three years ago, as when you get your period, you generally stop growing. It was taken out last year. My doctors think I am a few months from getting my period.\n\nOk so I am incredibly insecure about most aspects of my body. I hate how wide my face is. I hate how big my nose is in proportion to my face. I hate the baby fat still left on my cheeks and how when I smile it makes me look Asian. The problem with that is, I’m white. Like I’m half German, the other half a mix of Eastern European. Definitely not Asian. And people think before they meet me I’m Asian, and I’ll constantly get questions. I’m fairly tan too, so I don’t think it’s my skin color. I really don’t mean this in any offensive way at all, it’s just that people think I’m a race that I am definitely not! \n\nIn addition to this, in relation to my GHD, I’m 4’11.6, and they’re not sure if they’ll be able to get me to 5 feet because I’m starting to plateau. And I just want to be 5 feet so freaking bad! I don’t want to be just under 60 inches for all of my life! My mom says just to tell everyone I’m 5 feet, but I’ll still know that I’m not! And I just feel so embarrassed because when I babysit or volunteer with kids, they always compare how they’re almost as tall as me. Or when I’m with adults, they always think I’m much younger than I am. And I can’t even fit right into most junior sized clothing! When I went to homecoming I had to get a kids sized dress. And I’m in high school! It was so completely and utterly embarrassing and we had to look all over for a dress that wasn’t covered in pink or had sequins and rainbows. It’s a little easier to find everyday clothes because T-shirt’s don’t have to fit 100% like dresses do, and black leggings and Nike shorts come in every size. But for dresses, it’s absolutely horrible. And I love dances because when I go to them I feel beautiful. I feel like people are looking at me and I feel great! But the work to find something I like is absolutely the worst!\n\nI also haven’t gotten my period yet, which means I haven’t really gotten a body shape yet. I mean, I guess I’m an a-cup, sometimes a b-cup in bras, which is one of the few things I’m happy about, but my hips are nonexistent. And technically if I measured my proportions, I’m an hourglass but I’m just so tiny there’s barely a difference anybody,  much less guys, can even notice. And everyone’s out there, having a boyfriend and hips and boobs and I’m over here, with one ex, and probably nobody even noticing me, much less taking interest. And I know having a boyfriend isn’t everything blah blah blah, but it’s so hard when everyone else is going through relationships like tissues, and I’m the odd one out.\n\nFor the past 2-3 years I’ve been a solid 86-90 pounds, and it’s always been that way. When I went to the doctor, they said I had gained 3 pounds in 6 months. They were excited about that. They had been trying to get me to gain weight, not that I was underweight, I was just heading that way, and again, I stayed the same weight for 2-3 years. But I just felt awful. I have a love for everything sugary, especially since my mom’s a dietitian, so I’ll sometimes have some ice cream without telling anyone to celebrate a bit. And I’ve done this for years, but now after gaining the few pounds, I still feel the cravings but I feel so so so awful after the fact. I sometimes, especially since I’m off of school for the summer and I can sleep in, justify it by skipping lunch, but I still feel so so embarrassed. My stomach is pretty flat but if you pinch it, there’s baby fat, and it just makes me feel so embarrassed because the baby fat hasn’t gone away yet because I haven’t matured enough physically yet. I’m so afraid I’m going to become anorexic or bulimic or start skipping meals more often, and most of the time when I do it I’m not hungry, but I still feel bad because I’m afraid that it’s going to suddenly make me develop an eating disorder. Which I know is not how it works. \n\nI have anxiety, which I’m probably sure you can tell in this post, and I’m seeing a therapist and I’m getting so much better on the anxiety front and I don’t want to have to go back to weeklies, and I want to be able to deal with this on my own. I know everyone has body image issues, and hates a bunch of stuff about themselves, but I just want to feel beautiful, like I do at dances, more than just twice a year.\n\nEdit: I always feel awful when I express how I feel about my body because people always say ‘omg you’re so skinny/tiny how could you feel that way?’ And like to me I don’t look skinny. I don’t look large, I just feel broad. And logically I know I look like all the other small girls do but I still feel like my shoulders are too broad, and my ribs are too big, despite the size of my ribs/waistline is what makes finding bras really hard because they’re small. It still doesn’t make me feel any better. I know all these things logically it just never connects emotionally.", "subreddit": "BodyAcceptance"}
{"post_id": "c2gss2", "created_utc": 1560949203, "title": "Welp, my family just called my fat ass a burden", "author": "Jumatsuga", "self_text": "My sister told me that she doesn't want to travel abroad with me, because I am a \"burden\" and thus take away HER enjoyment of travelling, because I am \"too fat\", and likely also because I am autistic. Everybody in my family supported her. THANKS, GUYS!", "subreddit": "BodyAcceptance"}
{"post_id": "c2ia8x", "created_utc": 1560957173, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "c2k7iy", "created_utc": 1560966536, "title": "Gaining weight because I'm not starving myself anymore", "author": "Kotokokoro", "self_text": "I used to be obese. A lot of negative life experiences happened (untelated to my weight), and I began to starve myself because I was in a dark place. I lost a ton of weight. I was happier with how I looked, but my mental health was awful. I started going to therapy, taking medicine, etc. and stopped starving myself naturally because my thinking changed. Now I've gained weight, and I'm overweight again. Lately I've been down about how I look and feel like it would be better if I starved myself again. How can I accept my body regardless of what i weigh? Anyone have any advice or experience something similar?", "subreddit": "BodyAcceptance"}
{"post_id": "c2sh7x", "created_utc": 1561011802, "title": "It’s taken 30 years to love my body but I hated it growing up.", "author": "thefashionadvocate", "self_text": "It’s taken 30 years to love my body but I hated it growing up.\n\nI was the tallest kid in primary school, and I was bullied by the boys. I was a twig, but they called me ‘bush pig’, and according to the principal, it was because the boys liked me. They tormented me, and I was so much taller and ‘bigger boned’ than all the other girls, I felt like a behemoth.\n\nKids can be such little twats, but it stuck with me through high school. I went to an all-girls private school too so the comparison was rife. I always felt ‘bigger’ than everyone else, and I was still the tallest girl, sent up the back for class photos. High school was a constant battle with my body, and at 15 I had DD boobs too.\n\nIn my early twenties, I always felt like the wing-woman to my petite, stunning, size six and eight friends, even though I was only a size ten myself. I was always the tallest, and if I wore heels, I towered at 190cm tall. It was rare that guys would come up to talk to me in bars, because it was rare that there were taller guys in the room; I always felt like I stuck out.\n\nI still struggle occasionally with my body, which I think is only human for women who grew up on 90s media and the idea of a 'supermodel', but I love my body now more than I ever have, and it’s a bloody strong body to have trekked me through what it has in the last decade alone.\n\nI have stretch marks that run from my thighs all the way up to my waist. I have cellulite, sometimes on my knees. I have freckles and moles and birthmarks and scars. I’ve been turned down for influencer jobs in the past *because I don’t have a ‘sample size’ body* and the dress won’t fit - which is madness.\n\nWhat I do have, is an awareness of myself and a passion to empower other women. I now choose to work with labels that are size-inclusive, ethical, sustainable and responsible for their impact.\n\nEthical and sustainable fashion is about so much more than living wages and eco-friendly fabrics; it’s about taking responsibility for your impact on those who make your clothes, and those who wear them, and I’m happy to get my rolls out.\n\nWhatever your body looks like, it’s awesome.\n\nThe Fashion Advocate x ", "subreddit": "BodyAcceptance"}
{"post_id": "c2ulrw", "created_utc": 1561028303, "title": "How do I help my bf to accept his body", "author": "sako555555", "self_text": "My boyfriend (18m) keeps telling me that he hates his body, that he can't understand how I could love his looks and how there is too much fat around his stomach.\n\nIn my eyes (and those of many others) he is a very skinny person and his BMI is already slightly underweight. He doesn't believe anyone and keeps trying to diet and eat less.\n\nI want him to be healthy and therefore want to help him accept his (in my opinion beautiful) body. How can I do that?", "subreddit": "BodyAcceptance"}
{"post_id": "c2x7qo", "created_utc": 1561043528, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "c32em4", "created_utc": 1561068720, "title": "I'm slightly disappointed that women on average find bigger penises to be more aesthetic", "author": "RememberTheSubHuman", "self_text": "Nothing related to sex; I just carry this notion that most women find above average penises more visually attractive, and average or below average ones to be more neutral or unattractive.", "subreddit": "BodyAcceptance"}
{"post_id": "c3345a", "created_utc": 1561074410, "title": "I find everyone beautiful but me", "author": "Amaya9", "self_text": "I'm a female in my teenage years and everytime I look at someone, they're so pretty, men and women. However, when I look at myself in the mirror, I see something so absolutely grotesque and abhorrent I can't stand looking at my face. When I was a kid, I never even thought about my appearance but everday now I cant stop thinking about how ugly I am. At one point, I refused to even look in mirrors. I know I'm normal looking and I'm a normal weight but I can't stop being so self-abasing. Doesn't help my peers joke around calling me fat or ugly and so forth. I can't remember the last time someone complimented me and even then, I could probably count the times on one hand. It's not like I'm being outright bullied for my appearance but there were times some of my friends overstepped the boundaries. Now I believe everything they say is true and they're trying to mask the truth as a joke. Though, some days I do feel as though I am pretty but it fades as soon as it appears. Is there any way to convince myself I am worthy of love? I always feel like I don't deserve it.\n\nI just wish I can shift some of my admiration towards others onto myself, but it doesn't quite work.", "subreddit": "BodyAcceptance"}
{"post_id": "c3bugi", "created_utc": 1561130163, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "c3iyzt", "created_utc": 1561164076, "title": "Big head insecurity", "author": "marylilac", "self_text": "I’m a 19 year old girl and I’ve dealt with many insecurities but one that always returns and bothers me is my huge head. I feel like I’ll never have a boyfriend or feel confident in myself because of my head. Ive become obsessive over it and take pictures of it from the side and measure the circumference and it’s way bigger than most girls small heads. It’s like the size of a mans. I just wish I could be like other girls and be normal and pretty. How many people notice head size or have this insecurity? No ones ever commented on my head but I just can’t think about anything else", "subreddit": "BodyAcceptance"}
{"post_id": "c3qsna", "created_utc": 1561216261, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "c3t3qt", "created_utc": 1561228146, "title": "How do I help my friend accept her weight", "author": "ThisNameImaginative", "self_text": "I have a friend who is very insecure about her weight, it bothers me because shes not exactly underweight, but after a medical thing thats over now she is getting there. I’ll oftentimes try to comfort her on it, and she realizes on a logical level that she isn’t overweight and I keep telling her that, not that she looks bad, but shes got so many better traits about her (personality traits, intelligence, etc.). This used to work, but now she says that she knows she doesnt have a problem, but her mind just doesnt leave her alone on a less logical and more emotional level, so nothing clicks. Is there anything I can do or resources I can point her to?", "subreddit": "BodyAcceptance"}
{"post_id": "c3w6e7", "created_utc": 1561245587, "title": "Got rid of all my skinny clothes", "author": "plsresetyourpassword", "self_text": "Just thought y'all would be interested to hear that I got rid of all of my smalls, size 4s and size 6s this past week. I currently wear a size 12, btw. I didn't have any size 8s to get rid of. I decided to keep my size 10s for now. When I was younger my weight would fluctuate quite a bit (I was a chronic yo-yo dieter). Now my body has been staying between sizes 10 and 12 for the last 3 years.\n\nI have not been on any restrictive diets for 8 years and I am eating 3 meals a day now. I will sometimes do a clean eating diet or a whole foods plant based diet or Atkins but I don't obsess over it or restrict. I just eat within the bounds of the diet (like no animal products when I am doing WFPB, or no pasta when I do Atkins, or no overly processed foods when I do clean eating). I don't count calories.\n\nI had been hanging onto these clothes mostly because I wanted to avoid feeling guilty over getting rid of clothes that I spent good money on and on the off chance that I lost weight (I kind of thought my weight might stabilize at a lower weight than I am now). But these clothes haven't fit in at least 3 years and this past week I just felt ready to say goodbye to them. Only damaged clothes were thrown away. The rest were donated to charity. I thought about selling them but the other day I just wanted them OUT of here. BTW this was about 10 trash bags-- basically a full wardrobe of mostly size 6s. Goodbye, clothes! Sayonara! Time to hit up Torrid! LOL.", "subreddit": "BodyAcceptance"}
{"post_id": "c466f7", "created_utc": 1561302949, "title": "Helpful tips or jabs?", "author": "Catladyy96", "self_text": "Hello everyone, I am a 22 female with low self-esteem and weight issues. I still live with my parents but going to college. My weight has always been an issue. I’m not plus size but not skinny. I’m a size 14 if that helps. My parents criticize my size all my life even when I was skinnier. My mom does little digs about my appearance but says they are just helpful tips. What do I do?", "subreddit": "BodyAcceptance"}
{"post_id": "c4a8zn", "created_utc": 1561318367, "title": "Gained Weight... feeling great except when I see the #", "author": "Zeltron2020", "self_text": "So I’m 5’4” and right now apparently I’m 132-135lbs. I have been 115-118 at my thinnest (and coincidentally my saddest) and rested around 125 for about the past year. Well, now I am the happiest I’ve ever been in my life (awesome work life, home life, great boyfriend, things are generally good and I’ve worked hard for all of it). And to be honest, I like my body at this weight. I like my bigger boobs and butt and hips. But I just can’t help but feel bad about myself when I see that number. I’m also afraid of gaining more weight. Being thin gave me a weird confidence but I feel sexy and happy with myself now in a different way, however when I google it I’m apparently right at the edge of “healthy weight” which seems insane because I think I still look pretty small. How do I stop letting this stress me out??", "subreddit": "BodyAcceptance"}
{"post_id": "c4i064", "created_utc": 1561349199, "title": "I feel much happier than I used to but when I see old pictures I want to be skinny again", "author": "daisy_storm", "self_text": " \n\nIve been on a journey to love and accept my body after struggling for years with disordered eating and a really bad relationship with my body. As of right now, I feel more comfortable in my skin and have less thoughts of body hatred than ever before. But there is one problem, whenever I see old pictures of myself when I was skinnier I think I objectively look so much better so its hard not to go back to the thoughts and behaviors that resulted in weight loss. I try to remind myself that I wasn’t happy in those photos but its hard not to get sucked back in when I look at how much weight ive gained since", "subreddit": "BodyAcceptance"}
{"post_id": "c4nrh3", "created_utc": 1561382577, "title": "Eye color issues", "author": "[deleted]", "self_text": "I have brown-slightly green eyes that are the color of sewage.\n\nI am a synesthetic person, which means I associate colors with concepts, and my eye color to me is associated well, with sh\\*t. Another problem is that my iris looks like a mess, not the radial one most attractive people have. It literally looks like someone edited a picture of poop between the pupil and the white eye stuff.\n\nI once met a girl whose eye color was that of seaborgium element (Z = 106). This was my synesthetic association. In average human terms, it was blue, hazel and black combined together in an awesome way. I have so many different synesthetic associations to other people's eye colors, but to my eye colors, fecal matter is the only thing I can think of. \n\nSecond body image issue is that my body is nothing unique. I wish I had something rare that manifests physically, not mentally. I want to have something that is unique and can't be copied.", "subreddit": "BodyAcceptance"}
{"post_id": "c4oe5k", "created_utc": 1561384986, "title": "Gained weight abroad, don't know how to handle it.", "author": "FrostyHorse", "self_text": "I am going back to Mexico after being 6 months in Spain, but I gained some weight and I know there are going to be some people that will mention it and I wouldn't know how to react. I just don't want the feeling of embarrassment keep me from going out with friends or visit my family, but I know people (specially my family)  will mention the fact that I got fat so, should I mention it before they do? should I have a sassy response for when they say something about it?", "subreddit": "BodyAcceptance"}
{"post_id": "c4pdwd", "created_utc": 1561388581, "title": "Meta Monday: No Stupid Questions", "author": "maybesaydie", "self_text": "Have questions about weight loss, calorie counting, fitness or nutrition? Ask here and the community will do its best to give you an answer. No rants please.", "subreddit": "fatlogic"}
{"post_id": "c4wlem", "created_utc": 1561413404, "title": "Last name", "author": "davepol", "self_text": "I know this is a body acceptance sub, but I'd like to submit to you all a story from my past that involves another aspect of ourselves that many of us can or cannot change: our last name.\n\nI'm a male with an unusual Slavic last name. As a child, I was picked on mercilessly by my classmates as teachers struggled to pronounce it, so much so that I would go home at night in tears. One day, I told my mother (who was from Russia) that I wanted to change it. She asked me why, and what I wanted to change it to. \"I don't know?\" I replied. \"Something American like Anderson or Johnson?\" She went on to tell me that I had a strong and wonderful last name, and that one day, I'll be glad it's different instead of plain, boring, and just like everyone else's.\n\nFast forward many years later. I'm a Technical Writer doing a contract gig at a large Pharmaceutical company. The person I answered to at the company, a female, would always refer to me by my last name as people, for whatever reason, often do--which at this point in my life, I didn't mind. As I neared completion of the project I was working on, she asked me if I minded that she called me by my last name? I told her that I didn't. She goes on to say that \"the reason I do is because I like saying it. Your name is just so interesting and beautiful!\"\n\nMy mother was right, and I'm glad she talked me off of that ledge many years ago. I guess we really need to love and accept ourselves just as we are, and to celebrate our differences instead of wishing we were someone else.\n\nJust wanted to throw that out there, take from it what you like. Thanks for \"listening!\" :-)", "subreddit": "BodyAcceptance"}
{"post_id": "c4z46h", "created_utc": 1561422774, "title": "Advice???", "author": "Catladyy961", "self_text": "Both my parents criticize my weight. My dad oinks and calls me a pig. My mom thinks I have lesser value because of my size. She told a couple days ago that I looked pregnant and she hopped no one noticed. I just got off my period. Or one I was getting up from sitting down and she told me to pull my shirt down because it was embarrassing. My mom is petite and smaller in size but still has problem areas herself. In a way I am bigger but my body is tighter. If that makes sense? My parents have been on my weight even as a kid. I was skinny but had a butt. I lost 40 pounds and they would tell me 15 more and I would be good. I still thought I was fat and gained all the weight back. My mom likes to embarrass me in front of guys and will some how bring up my weight. She said I was a 5 out of 10 because of my weight. (I asked don’t know why). She said my face is puffy and my arms. When I went to the doctor she looked to see what my weight was even though the nurse wrote it down. She likes adding extra pounds too. She is a nurse and if she was concerned about my health, know how to approach it. She thinks she is better than in appearance and in social life. My mom always uses this self deprecating voice when she talks to me. She is not a warm supportive mother I always wanted. I don’t want to be in competition with my own mother. She is a 55 year old woman betraying her twenty something daughter. I am dependent on them right now and have no clue what to do.", "subreddit": "BodyAcceptance"}
{"post_id": "c59zjb", "created_utc": 1561475548, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "c5hmkf", "created_utc": 1561505909, "title": "Huge difference between mirror image and photos?", "author": "[deleted]", "self_text": "And I don't mean photos with other people in who I'm comparing myself to. \nThe difference between a selfie and how I look in the mirror is horrifying.\nMy mirror image i could live with. My photo however...if that's the more accurate one then I'm surprised someone hasn't tried to kill me with fire.\n\nIs this in my head? Or an actual thing? I've read about true mirrors and I'm becoming increasingly concerned that I am 10x more ugly than I thought I was.", "subreddit": "BodyAcceptance"}
{"post_id": "c5ktmt", "created_utc": 1561521735, "title": "Great doctor", "author": "[deleted]", "self_text": "Ive been putting off seeing my GP for two years and finally went. One major problem is I was afraid of weight-shaming.\n\nYall. She was amazing. She literally said to me to stop listening to what fools say about my body. She said it’s good Im eating more, it is better for my health. She even said Im really strong for my recovery.\n\nIm still fat, objectively I weight above what people think I should and look it. but I am healthier in my lifestyle than when I was so poor and mentally ill I wasnt eating.\n\nI wanted to share this bc I listened too much to people who arent even doctors (and occasionally Ive seen nonsense from doctors too, studies showing issues etc)  but those people do not truly understand what theyre talking about.\n\nYou know your body, lifestyle, life better than anyone, even the negative voices in your own head.", "subreddit": "BodyAcceptance"}
{"post_id": "c5oc5b", "created_utc": 1561546110, "title": "Spirituality and Body Image", "author": "ginabobeena", "self_text": "Hi all,\n\nI am researching the effects of spirituality on body image and am looking for participants to complete a short online questionnaire about their beliefs and experiences.\n\nTo participate you must be over 18 and read and write English.\n\nTo say thank you for participating, you will be entered into a prize draw to win a £20 Amazon voucher.\n\nIf you have any questions please let me know. My contact details and more information can be found via the following link:\n\nhttps://bathpsychology.eu.qualtrics.com/jfe/form/SV_2t4aTgWESyRmYoB\n\nPlease pass this on to anyone else who may be interested.\n\nThank you for your help!", "subreddit": "BodyImage"}
{"post_id": "c5r0sq", "created_utc": 1561562004, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "c5sl31", "created_utc": 1561569656, "title": "I think I'm pretty. Yet other people (and photos) tell me otherwise?", "author": "Throwaway6464747", "self_text": "I'm not sure what's going on here, so hopefully some of you can help me. Bear with me. When I look in the mirror I like my appearance most of the time, depending on lighting etc. however, other people's reaction to me has me confused. I've done decently with romantic and sexual relationships and those partners, as well as many of my friends (moreso when I was younger), have told me I'm beautiful. But when I'm out and about with someone, I'm always \"the friend\" that doesn't get flirted with. Men will approach my friend, tell them they're beautiful, then either completely ignore me or say hi out of politeness. Even if the friend is someone who I consider average looking. Plus I barely ever get catcalled. Now I'm not looking for attention from strangers and I understand people have different preferences, but it's happened so consistently and never the other way around, that frankly it hurts and makes me doubt myself. I feel like strangers on the street are the most impartial judge, no? Plus, even one of my best friends has said \"you're not ugly\" but implied she didn't think I'm pretty. Photos and videos of me that I see, seem to back this up. So really I'm just confused. On one hand, I have the mirror, myself, some men, and some friends, telling me I'm attractive. On the other, I have photos, videos, strangers and some other friends saying I'm not. So..what is going on? Thanks for your help in advance.", "subreddit": "BodyAcceptance"}
{"post_id": "c5uhbb", "created_utc": 1561577389, "title": "Just some strategies that help me be body positive", "author": "Shuiner", "self_text": "(on mobile sorry if formatting is trash)\n\nMost of the posts on this sub seem to be by those struggling with body image. I wanted to share the thoughts and mental exercises that help me the most. These don't apply to everyone or every problem, but I hope this is helpful to some.\n\n\n1. **Therapy** If you struggle daily, it's something to consider. I did cognitive behavioral therapy for years through a local University (affordable that way) and it changed my life. Many of the points below were things I learned in therapy.\n\n\n2. **Stop focusing on myself so much** Best thing my therapist ever convinced me to do was Volunteer. I spent so much time thinking about my body, and what others thought of me. Volunteering helped me recognize that my attractiveness means little to the world. People in need don't care what I look like. I can do good in the world; my looks can't. Spending so much time thinking about myself was a pitfall that stopped me from being the good person I wanted to be. \n\n\n3. **Think of my body like a friend** Imagine you have a friend that is there for you no matter what. Day in and day out without question. They have flaws, but they never give up. That's your body. It works nonstop to keep you alive and as healthy as it can. Instead of resenting it, have some compassion for it. It didn't ask to have an owner that hates it. It deserves to be respected and loved. Separating myself from my body really helps me feel more loving towards my body.\n\n\n4. **Stop comparing my body to others** Easier said than done, I know. Similar to having compassion for my body, I had to learn compassion for those around me. I no longer reduce a beautiful person to their body. They don't deserve to have me dehumanize them. They are humans with insecurities and struggles. Their bodies don't make them better or worse people. Their beauty isn't some magical key to happiness. My envy is completely misplaced.\n\n\n5. **Seek out positive examples of bodies like mine** One of my main issues was that I'm fat (sorry for those who don't like that word but it's the one I prefer), and there's a lot of public negativity towards that. But when I actively seek out positivity from fat people, it helps me feel more confident. I follow plus size blogs, YouTube channels, etc. I see a person my size wearing cute clothes and think they look nice, then it's easier to think I look nice. I honestly like clothes shopping now, which would seem crazy to old me.\n\n\n6. **Accept your feelings** This, for me, is especially helpful when someone does say or do something hurtful regarding my body. I get body shamed a good amount, and no matter how much I generally love my body, it hurts. And that's okay. I don't have to be a super woman who doesn't let anything bother me. I accept when my feelings are hurt, give myself time to cry or get angry, then try to gently pull myself away from those negative thoughts by doing all the above steps. \n\n\n7. **I only have this reality** Some things you can't change. You can't make your hip bones narrower or shoulders broader. Some things won't change. I work to improve and be healthy, but it's likely I'll always be considered fat.\n\nDo I want to look back at these years and say \"I'm so glad I spent thousands of hours obsessing about not liking my body.\"? Or do I want to know I lived the best life I could with the hand I was dealt? \n\nI decided to be the person I dreamed of being in the body I have, instead of waiting for the body I thought I needed. I'm far from perfect, but I'm so much happier this way!", "subreddit": "BodyAcceptance"}
{"post_id": "c5vruq", "created_utc": 1561582584, "title": "Males 18-30 from the UK needed for body image research", "author": "GAC47", "self_text": "An online study investigating interventions to improve male body image in need of participants. The initial survey is about 30 minutes including questionnaire and a video. \n\nThis is important research and I would really appreciate those who can take part. All Responses are anonymous and there is a chance to win an Amazon voucher.\n\n[https://bathpsychology.eu.qualtrics.com/jfe/form/SV\\_82Ec7ZnabDV6ZLL](https://bathpsychology.eu.qualtrics.com/jfe/form/SV_82Ec7ZnabDV6ZLL)\n\n&amp;#x200B;\n\nThank you!", "subreddit": "BodyImage"}
{"post_id": "c5yqv1", "created_utc": 1561596369, "title": "I don't know where else to put this, but I have horrible self esteem.", "author": "BatDamon1", "self_text": "Hello, I'm 16 and a \"girl\" (It's in quotes because I'm more of a fem non binary who was born female) but ever since I was a kid I've always hated the way I looked, I've tried everything... I lose weight, I gained wait, I tried the whole \"fake it till you make it\" thing and nothing has worked, because each time I feel good about myself I just go back in and destroy myself all over again. So I don't know what to do, because now this low self esteem effects almost every aspect of my life, it effects what I wear, how I sleep, how intimate I get with my boyfriend, and for the most part how I think. I think everyone can see every little thing that's wrong with me... right down to the fact that maybe I'm more masculine looking that I am female. And I know I can't always rely on people telling me I look good. I have a personal problem that will always effect how I think I look, but apparently it's not a big deal. \n\nSo does anyone have some tips to help me feel more comfortable in my skin?", "subreddit": "BodyAcceptance"}
{"post_id": "c5yttq", "created_utc": 1561596862, "title": "How do I handle body acceptance when looks are important to my future career?", "author": "Cosmic_Crossing", "self_text": "I’m (20F) currently studying Journalism in preparation for getting a job in the media industry. It’s what I’m good at skill wise and what I want to do.\n\nHowever, in most areas of the industry, looks seem to be very important to the point where people below average aren’t given as many jobs. This is especially true for women in the industry. I still really want to do it but as a below average/ugly woman, I don’t really have much of a chance.\n\nCurrently while I’m still in college for another year, I’m on a mission to “give up or glow up”, but that’s been wreaking my confidence and self esteem. But I don’t have a choice if I want a fighting chance.\n\nSo how could I handle this?", "subreddit": "BodyAcceptance"}
{"post_id": "c63nfa", "created_utc": 1561629584, "title": "upset about something kinda weird", "author": "IWantToDieThrowAway9", "self_text": "Throwaway account so my online buddies won't see this. Like the title says, I'm really upset about something weird. It's considered kind of socially unacceptable even to be upset about this. Looking for advice. If this is the wrong sub for this, please direct me to a better sub. I wasn't sure where to go with this.\n\nLike most males born in America, I was circumcised as a newborn. I despise it. I despise it. I despise it. There are no words adequate enough for me to describe how much I deeply hate it. Circumcision has destroyed me. I kept hearing the words \"circumcision\" and \"foreskin\" every now and then through adolescence and always thought \"thank god my parents aren't religious.\" So I always figured I wasn't circumcised. In reality, I had a mild botch. The doctor took off too much skin, which makes erections feel painful and tight. I realized that I was circumcised on my 18th birthday when I saw my first intact cock in porn. At first I thought the guy just had a cool genetic mutation or something. I was curious about what was going on here, and I remember when I realized I was circumcised jumping up from my seat in horror like there was a rat or snake on my desk. Suddenly, the pain and some of the other problems I've had with my penis started making sense to me. I'm at peace with the rest of my body, but I absolutely hate that I was circ'd. I've never directly confronted my parents over this, but I've brought up the subject a few times in casual conversation. Apparently, the reason they had me circumcised was so I could match my father. Fuck. They each think foreskins are \"weird.\" If it were done because the doctor pushed for them to do it or because I had a medical emergency that couldn't be treated with more conservative methods, I think I could handle that better. But because they wanted me to match my dad, that makes it so much worse. Why couldn't they have just respected my bodily integrity? I'm in a pretty progressive part of the country where circumcision was quite a bit rarer the year I was born compared to other states. What the fuck? It's not okay. I'm constantly depressed. I wake up every morning, and there's a split second where I forget that I'm circumcised. It's the happiest part of my day. That split second seems to get shorter and shorter as the mornings pass. I genuinely believe circumcision is the worst thing to ever happen to me. It's worse than when my ex gf cheated on me with my best friend, it's worse than when my sisters disowned me for seemingly no reason, it's worse than the bullying I received as a small child, and it's worse than my parents getting divorced. This is, by a landslide, the most difficult thing I've ever been through. I honestly do NOT understand how so many guys can be seemingly content with being circumcised. I feel completely at odds with the world.\n\nI basically can't look at my parents anymore without filling to the brim with rage and disgust. I fantasize every day about killing myself so I can hurt them back. But I think I won't. I'd rather just feel better about this and live my life as originally intended. There are a couple things I've tried to feel better about this. The first is foreskin \"restoration\" where guys basically stretch out their remaining shaft skin to create a \"fauxskin.\" It looks and acts like a foreskin but without the nerves or supporting structures. This is a very long and physically painful process. I've done some of this, and it has made erections less tight. The other thing I've done is give to Foregen, which always makes me feel better. They're a group that wants to use regenerative medicine to grow back foreskins. IIRC, they're on animal trials. I've tried my hand at activism, but I don't think any of the existing anti-circumcision activism is radical enough. But that's a rant for a different time.\n\nMy question is simple. Since I have a long time to wait before I can restore the whole \"fauxskin\" or get the real deal with Foregen's regenerative medicine, what are some things I can while I wait to feel more at peace? I'd also like to take my mind off of it, but that's really difficult for me. Sorry again if this is the wrong sub for this.", "subreddit": "BodyAcceptance"}
{"post_id": "c66pc6", "created_utc": 1561648343, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "c6g7y1", "created_utc": 1561699526, "title": "How can i love myself always instead of just sometimes???", "author": "throwaway20094x4", "self_text": "I (28F) am 5'2 and float between 150-160 lbs when I'm not to trying to control my weight. I have always been very petite and was super short and skinny in high school. I've had 4 children in the past 10 years which is when I first put on weight and my body changed drastically. I have been really happy recently with my size and the feeling of being curvaceous and \"thick\". My husband claims to love my size and doesn't want me any smaller and not a whole lot bigger. Although, I have been bigger and he has never protested. I like my looks as far as my face goes and id say that I am of average to mildly exceptional good looks. I'm by no means striking or gorgeous. My issue comes to light when I am around other women. I start to compare myself to them and becoming embarrassed of my body if i feel as though they are smaller or thinner than me. Almost to the point that I assume they're secretly judging me. My husband's sister will be in town soon. She's gorgeous and fit. Her children are not much younger than me and they're all gorgeous and fit. When they visit the whole family comes together to catch up and that is when I am around both my husband's sister and his brother's wife, whom is very very thin. So when we're all together I will be the biggest one of us all and I cant help but dread how I'll feel. I want to love my body always and feel good the way I am. I am healthy. I am very happy with my life ( which is when I'm the biggest. If I'm depressed I'll lose weight like it's nothing). How can I stop comparing myself to other women and gauging my self worth on how others may see me?  How can I be confident always and learn to love my body unconditionally?", "subreddit": "BodyAcceptance"}
{"post_id": "c6le1q", "created_utc": 1561734896, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "c6uz55", "created_utc": 1561785838, "title": "Please help: transgender body issues", "author": "SidewalkFlower", "self_text": "I'm feeling really bad about myself and about my body right now. I am transgender woman and I had a really awful conversation with this person last night who told me that I disgusted him, I am living a lie, I have mutilated myself, and my body is a poor imitation of a female body. He seemed so full of shit that at the time I thought it didn't bother me that much and I brushed it off. But now I'm finding his words stuck in my head, and it's really weighing me down. It doesn't help that I haven't had any sleep in more than 24 hours. Please help me if you can, even if it's just by sharing a few kind words.", "subreddit": "BodyAcceptance"}
{"post_id": "c7020x", "created_utc": 1561821142, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
