{"post_id": "c7lxbh", "created_utc": 1561941865, "title": "i’m tired of living this way. my self esteem is ruining my life", "author": "dontlikemybod", "self_text": "if this is the wrong sub i’m very sorry, please let me know. i thought this might be a good place to post just because of all the people struggling with accepting themselves, and i’m feeling the same way \n\ni just have nobody to talk to about the issues i have with my body, and frankly, i don’t want to because they’re all so embarrassing. what kind of self-involved person focuses this much on their appearance? me. i do! i can’t really talk to my boyfriend at all because he gets upset with me over the way i approach the conversation. i’ve tried what feels like a million different ways, and it seems to turn into an argument no matter what. yes, occasionally i get a little upset with myself so my voice will shake and i talk louder to counteract that, so it sounds like i’m raising my voice, but i’m not trying to do it maliciously. i don’t know how to talk to him about the issues i have without him feeling like i’m accusing him of something. i just hate, hate, hate my body. i didn’t ask to look like this, i don’t want to live like this, i’m tired of seeing my stupid fucking figure when i look in the mirror. i want to just disappear. \n\nit would just be so much easier if i wasn’t born, you know? nobody would have to put up with my dysmorphia, not even myself. i cry almost every day, and i have every single plastic surgery procedure i want planned out, all the way down to the doctors i’m interested in seeing. the only thing stopping me from going through with it is money, but the minute that issue is taken care of, i’m sure i’ll be under the knife. i feel repulsive because i’m not a real woman. my body isn’t recognized as being sexy, attractive, or worthy by any kind of body positivity/mainstream source, and i’m so sick of feeling like absolute fucking shit. i’m exhausted. i’m just so mad at the world and myself that i’m losing my train of thought, and i can feel myself tumbling away from any hint of a topic for this post. \n\ni just look at myself and feel disgusted. i avoid mirrors before showers, i don’t look down while i’m changing, i shy away from the touch of my SO. i’m embarrassed of the skin i’m living in and just want to hide away under layers and layers of clothes, and with the temperature change, that’s only getting more difficult. i can physically FEEL my imperfections, and just want them to go away.im at a total loss. \n\nthanks for reading if you got this far. hopefully none of you feel as badly as i do.", "subreddit": "BodyAcceptance"}
{"post_id": "c7mf5u", "created_utc": 1561944931, "title": "Any advice on loving yourself?", "author": "MurderMysterySton3r", "self_text": "I struggle a lot with my self image due to past traumas and my eating disorder. I have people constantly telling me that I am beautiful but I just can't seem to make myself believe that. It feels like I am lying to myself when I tell myself I am beautiful. I am lost as to where I should even start the whole self love journey again. I fear my ED is getting worse as well which is dragging my self esteem down like a mf. I would much appreciate some advice on where to start or how others were able to get through problems such as these or even their own journeys of self love.", "subreddit": "BodyAcceptance"}
{"post_id": "c7ttka", "created_utc": 1561994253, "title": "Hey, hey it's Meta Monday", "author": "maybesaydie", "self_text": "# A few announcements:\n\n* Selfie post coming this Thursday, July 4th. Get those progress pictures ready.\n\n* We've been seeing some weak titles lately. \"Found on _________\" is not a descriptive title.  Particularly poor titles may be subject to removal.\n\n* As always, hate, threats of violence, dehumanizing language, personal attacks and generally shitty behavior will have consequences. \n\n\n# Complaints, compliments, questions or conversation? Make a comment below.", "subreddit": "fatlogic"}
{"post_id": "c7xfnz", "created_utc": 1562005266, "title": "Looking for recommendations on body acceptance media", "author": "OhHiMarco", "self_text": "It’s tough to weed out the bullshit, or find the advice that makes it all seem too easy. Could anyone recommend any solid resources for body acceptance (preferably books and YouTube). Extra focus on men in their 20s and man boobs. I don’t give a shit about looking feminine I just don’t like all the attention they draw, pretty much exclusively from other men (rude remarks and SO MUCH TOUCHING IN THE FUCKING WORKPLACE). anyways, yeah recommendations would be deeply appreciated I’m so tired of being uncomfortable in my own skin", "subreddit": "BodyAcceptance"}
{"post_id": "c80j05", "created_utc": 1562017068, "title": "Tubular breast ?", "author": "findomqueenanissa", "self_text": "Hey I’m making this post because I don’t know where else to ask, my areola is almost transparent you can literally see my veins and it’s the same color as my breast, it’s also really puffy. I have one breast bigger than the other, and they’re kinda saggy but they don’t look exactly like the google images (super small and pointy). I would like to know if any of you have the same problem or if you know what I might have,", "subreddit": "BodyAcceptance"}
{"post_id": "c85s2f", "created_utc": 1562048821, "title": "Seeking body positive scoliosis art", "author": "WesThePretzel", "self_text": "I’m having trouble finding any “body positive” art of deformed/disabled people. I was specifically looking for drawings of people with scoliosis. Not just anatomical sketches, I’m talking fanart or someone’s OC type of thing. Can anyone point me in the right direction?\n\nIn art history, famous artists often drew a woman’s back because a woman’s back is very sensual. But those artists never drew a curved spine like mine, and as far as I can find there still isn’t anyone drawing it.", "subreddit": "BodyAcceptance"}
{"post_id": "c8ae7f", "created_utc": 1562080303, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "c8ejbe", "created_utc": 1562099059, "title": "30F Body Dysmorphia and Bathing Suit Fear", "author": "PiscesJoy", "self_text": "Does anyone have any tips on overcoming anxiety about being in a bathing suit in public or about overcoming body dysmorphia? I believe I suffer from body dysmorphia primarily as a result of living in Los Angeles surrounded by impossible (and surgically altered) beauty standards as well as social media always shoving highly curated accounts of perfect looking women in our faces.\n\n&amp;#x200B;\n\nI have never been the most confident person ever, but lately, it seems to be getting worse. I'm not sure if I've actually gained weight since the last time I felt comfortable in a bathing suit or not. Basically, I'm questioning my reality and if I'm seeing myself as I really am in the mirror. My friends, family, and boyfriend all think I'm way too hard on myself and tell me I'm beautiful.\n\n&amp;#x200B;\n\nI am a very normal weight, some may even say thin, but I just don't see myself that way. I do not suffer from any type of disordered eating. I try to eat as healthy as possible, but indulge fairly often and don't restrict myself much but lately I find myself feeling more guilt surrounding my indulgences and wondering if the women I see with the ideal bodies ever indulge like this, I think to myself that they must not and I should be more disciplined. I'm worried about going down a dark path when it comes to an unhealthy relationship with food, but I wouldn't say I'm quite there yet.\n\n&amp;#x200B;\n\nI also don't work out nearly as much as I should and the fact of the matter is that if I did, I probably could easily achieve a body I'm more confident with, but I have the hardest time being motivated and just continue to hate on my body without doing anything about it. I definitely will start working out more just for health reasons and to manage my anxiety, but I'm sure if I got more toned, I'd still find things to be insecure about, so I want to get to the source and find out how to be confident with myself no matter what.\n\n&amp;#x200B;\n\nI am going to the beach with a bunch of friends on the 4th of July and I want to just be excited to spend time with friends and have fun but instead, I'm panicking about being in a bathing suit. The last time I went to the beach with this crew, I didn't even bring a bathing suit and everyone else was in their suits just enjoying themselves and I was envious of that and not even paying attention to their bodies. I'm sure they all have their own insecurities and no one had \"perfect\" bodies. I decided this time, I want to join everyone else and wear a bathing suit and face my fears. Any advice would be so welcomed!", "subreddit": "BodyImage"}
{"post_id": "c8gpla", "created_utc": 1562110163, "title": "I have excessive body hair and it’s ruined my life", "author": "7ammy30", "self_text": "I’m a girl with excessive body hair and I’ve fallen into a deep depression. I was just looking into a mirror and saw that my chin hairs have gotten noticeable and bad. I have an entire patch of dark peach fuzz on my chin. I have an entire layer of dark hair all over my body. My legs and arms are fucking atrocious. I mean does any guy want a girl with chin hairs and thicker leg hair than him? I want to disappear 🙃", "subreddit": "BodyAcceptance"}
{"post_id": "c8jj80", "created_utc": 1562127326, "title": "Accepting my crooked eye", "author": "ProgAce23", "self_text": "So as I mentioned a while back, I used to feel super insecure about my lazy eyes, now just my left eye after corrective surgery.  Recently I have come to realize that it isn't such a big deal, especially since others around me have the same uniqueness (mostly people I encounter at my job). Famous people such as Marty Feldman and Jean Paul Sartre have also given me hope that I can become something despite a minor deformity.", "subreddit": "BodyAcceptance"}
{"post_id": "c8jjlj", "created_utc": 1562127394, "title": "More scared of being in a bathing suit with my mom than being naked with a new partner", "author": "YouCanCallMeAllee", "self_text": "My mom is an amazing woman, but she is one of the major causes behind my body image issues and eating disorder. She didn’t do it intentionally, but she taught me from the very beginning that being conventionally beautiful and thin is the most important thing. She is very harsh about her own body, consistently diets and restricts, and I inherited all of that by watching her.\n\nLast year, around my birthday (August), she and my dad were giving me grief about having gained weight. For context, I was around 100 pounds in high school and most of college. I’m now 24, and I’m 148. I have a small frame, so it’s quite a clear difference. I already was having issues with the weight gain myself, and their reaction made it so much worse. I’ve always dealt with disordered eating but they plunged me into a full blown ED. \n\nI ended up having a breakdown the next day while she and I were on a walk, and since then she’s tried to be better. But it still comes up.\n\nNow, we’re leaving for vacation on Saturday and we’ll be in bathing suits most of the time. I’m bringing a two piece and a one piece, but I’d like to get an even tan with the two piece. I am, however, very nervous about being this uncovered with her around. I’m more nervous than I was when I recently slept with a new partner for the first time, which to me seems hilariously sad.\n\nI’ve already asked her to follow one rule this trip: absolutely NO negative body talk. She agreed, so I’m hoping she honors it.\n\nThis is more of a rant than anything else, but if anyone has advice, I’d be very grateful &lt;3", "subreddit": "BodyAcceptance"}
{"post_id": "c8p9dc", "created_utc": 1562166781, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "c8xrt9", "created_utc": 1562212055, "title": "Adult male, very self-conscious about chest and to a lesser extent, being \"uncut\" down there", "author": "PhilipOliverHoals", "self_text": "I'm an adult male in his 30s. I'm writing this to get some outside perspectives but also perhaps as a catharsis for myself, as I find getting things out there can help in its own way. I've been taking steps in recent years to grow more as a person, and I've made some good progress, but one of my major weaknesses is that I have a pretty low opinion of my own body. This affects me most when it comes to my relations with women.\n\nAnyhow, I've been extremely self-conscious of my chest since around puberty... so I guess that means about 25 years or so :/ My areolae area is much pointier than the vast majority of men, even men who are quite obese and have large \"man boobs\". Even their \"boobs\" are still sort of rounded, whereas I feel my chest is pointy. I feel this is very obvious and I hate how it looks when I wear T-shirts and stuff. Tank tops or \"wife beaters\"? Forget it. No fucking way I am wearing those outside the house. In recent years I've started wearing undershirts most of the time, even in the summer. It does a little to help reduce the visual effect I feel. I'm pretty sure that I just have larger than normal glands for a man, AKA gynecomastia. I can count the number of times I've gone to the beach and/or taken my shirt off in public on one hand.\n\nMy weight fluctuates from being sort of chubby to being in decent/average shape, but even when I've been in very good shape, my chest is still \"pointy\" and it really makes me extremely self-conscious. It also discourages me from staying in shape because I feel like no matter how hard I work out, that is always going to be there ruining the way I want my chest to look. Anytime I hear a casual mention of \"man boobs\" it makes me kind of self-conscious, and it's even more anxiety-inducing if I overhear people (especially women) joking about guys with man boobs, etc.\n\nSome of this is likely tied to a few experiences during puberty, one of which being a few of my friends at the time chasing me around and like grabbing or pinching at my \"boobs\". Another incident was some chick in my class said I should get a training bra :/ Now, I'm all grown up now, but I recently remembered those incidents and it sort of made me bummed out that this never went away even after \"baby fat\" did. I've come to be a \\*little\\* bit more accepting of this as I've gotten older, but there is also a part of me that really wants to save up money and get gynecomastia surgery. Yet another part of me says, \"No, you shouldn't have to do that! You should try and build more confidence!\"\n\nAs for the other thing... I sometimes hate is the fact that I am an American man who is not circumcised. I mean 90% of the time I don't really think about it, but any time I think about maybe wanting to pursue a woman sexually, I do get a bit self-conscious. Perhaps more specifically I hate the fact that people in the US have been brainwashed for over a century to think that being uncircumcised is bad. The worst part is that I know it is completely fine and normal, but that's still not a widely accepted thing in the US... after all, this is how men are born, and all the nonsense about \"it's safer\" or \"it's more hygienic\" is actually complete horse shit/religious propaganda. The vast majority of the world does not circumcise their boys. The facts are that as long as people bath regularly, both sexes genitals are perfectly hygienic.\n\nBut anyway, the reality is that I am not planning to move where uncut penises are basically the norm (Europe and Asia) just to feel comfortable being naked in front of a woman. and it seems American women are generally just grossed out by uncircumcised penises. I have not really felt comfortable mentioning it to women, and in sexual situations, I usually don't request blowjobs or if a girl wants to give me one, I basically hold my dick the whole time in a way that sort of hides that I'm uncircumcised. It's not really that obvious when you're hard anyway, but I'm still paranoid. The exception to this was a woman I dated about 10 years ago... not long after meeting, but before dating officially, the topic of circumcision came up at a party (I know wtf right??) and I quickly mentioned that I wasn't. Her response was one of cautious intrigue, and the next week when I saw her at another party and we were both drunk, she was very flirty and told me that she had Googled uncircumcised penises and she thought that it was kind of sexy. Needless to say, that boosted my confidence through the fucking roof and unsurprisingly she ranks #1 on the list of girls I've dated that I felt the most comfortable around physically.\n\nBut still... It's been so ingrained into the American mindset that it's bad that it's common for it to be joked about in TV or film as if it's this sickening and terrible deformity. I remember an episode of a show from the 90s called Caroline in the City where basically the WHOLE PLOT of one episode revolved around the main characters anxiety/uncertainty about the fact that her new boyfriend was uncircumcised. The whole episode was filled with dumb jokes and all sorts of giggling with her girlfriends about it. Like WOW, way to make an adolescent boy feel even more self-conscious than he already is! Fuck.\n\nAnother more recent example is the film Bad Moms... there is this whole scene of them helping Mila Kunis get ready to go on a date and the one woman is just going ON AND ON AND ON about how awful it would be if her date ends up being uncircumcised... like OH SHIT! That would just be sooooo terrible. I remember watching the film with some family members, including my dad, which was fucking weird because he was laughing his ass off along with everyone else, even though I'm sure that on some level he would know that I wasn't circumcised?? I mean that's a decision my parents made when I was born. So I felt extra self-conscious and awkward with that. I mean look, I know there are jokes about women with \"flappy\" vaginas or whatever you can think of, but yeah... the whole hatred of uncircumcised men can really be discouraging, because I feel that my dick is pretty \"good\" otherwise in terms of length/girth.\n\nIn the end, these two areas of self-consciousness make me self-conscious about being naked in front of a woman. It also makes me shy away from women touching me, especially the chest area. It also makes me self-conscious if I want to perhaps date a smaller breasted women, because I find them to be perfectly beautiful and sexy as any other women, but I worry that they would find my \"man boobs\" sort of weird. I also have never really let a woman have full control of my dick, i.e. letting her stroke it or suck it without me trying to hide the fact I'm uncut. So basically what that all means is that the vast majority of my sexual experiences have been in low light or darkness, and that I was often buzzed or drunk to help me loosen up.\n\nI guess I'm not really sure what I expect from posting this, but perhaps advice from other guys in a similar position would be good, or also thoughts from women about how they perceive guys like this.\n\n**TL;DR** \\- I am self-conscious about my body, especially in situations where being shirtless or naked is expected. Specifically, I'm very self-conscious about having a \"pointy nipples\" AKA gynecomastia, which does not go away even if you get into great shape. The areolae are also sort of large in general imo. Also sort of self-conscious sexually due to having what I consider to be a totally natural dick, AKA I am uncircumcised AND I'm American, where it seems society seems to practically think being uncircumcised is a disgusting deformity or medical problem. Of course the reality is that it's perfectly normal and healthy, but it does still make me less confident sexually because I know that a majority of American women (and men tbh) are misinformed and basically brainwashed to think it's bad. I have basically done everything in my power to hide both my chest and my uncut cock from women, usually by having sex in dim or dark conditions and preventing them from touching me in certain areas without me sort of \"controlling\" them.", "subreddit": "BodyAcceptance"}
{"post_id": "c8yzgk", "created_utc": 1562220179, "title": "🎆🎇🧨🧨🎇🎆r/fatlogic selfie day is here!🎆🎇🧨🧨🎇🎆", "author": "maybesaydie", "self_text": "Time once again for this glorious occasion. Post those progress pictures here and show us the results of your hard work.  Please no pics of children.", "subreddit": "fatlogic"}
{"post_id": "c93ojb", "created_utc": 1562253068, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "c94moj", "created_utc": 1562258161, "title": "I wish there was more big/crooked nosed representation in the media", "author": "artnbio", "self_text": "I don’t have a crooked or big nose so this doesn’t apply to me. I do have a flat nose (derogatory: pan face). I remember always though that having small slender noses were and still are conventionally attractive in social media. It sucks that many women (and men too) are ridiculed for having big noses, “tomato” noses, crooked noses etc.\n\nI admired characters such as jasmine from aladdin from having a slightly bigger nose than other princesses. So when the live action, Aladdin, came out, I was a bit disappointed that the actor for jasmine has a petite nose. Naomi is great— I just wish that there was representation of a bigger middle eastern nose. \n\nIt saddens me to know that many women get rhinoplasties because they felt insecure about their nose. It sucks that they get ridiculed and bullied for big or crooked noses. I’ve seen so much bullying about the noses of women online. I won’t berate those with rhinoplasties because of course its like getting rid of an insecurity and I can empathize. But how are we going to teach our children that they are beautiful regardless of surgery? When are we going to show more representation in the media so that little children can be more comfortable being themselves?  \n\nI hope one day there is more representation on this topic because I feel like this isn’t discussed as much. But I know for a fact that nose shapes are an insecurity of millions of people and we need to change that.", "subreddit": "BodyAcceptance"}
{"post_id": "c96uv4", "created_utc": 1562269722, "title": "Body Dysmorphia: How to combat?", "author": "luckykaye12", "self_text": "To keep this post short as possible; I see a less desirable body shape in the mirror. But when I ask friends and family about it, they look at me like I'm over exaggerating and tell me my body looks great. \n\nI've also recovered from anorexia a couple months ago, so right now I'm just in a phase of trying to accept my body as it is. Advice or mental exercises I can do to see my body for what it is???", "subreddit": "BodyAcceptance"}
{"post_id": "c9b70e", "created_utc": 1562297463, "title": "Tired of feeling so out of portion. Honestly makes me feel so depressed.", "author": "Smug_Chinchilla", "self_text": "I have a pear shaped body and I hate it more than anything. I know some pear shaped women look absolutely beautiful, but my portions are extremely so out of portion it’s horrible. I’m 5’5, around 150, and I have less than an A cup. I have a small waist, my stomach isn’t flat but it’s still small, I have a little pooch but that’s normal for most healthy people, extremely large hips, way out of portion to my legs,butt,and boobs.. I hate my hips the most. When I wear leggings, my hips stick out way further than my thighs. They don’t have a nice “flow”, they just stick out so far.  And then I have thick thighs and a medium size butt. I feel like I look good in clothes because I know how to dress and flatter my shape, but when I look at myself naked I feel so depressed. I just wish my body was portional.", "subreddit": "BodyAcceptance"}
{"post_id": "c9h2u2", "created_utc": 1562339636, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "c9nfhb", "created_utc": 1562373527, "title": "Inverted nips :/", "author": "ThunderBunnies12", "self_text": "I can not get shirtless in front of my boyfriend because I am so embarrassed by my inverted nipples. Whenever I've told anyone that I am not comfortable with my boobs they are like \"Why? All boob sizes are great\" and I don't have a problem with size, I have a problem with how one nipple will only come out with a lot of work and will then go back in within a min and the other one either stays flat or just stays inside. Most people make fun of me when I tell them... My boyfriend says he doesn't care what they look like, and that he loves me either way but as much as I believe him I just can't bring myself to let him look at them for a few seconds without feeling like crying. My ex says they turned him on but like, i feel likes he's just saying that cuz he's horny. I really want help on feeling better about myself, I am in shape and have a nice shape, and face i just really hate my body and feel ashamed by it. Also the lack of people who know about inverted nipples makes me sad because it is quite common but nobody talks about it.\n\nEDIT: I was feeling bad about myself, i worked it out with my boyfriend and he is so loving and caring, he just thought the problem was him and not me.", "subreddit": "BodyAcceptance"}
{"post_id": "c9ulvx", "created_utc": 1562425815, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "ca48ug", "created_utc": 1562484201, "title": "Roller coaster of acceptance", "author": "Anneinmke", "self_text": "The other day I felt amazing, I bought shorts for the first time in five years and I even bought a size up so I would be comfortable. I didn’t even let it bother me. But I just saw myself on security footage and am disgusted tbh. There’s no middle ground.", "subreddit": "BodyAcceptance"}
{"post_id": "ca60wd", "created_utc": 1562500286, "title": "stretch marks :(", "author": "homelessdogreddit", "self_text": "I have been small my whole life, I'm now 30 and putting weight on easy. Given its some fat but I'm finally filling out.\n\nI workout and out of no where my inner thigh's my biceps on the front and at the back of my arm pit and my hips all got stretch marks :(  I fee like I have ruined my body by trying to be fit lol they are deep not just marks. Obviously they wont go away and I already have low self esteem.  I was just at camp with my family and I wouldn't take my shirt off so i didn't go swimming, I'm worried that girls will be grossed out at my inner thighs and ugh my arms are getting bigger but now they have stretch marks all over them. I wish I just stayed thin .", "subreddit": "BodyAcceptance"}
{"post_id": "cabjxg", "created_utc": 1562531383, "title": "Family constantly telling me (18F) that I gained weight?", "author": "firegirl58", "self_text": "Over the past year I’ve been on pretty strong anti-psychotics and anti-depressants. I just got off the main medicine that caused my weight gain (Abilify), but I still gained 15 pounds. That being said I’m totally healthy according to my doctor. How do I deal with my family? It’s bringing me down a lot. I’m starting to avoid looking at mirrors and it feels unhealthy.", "subreddit": "BodyAcceptance"}
{"post_id": "cacjju", "created_utc": 1562536590, "title": "Staying confident", "author": "spratt98", "self_text": "Hey all. I’m 21 F, around size 6/size 8, 145 lbs, and about 5’4.” I also have a pretty curvy figure. For about a year now, I’ve been trying to accept my body more because I used to be somewhat smaller. My weight gain has been caused by a myriad of factors including health issues and a less physically demanding job, as well as just being older. I actually think I’ve done pretty well at loving and accepting my body. And I truly know my weight, size, or even physical appearance in general does not determine my worth. \n\nHowever, I have been seeing a guy the past few weeks who is smaller than what I am used to dating or even being around. He is 5’8” and is muscular but has a slimmer build. He is great and I am very attracted to him but I can’t help but feel huge next to him. I need some advice on how to stay confident in myself, if this relationship proceeds. I keep thinking to myself I need to go in a strict diet for a few weeks to make myself feel better about my body when I am around him. Even though logically I know that is a bad idea. But how can I feel secure in my body when I have the constant reminder that I am not as petite as I once was?", "subreddit": "BodyAcceptance"}
{"post_id": "cag2cz", "created_utc": 1562557448, "title": "Going from small to medium- Mom is constantly commenting about my weight", "author": "1234ghww", "self_text": "Little things here and there that make me wanna cry. Like a couple months ago when i couldn’t fit in my shorts, she told me i was getting big and then proceeded to inflate her mouth and stick her arms in front of her to imitate a big belly. and when i tried on a bathing suit she said, no no style ur suit like this not that- thin girls where it like that, curvy girls should where it like this. and since i have larger breasts than her she said “ be happy with your breasts i’d much rather enjoy my slim figure” and i was like wtf?? she’s always been like this, when i was extremely young (mayb 10) i think i was showing early forms of an ED because she pushed me a little too far. however i think she felt guilty after and didn’t mention it again for a couple of years, but again she’s playing with fire now. I must be the most selfish and terrible girl ever but sometimes i wish i had a different mother. I’m 15, 5’5” and 120 lb. so not overweight i don’t think but not certainly not thin either and i know that. i’ve had many conversations with her to stop because i was sensitive, but she loves making herself feel skinny by pointing out how i’m kind of fat too much to stop. so changing external forces is not an option, i want to be able to not feel like doing stupid shit to myself like hurting myself which i want to stop.", "subreddit": "BodyAcceptance"}
{"post_id": "caqfce", "created_utc": 1562617559, "title": "I can’t stop fixating on my hips", "author": "gas-station-queen", "self_text": "I’m an 18 year old girl who weighs 130 lb\n\nI’ve been dealing on and off with this problem where I torture myself mentally because I think I’m too masculine or appear like a man (even if that’s not my intention, I get worried people will see me that way). When I open up to someone about this it makes no sense to them. I have a very stereotypically feminine face with small and soft looking features, I dress up in skirts and dresses all the time, I always have my nails and makeup done, etc. My biggest fixation is my hips (I don’t have any). I look in the mirror and feel a weird very strong mix of anger and anxiety when I see my hips because I just don’t think they belong on me. It makes me feel like the way I carry myself so femininely is wrong because I look like a man from the waist down. I have muscular and thick legs from ballet but without hips I feel manly and it’s gross. The thing is, I would consider getting some type of surgery or working out strategically to have round and large hips but then thinking about hips makes me have this whole existential anxiety and I start wishing evolutionary conditions of physical attractiveness literally didn’t exist which stops me from trying to change them. I feel so jealous of girls who have big hips that it makes me mentally tear them down and hate them as people so much that I don’t want to be like them. To worry about hips to this extent sounds silly but I literally zone out countless times throughout the day just having these feelings and mentally obsessing over them. It’s causing a lot of stress and self hate. \n\nI don’t know what’s wrong with me or how I’d begin to get help. I’m scared to talk to a therapist because my thought process seems silly and there are plenty of people with “real problems”.", "subreddit": "BodyAcceptance"}
{"post_id": "carrxz", "created_utc": 1562623896, "title": "I think Im too unatractive...", "author": "kingcobrapt", "self_text": "I dont want to victimize myself or anything but i just need to vent a bit and i thougth this might be the place,i am 16 years old and i never had a real girlfriend, i was just 105 pounds until a couple of months ago when i started lifting but even now Im just 130 pounds,my arms are only a bit over 12 inches my neck is ridicoulously small at only 15.5 inches and my shoulder width is the same as a pre pubescent girl, my hips are wide and even though i am skinny as hell i dont have abs and i think i am skinny fat and the same goes for my heigth, even though Im just 5'9 i have stretch marks all over my back. My head is very small too at just under 22 inches. Even though i have a lot of body hair i have no beard except a little ridicoulous mustache wich leads my to think i may have low testosterone. And probably these last 2 things i mentioned are actually proved by the fact i just spent my time and your time complaining about things wich i probably will never be able to change no matter how much i try.", "subreddit": "BodyAcceptance"}
{"post_id": "carvio", "created_utc": 1562624383, "title": "i cant get over my body flaws.", "author": "horse417", "self_text": "i simply cannot get over my body insecurities. i’m 5’4”, and weigh 135 lbs. i’m a normal weight. but i’m uncomfortable because i have a really wide waist. i also don’t have very wide hips. i feel like i look like a brick and i hate it so much. i need advice on how to stop looking at myself so negatively because i’m stuck in a negative pit.", "subreddit": "BodyAcceptance"}
{"post_id": "cas82y", "created_utc": 1562626129, "title": "Advice for Navigating Social Media", "author": "jimmycartier", "self_text": "I have struggled with liking my body and comparing myself to other since forever. I am 22, 5’5, and around 220. I’m fairly well proportioned with a bigger soft tummy, bigger arms, thick thighs, and lots of stretch marks. College and following in love made me stop restricting what I ate and I gained 50 lbs since college. I’m healthy and active and I love my body some days and hate it some others. Discovering pages on Instagram like @thisisjessicatorres @lieslbinx @itsmekellieb @themilitantbaker @tessholiday @kenziebrenna @bodyposipanda @cheyennegill @lizwearswhat @britishdreamgurl @lo.visa @thebtwn @fatkyliejenner @sophaaaaa @wheelchair_repunzel @breekish @minamigessel @comfyfattravels @art.brat.commics @iamdaniadriana @barbieferreira @scarrednotscared @kendramorous @yrfatfriend (and the list can go on) made me see how beautiful bodies are. Changing who I follow, recognizing how I feel when I see certain pictures, and unfollowing pages that made me feel less than or not good enough has literally changed my life and how I see myself and others. I hope this encourages people to follow these amazing people and think about how social media makes you feel and see yourself and the world. I hope one day you all can see yourself as beautiful and worthy!", "subreddit": "BodyAcceptance"}
{"post_id": "cavxba", "created_utc": 1562646350, "title": "Ramblings of an apple-shaped woman", "author": "throawayy928374", "self_text": "Hi all, I'm 24F, I gain weight easily on my waist, back, arms, shoulders, and bust, with average to smaller legs and bottom.  It's not a very exaggerated difference but it's there. And I felt the need to make this post and contribute to \"apple visibility\"- as happy as I am about progress in body inclusivity in media etc. I rarely find our shape represented. Google searches yield only how to dress for my shape to hide it and implicity be ashamed of it. Even on this subreddit I haven't found many posts about it. So I'm writing this in hopes that someone lurking who's struggling with this will be able to relate and know you're not alone.\n\n&amp;#x200B;\n\nI'll just say it. Being an apple-shaped woman is HARD. If pants fit in the waist, legs are saggy, especially at the knees. If they fit the legs, they won't close around my waist. I have to wear jegging style jeans to come close to a good fit, and even then the legs bag after a while. Well meaning companies have started to make \"curvy\" style jeans but usually this just means even more butt room and a smaller waist - fitting society's acceptable way to be \"curvy\". Plus-sized models are still hourglass shaped. It's become less acceptable to make fun of fat people, but remains acceptable to make fun of someone's flat butt. Fat on the waist is universally reviled - think ads to \"burn stubborn belly fat\" meanwhile people want to grow their butt. All around me, people are saying that attractiveness means the exact opposite of my body type. The whole big butt trend in the last decade has not helped things at all. I've always liked my breasts, but now it feels like butts are the only thing that matter.\n\n&amp;#x200B;\n\nI just keep reminding myself that my worth and beauty isn't defined by what society or anyone finds attractive. And that it's absolutely ridiculous that women's entire bodies are trends, and it's not my responsibility to follow them. Additionally, I'd like to change the narrative, although well-meaning, that \"it's ok to not have a perfect hourglass body\"... who the hell decided hourglass was perfect? My body is perfect the way it is. I love my lean, strong legs, my full bust and cuddly arms. Maybe one day I'll love my round belly. But until then I'm deciding no longer to hate it. What's helping is seeing other women with my shape and deciding to see them as beautiful. It helps me see my own beauty too.\n\n&amp;#x200B;\n\nI don't really have a direction I was going with this post. Just to say that APPLE SHAPED LADIES YOU ARE PERFECT THE WAY YOU ARE. YOUR BODY SHAPE IS NOT A FLAW. ALL WAISTS ARE GOOD WAISTS. ALL BOOBS ARE GOOD BOOBS. ALL BUTTS ARE GOOD BUTTS. Thanks for reading. End rant.", "subreddit": "BodyAcceptance"}
{"post_id": "cb24mc", "created_utc": 1562685083, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cb41wk", "created_utc": 1562693828, "title": "Podcast became food-centric", "author": "[deleted]", "self_text": "hey yall,\nso I want to preface this by saying that I am not demanding anyone do anything about this, it is just a personal problem for me...\n\nSo this great comedy podcast Ive loved for years has become about food like, a LOT of the time. It has become hard to listen to. It isnt just one part I can skip anymore. \n\nAgain, I am not saying they have to change anything. Im just saying it has changed the listening experience for me, &amp; Im bummed out and wanted to see if anyone can relate.", "subreddit": "BodyAcceptance"}
{"post_id": "cb8bul", "created_utc": 1562713167, "title": "Cellulite", "author": "gfitX", "self_text": "I’m pretty happy with most of my body accept one thing! Cellulite ! I can’t seem to stop obsessing over how horrible it looks on me. I’d describe myself as slim with a good bum when I’ve got clothes on. But I feel really self conscious about wearing less clothing on holiday. Can anyone offer advice as to how they’ve learned to accept it? And do others who don’t have this insecurity , what are your thoughts? \nThank you all :)\n\nEdit. If anyone has any good body positive instagram people to follow then let me know :)", "subreddit": "BodyAcceptance"}
{"post_id": "cbgvis", "created_utc": 1562766215, "title": "Need help with body acceptance after a minor injury", "author": "curlysilver", "self_text": "I have recently found running and for the first time found myself liking my body because I was focused on what it could do rather than it’s shape and size. But I’ve hit a block, thanks to weak glutes I’ve had to stop. I’m seeing a physio and it will be weeks before I might be able to run again. In the meantime even walking is painful thanks to back and knee pain. Running was also good for my mental health and I feel it slipping downwards now I can’t do it and am using food instead which starts a big negative cycle off. \n\nAt the moment I feel like my body has let me down, I’m really cross with it and want to punish it. I know this isn’t a healthy way to deal with it and I feel like I’m whinging about nothing but I’m struggling. If anyone has any suggestions or advice on how to deal with this setback I’d really appreciate it.", "subreddit": "BodyAcceptance"}
{"post_id": "cbhwzh", "created_utc": 1562771516, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cbqnxg", "created_utc": 1562815584, "title": "Very large aureolas", "author": "poopok", "self_text": "Just wondering if that’s ever considered attractive. I do not have large boobs, pretty disproportionate", "subreddit": "BodyAcceptance"}
{"post_id": "cbrftl", "created_utc": 1562820519, "title": "Haven’t dated/had sex in 7 months bc of body image issues", "author": "duchovmeme", "self_text": "I’m 5’1 and about 175 pounds. Normally I fluctuate between 160-165, and though I wasn’t really happy with my weight even then I could still muster up confidence. Now I have little to no confidence in how I look. I feel like all my extra weight went to my belly and that’s always been my problem area, so now I just feel worse than ever. I’ve also developed a more prominent double chin. Other subreddits have just said “diet” “go to the gym” “lose some weight” but I know I need to learn to accept myself as I am. Even when I was 140 I hated my body so just working out ain’t gonna fix the problem!! Advice?\n\nAlso just realized I haven’t really mentioned the sex/dating thing but it’s pretty self explanatory. I hate my stomach so I don’t wanna fuck anyone and I don’t feel confident even if I’m wearing a cute date night outfit.", "subreddit": "BodyAcceptance"}
{"post_id": "cbwq3c", "created_utc": 1562857936, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cbxg40", "created_utc": 1562861334, "title": "I give up, I can't believe I look good", "author": "peepocho", "self_text": "No matter how many times I'm told look good I feel it'll take a miracle to see it myself. All I see is a blocky waist, broad shoulders and not wide enough hips. I've bought shape wear now to forget about this a bit more, since I'm incapable of gaining weight (been 103lbs for 2 months despite my efforts). I fully accept that I am extremely insecure now that my weight has gone down from last year.", "subreddit": "BodyAcceptance"}
{"post_id": "cc0suq", "created_utc": 1562876675, "title": "[META] Really though... when should we be concerned about eating disorders?", "author": "steepandbeautiful", "self_text": "I've lurked here for a long time and it's been helpful for me. Fat logic is dumb and fucking up our country and I think calling it out is good. \n\n&amp;#x200B;\n\nThat said, I've started seeing things in this community that concern me, and it seems like it's increasing over time, and I feel like we should talk about it. Mostly in the text threads. Specifically, I am seeing a lot of people post about their eating plans and attitudes towards their bodies and weight loss that seem like ACTUAL eating disorders, and people responding like it's a typical lifestyle change. I totally understand that when you are losing weight in a healthy way it is annoying as FUCK to have people in your life constantly tell you that counting calories mean you're anorexic or that you HAVE TO STOP LOSING WEIGHT!!!11!!!1 when you still have plenty to lose, and I think people want so strongly to not do that to others that nobody is really willing to call folks out for maybe going too far. But I really like this place, and I don't want to see it get turned into a place where eating disorders are encouraged to flourish.\n\n&amp;#x200B;\n\nOne thing that seems to be going up a lot lately is REALLY intense fasting. I'm not talking about IF, which I think is fine for a lot of people (schedule your daily meals whenever you want), I'm talking about entire days of subsisting off of black coffee and acting like that's totally normal or regularly having 200-800 calorie days. This seems to have started being accepted in this sub as totally healthy behavior.  I'm not sure it's much healthier to regularly eat nothing for an entire day than it is to eat an entire extra large pizza three times a day. This especially worries me when it's combined with people who state clearly they have active problems with bingeing, but always feel better after fasting (\"I can't believe I ate that much, but at least I'm six hours into a new fast and starting to feel clean again!\"). Regular bingeing followed by long fasts \\*is bulimia\\* and we should not be encouraging it. I am also seeing posts from people talking about how they're feeling dizzy or ill because it's \"outside their eating window\" but they have to \"stay strong\". That registers to me as eating disorder talk.  Also, people posting about losing weight into the medically underweight range because \"I like my body better this way\" without any mention of talking to a doctor and making sure it's a healthy weight for them. \n\n&amp;#x200B;\n\nI know there are folks here who will disagree with me.  If you think I am dead wrong please post, I would really like to have an open discussion. I just felt like it needed to be addressed. I am also just wondering on others thoughts for when it is appropriate to suggest to others they may wish to maybe check out an eating disorder screening tool, or speak with a counselor about their weight issues. Despite being much less common than obesity, eating disorders aren't that uncommon. I just want everybody in this community to stay safe.", "subreddit": "fatlogic"}
{"post_id": "cc4cvm", "created_utc": 1562895046, "title": "Nervous about seeing people for the first time in over a year", "author": "klepz100", "self_text": "I recently got released from jail. I was locked up for 11 months and during that time I gained a ridiculous amount of weight. I was in a size 8/9 when I went in and now I'm in like a 15. Not even sure what size because I'm terrified to try on jeans and have only been wearing leggings. I've been talking to a couple friends who are excited to see me after so long but I'm freaking out over it. One guy has been a very good and supportive friend for a long time and I know he won't judge me, but I'm embarrassed about how I look. The other guy is also a good and supportive friend who has hinted at starting a relationship and I'm worried that he'll change his mind once he sees how much I've changed. I know that if they're truly supportive of all the changes in my life they'll accept the changes in my body too. I guess I just needed to put my anxiety into words.", "subreddit": "BodyAcceptance"}
{"post_id": "cc6hrt", "created_utc": 1562908075, "title": "girl calls herself 'chubby' in the title of a youtube video and...", "author": "overluxury", "self_text": "&amp;#x200B;\n\n[\\(some of the comments are fine, a lot of them are questionable though\\)](https://i.redd.it/v1vmjdjj2t931.png)", "subreddit": "fatlogic"}
{"post_id": "cc9k9t", "created_utc": 1562930307, "title": "Body Image Research (Males 18-40)", "author": "mozman15", "self_text": "Hi everyone,\n\nMy name is Lachlan, and I am a Masters of Clinical Psychology student.\n\nI am conducting research into male body image and the factors that impact on how males view their body and physical appearance. We are hoping to identify factors that contribute to males developing negative views towards their body and physical appearance.\n\nHere is a link to the study [https://researchsurveys.deakin.edu.au/jfe/form/SV\\_0ocZhFOpVrMJJNr?fbclid=IwAR2MaxEg\\_YB\\_XWmTJ\\_PHncBRXJm-yrVM1LWBX\\_22Ux165PkgDJiqmCnvvpw](https://researchsurveys.deakin.edu.au/jfe/form/SV_0ocZhFOpVrMJJNr?fbclid=IwAR2MaxEg_YB_XWmTJ_PHncBRXJm-yrVM1LWBX_22Ux165PkgDJiqmCnvvpw)\n\nI would greatly appreciate it if you can take some time to complete the study. If you complete the study, you will receive a $10 gift voucher, as well as go into the draw to win 1 of 5 $50 gift vouchers.\n\nThank you!", "subreddit": "BodyImage"}
{"post_id": "ccbvog", "created_utc": 1562943325, "title": "Hyperpigmentation in the Media", "author": "classicteenmistake", "self_text": "While not very known and really ever discussed upon, Hyperpigmentation affects countless people and has been a widely treatable condition. Basically, it’s where parts of your skin have extra melanin (stuff that colors skin, hair, eyes, etc.) in big patches, often accompanied with a more rough texture and sometimes small bumps kind of like pimples.\n\n\nI have Hyperpigmentation. I’ve had it since I was  maybe 5 or 6, and has since then very slowly spread now that I’m 16. For the longest time I’ve tried to hide it, thinking it was ugly and appalling to most people, and it mostly is. I’ve been asked too many times to count if it was “contagious,” or a “disease” (which it isn’t, by the way. You wouldn’t ask someone with vitiligo if it was contagious, would you?).\n\n\nToday, Hyperpigmentation shows up in the media as nothing but an issue. A problem to lessen. Remove. To banish from your skin, so you finally can have the confidence to try on that new bikini. Countless creams, tonics, whatever you can to achieve your once clear skin. Problem with that is, some kinda don’t exactly go away.\n\n\nSome like mine.\n\n\nMy grandma has always tried using creams on my arm, but no matter how much she put on it would only continue to stay on my arm. My dad recommended I laser my arm, and finally get rid of my extra melanin in place of a painful scar. At this point in my life, I’m leaning towards acceptance of my condition as part of me, but it’s difficult when everyone tells you it SHOULD’NT be you, that it doesn’t belong and is perceive as nothing but something to hide. I don’t wanna hide anymore.", "subreddit": "BodyAcceptance"}
{"post_id": "ccc46z", "created_utc": 1562944422, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ccdbf8", "created_utc": 1562950016, "title": "I don't know what to do.", "author": "ahhhhhhthrowawayhey", "self_text": "I'll start by making it clear that I personally do not know much about this topic. I have come here to ask for help, for my gf. She has always had issues with accepting her looks. gaining a pound to her is like gaining 100 pounds, and when that happens it derails her whole day/week. lately it has been taking over much more of her time. I'm worried that it is going to get exponentially worse very soon. \n\nShe is very reluctant to even entertain the idea of seeing a professional. she thinks that they wont take her seriously because she \"she doesn't look skinny.\" She thinks it would be a waste of money because of that. \n\nI've urged her to try finding communities online to talk to, such as this one, but that hasn't happened thus far. \n\nI can't stand by idly waiting for something drastic to happen to then finally get help. What can she do to feel some kind of motivation to fix the problem? Is there anything I could be doing differently to help? I know she feels helpless, and she's fallen into accepting that this is the way things are for her. She's fallen into accepting that she is to blame for the way she feels. I do not believe that she sees an end in sight but I know it is possible. \n\nHow do I show her that she is worth it? How can she finally see that it isn't her fault?\n\nAny answers are greatly appreciated, thank you for taking the time to read this.", "subreddit": "BodyAcceptance"}
{"post_id": "ccfvpy", "created_utc": 1562961839, "title": "Skinny to anorexic to curvy...?", "author": "plathlyrical", "self_text": "I don't want to post a self-loathing tl;dr so I'm going to try to keep this short. \n\nGrowing up, I was always the \"skinny one\". I'm an ex-competitive dancer and used to eat two rice cakes a day and pick at dinner to stay skinny before competitions and shows. I didn't develop until I was 16 and until the age of 18 I was always tiny (I'm 19 now). \n\nSince moving out (especially since coming to live with my parents for two months while I wait for my new place) I've been fluctuating. I went vegan for three months last November and lost almost two stone, my doctor advised going back to being vegetarian (which I'd been since 14) or pescatarian because I was scraping 98lbs (7st) (I'm 5ft7/8). \n\nSince February I've been stable, I got back to my normal weight (around 9st) and went out with my boyfriend to celebrate the day I hit the weight. However, it seems like my fat distribution has....changed? It used to go to my boobs or bum so I was able to hide it in jeans. Now it's my tummy and thighs and I'm struggling so much! \n\nWhen I see girls look at my boyfriend...I just suck my tummy in. I don't have much of a tummy and I'm lucky for that, but I'm constantly self-conscious. I don't really think I want to look like Instagram girls, I'm more of a Carey Mulligan type. I just...feel different. My boyfriend assures me that he thinks I'm gorgeous but I never feel comfortable getting changed in front of him anymore and I never feel sexy around him. I would rather accept my body than get back into the starvation mindset I was in when I danced. I would like to see my new body as womanly and nice. I think other women with my body type are beautiful, but I can't accept it in myself. I think I still feel the pressure to be the \"skinny one\" especially because my older sister is really tiny. \n\nDoes anyone have any self-love tips or ways to get through this? \n\nSorry if this is really long.", "subreddit": "BodyAcceptance"}
{"post_id": "ccfyii", "created_utc": 1562962188, "title": "My girlfriend has done nothing but be great to me, yet I'm still terrified of her.", "author": "Incitatus_", "self_text": "She's the best girlfriend I've ever had, and yet the mere fact that she owns me is enough to make me descend into paranoia and fear. She has said she won't abandon me for no reason, which is more than I deserve already, but just knowing that she could destroy me with a thought is ruining me.\n\nI know nobody else will take me. I know my body is disgusting, and I don't know what makes her not see that, but anyone else will realize that I'm poisonous garbage and spit me out. I need to fix this, I need to prepare for when she inevitably realizes that and dumps me and destroys me, I need to change my body or die alone but I can't, I'm weak, I'm a coward, I'm scum and I deserve all of this. \n\nI'm terrified of going back to being single, and of losing her. The pressure to fix my body is unbearable. I can't eat anymore without wanting to physically punish myself for that. I can't. My body is not acceptable. I need to hurt. I need to die. I'm not rational, I'm not functional, I'm a mess, I need help", "subreddit": "BodyAcceptance"}
{"post_id": "ccjr1x", "created_utc": 1562982814, "title": "how can i accept my boyfriends preference to curvy women when i’m.... not?", "author": "dontlikemybod", "self_text": "title", "subreddit": "BodyAcceptance"}
{"post_id": "ccphkr", "created_utc": 1563025462, "title": "Aging female body parts -- ughhhh", "author": "libacious", "self_text": "Here's a story that would be funny if it wasn't also so sad...  \n\n\nUnder a different account, I posted a question to older men asking how they'd feel about a 40 year old woman and her post-babies, aging breasts.  Most, if not all, of the men assured me that a good man would be attracted to a woman regardless of sagging, empty breasts, and that I should be comfortable with my body.  I started chatting with one man in particular, who told me that any man who wouldn't accept my body for what it was didn't deserve my time.  After a bit of convo, he asked if I could give him an idea of what my breasts looked like.  I found a body type that I thought resembled my own and sent him a picture.\n\n&amp;#x200B;\n\nYeah, he wrote back and suggested plastic surgery...\n\n&amp;#x200B;\n\nI was brought to tears...", "subreddit": "BodyAcceptance"}
{"post_id": "ccq3a8", "created_utc": 1563029057, "title": "Does anyone actually prefer small penises?", "author": "ashamed54", "self_text": "Well yeah I’m small. Incredibly depressed about it, because I hate picturing someone I’m dating with a bigger guy(like her ex boyfriend or something, which in my last relationship told me all of hers were bigger than me). God that killed. I absolutely despise the idea of someone just letting go of that part of a relationship to be with me. Like they have to make this sacrifice and spend their days missing when they had a fun, satisfying, worthwhile sex life. I’ve never actually heard of a specific woman who prefers small penises, so when people say it’s all preference, I just don’t believe it.", "subreddit": "BodyAcceptance"}
{"post_id": "ccqdle", "created_utc": 1563030637, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "ccx5tf", "created_utc": 1563067211, "title": "Body hair", "author": "7ammy30", "self_text": "So I’m a girl with excessive body hair. I feel ugly all the time. Do any of you think a guy would ever genuinely be attracted to me?", "subreddit": "BodyAcceptance"}
{"post_id": "cdahof", "created_utc": 1563150420, "title": "h e l p : I Cannot Wear Form-Fitting Clothes.", "author": "TamponSheath", "self_text": "I am a 23 year old female and I have an overwhelming insecurity/fear to wear anything form-fitting.  I don’t think I look too bad in tanks or tighter clothes, or that my body is all that bad. In fact I am quite healthy, but Ive had this idea drilled into my head that if I wear tighter clothes I am trying too hard or I am trying to attract the wrong attention. I am afraid of even wearing more feminine clothes around my house or outside. I don’t know how to fix this problem even because I am constantly paranoid that people are looking at my body. Not necessarily in just an objectifying way, but in a judgmental, or even in a malicious way.  I feel so uncomfortable that if I try to wear tight clothes I bring baggy clothes to put over to  cover myself within minutes of being out. I wear sizes of clothes that are much larger than I am. My father was mentally abusive, especially when it came to controlling we could wear. We couldn’t wear anything that wasn’t s regular t-shirt. (Just to give you some context of how my dad is, he is one of those people that if a woman wears revealing clothes shes asking to get fucked. And its her fault if she gets assaulted. Super misogynistic and demoralizing in every way). My sisters and I all struggle with body image and are all trying to overcome our anxieties.  Please any advice would help. I want to break this cycle and be able to at least wear a tank top when its hot. \nPS: My dads actually opinions are actually disgusting to me and hopefully most of the human population.  And if you can guess, my father and I don’t get along.", "subreddit": "BodyAcceptance"}
{"post_id": "cdihgi", "created_utc": 1563202677, "title": "Meta Monday: Casual Conversation: It Really is Monday Edition", "author": "maybesaydie", "self_text": "The sharp eyed among you may have noticed that one of the mods, who shall remain nameless,  ^^^^it ^^^^was ^^^^me accidentally posted this yesterday. But this time, having looked at a calendar,  we can say that it is indeed Monday.\n\nTake this opportunity to ask the community questions about fatlogic, weight loss and fitness. Ask the mods any questions you may have or just converse among yourselves. \n\nThe next selfie post will be Monday September 1.\n\nHappy Monday!", "subreddit": "fatlogic"}
{"post_id": "cdnl7h", "created_utc": 1563225341, "title": "Crop tops", "author": "Shuiner", "self_text": "In high school, being a fat kid, I knew I'd be made fun of if I wore one. In my 20s, I thought people would make nasty comments or stare if I wore one at my size.\n\nThis weekend, at the age of 35, I finally wore a crop top for the first time ever. And absolutely nothing bad happened! No stares, no negative comments. My husband told me I was cute and one of my friends said I looked nice. \n\nI wish it didn't take me this long because, let me tell you, it was great to wear in the heat. Almost makes me want to go out and buy some short shorts! (Might need time to build up to that lol)", "subreddit": "BodyAcceptance"}
{"post_id": "cdranw", "created_utc": 1563245178, "title": "Breathing Through Bad Photos", "author": "gothbambi", "self_text": "I've been practicing a lot of self-love skills lately and today my cousin got her wedding photos back and shared them on Facebook. I've gained some healthy weight over the past two years (was previously obsessed with working out and very restricted eating) but of course my face looks different than I'm used to and it was at first upsetting.  \n\nMy gut reaction was to get upset, cry or just berate myself for being \"fat,\" but I'm trying really hard to tap into how I felt at the event and not focus on whether or not I have a double chin in certain photos. I am someone who carries more weight in my face than others and I don't think a little line of fluff under my chin is a reflection of who I am as a person... but it's hard not to fall into the trap of hating yourself over it.  \n\nI felt really great on the day of and had been exercising mindfully and nourishing myself. I'm trying to focus on that. \n\nAny other tips or skills for challenging those knee-jerk self-hating reactions to shitty pictures?", "subreddit": "BodyAcceptance"}
{"post_id": "cdsaqs", "created_utc": 1563251216, "title": "I feel like I don’t even know what I look like", "author": "okayrealtalk", "self_text": "I’m 5’3, 130lbs female. I’m active, 7-10 hours of exercise a week, and I eat relatively well. Anytime I think about how I look I only imagine I’m fat. I can never tell and I know know what to do. I don’t want to slip into Ana again", "subreddit": "BodyAcceptance"}
{"post_id": "cduryr", "created_utc": 1563269464, "title": "I read 'Health and Every Size' and it has more sanity than you might expect...", "author": "zzeeaa", "self_text": "Nope, that wasn't a clickbait title. I really mean it.\n\nLinda Bacon's *Health at Every Size* (2008) is often described as the beginning of the HAES movement (although these ideas have been around since the 1960s). It's the seminal text that so many fat activists turn to when critiquing diet culture and pressures to be thin. I get books for free thanks to my job, so I decided to read up on Bacon's *HAES* and decide for myself what the main messages were.\n\nReader, I was surprised.\n\n&amp;#x200B;\n\nhttps://i.redd.it/9hzlnm9wsma31.jpg\n\n&amp;#x200B;\n\nThe first thing to understand about this book is that it is divided in to two parts. My main focus on this review is the first half of the book, which outlines the HAES philosophy and the evidence behind it. This is where a surprising amount of sanity lurks. The second half is dedicated to tips about eating sensibly and enjoying exercise. I’m happy to answer any questions about it, but it’s more about worksheets than theory. It’s also closer to what you might expect from a HAES handbook, advocating the idea that telling someone to lose weight is as bad as telling them to be whiter or straighter (p 190). The eating suggestions don't involve limiting calories, and the exercise advocated is so mild that it's not going to do much for peoples' cardiovascular fitness. No surprises there. The real gems of sanity (and the parts that FAs seem to have missed) are in the front half of this text.\n\n**Bacon's** ***HAES***\n\nLet's get on to a discussion of what's in the first half of the book and what Bacon is actually trying to achieve.\n\nAs regards the title, Bacon is saying they health can and should be your aim no matter what your size. Basically, being active is very good for your physical and mental wellbeing regardless of how fat or thin you may be. Everyone should endeavour to exercise in a way that is sustainable and habitual (p 54). Healthy lifestyle habits are available to everyone (p 157). I think that's something we can agree with on this sub, especially as many of us are currently over- or underweight.\n\nImportantly, *this book is not for people who find it easy to lose weight.*\n\nIf you are one of the many people on this sub who hasn’t had too much trouble increasing your movement and decreasing your intake, then this book isn’t for you. It’s for those of us who have struggled with CICO and can’t quite understand why. As someone with Binge Eating Disorder, I actually found her approach quite helpful. While I understand CICO, I have trouble adjusting my behaviour accordingly. \n\nOne of Bacon’s main arguments is that we are not perfectly rational beings with full control over our appetites. On one level, we can be hijacked by external cues like food advertising and social pressure about when and what to eat. On another level, our body registers how much we have consumed and how much energy we have spent. This has a powerful impact on our hunger cues. We need very high levels of willpower to ignore these cues to eat more during significant caloric deficit. This is why only a minority of people lose weight and maintain weight loss after a crash diet. \n\nSo, you’re set if you can say no to external cues to eat like enforced meal times or peer pressure. You have a good chance of losing weight if you are deeply motivated to ignore your body’s many hunger signals and keep ignoring them for extended periods of time. That's awesome for you, and Bacon and I are a bit jealous. Don't judge.\n\nIf you can’t honestly commit to weight loss via significantly reduced calories, you need to learn how to balance your approach to eating so that it synchronises with how your body works. The good news is that most of us who are trying to lose weight are eating more than our bodies want us to. I think this mindset is actually quite constructive and helpful for people like me with BED, or others who have problems with their willpower or maintaining a diet in their particular social circumstances.\n\n**Pro-CICO?**\n\nBacon makes some interesting observations that support CICO. Here are some arguments and observations that are in the book. They may surprise you:\n\n* “Weight loss is simply a matter of taking in fewer calories than you spend”. In a perfect world, reducing calorie intake by going on a diet and increasing calorie expenditure through exercise would lead to lasting weight loss. Many people fail to achieve this in a long lasting way because we don’t have total conscious control of our body’s cues, which makes following these regimens hard (pp 44-45).\n* Bacon knows that 2000 calories is ideal for a woman of her age and energy needs. She eats roughly this much each day and maintains her weight as a result. Some people will gain weight on this amount. Others will lose weight. It’s all about their personal energy needs (p 45).\n* A big reason why chronic dieters fail despite frequent extreme calorie restriction is the periods of equally extreme indulgence. The more we take part in crash diets or starvation level diets, the more we mess up the hormonal cues that cause hunger. Our body also sends out signals that we need very high-fat foods and lowers our energy so that we feel too lethargic to burn them off with increased activity (pp 48-49).\n* “Many people believe that exercising gives them permission to eat more than they are actually hungry for”. This means that many people never see a significant change in weight when they increase their calorie output (p 53).\n* Our bodies have complex hungry responses impacted by hormonal responses to stress, sleep, and even the viruses in our bloodstream. Pollution hypothetically impacts our hormonal systems as well. There is no healthy way to change your hormones or immune system via pills or other aids. Even drugs that increase metabolism will stop working effectively as your body compensates. Basically, there's no magic fat burn pill so don't waste your time (pp 54ff)\n* With modern foods, we can eat high calorie snacks that bypass our natural hunger system due to new ingredients like high fructose corn syrup. The volume of food you consume does not have a direct relationship with your size, as you may be consuming small unsatisfying snacks with low fibre that don’t satiate you. A small snack might have as many calories as a full meal, but will still leave you wanting more (p 69). On this note, the US food industry is insidious, corrupt, and distancing consumers from healthy, fresh produce and natural tastes. This messes with our hunger receptors and can make us eat more than we need to (pp 113ff).\n* Fat around your abdomen is particularly unhealthy. Heavier people are more likely to have insulin resistance, and develop Type II Diabetes as a result. Insulin helps to decrease our appetite, but this goes haywire when we get insulin spikes from too many refined grains (p 77). (FYI: she does explain that fibre can control the sugar hit. So if you crave apple juice, try to satisfy it by eating an actual apple instead). \n* Try not to label food as good or bad. Yep, we certainly see this argument in fatlogic world! But the reality of this statement isn’t so bad. Bacon suggests we allow ourselves any kind of food in moderation without punishing ourselves for being bad or rewarding ourselves with a naughty treat. Instead, we should pay attention to how a ‘bad’ food like a Twinkie feels. Respect your body’s response to the sugar and the taste. Tap in to these signals with an open-mind to see how and when a sugary snack might be good for you. You will probably find that you rarely want or need it if you base your desires on your body’s behaviour during and after the 'bad' food (p 94).\n\n**The Notorious Set Point Theory**\n\nOne of the ideas from Bacon that seems to permeate the fatlogic world is the idea of a set point: a natural weight that our body seeks to stabilise at. We’ve all heard people claiming that their set point is 250 pounds and no amount of dieting will change this.\n\nSo what does Bacon actually say?\n\nShe does argue for a set point, but notes that many people are *above* their set point of ideal weight because they are bad at recognising when they are hungry, go through binge/starve cycles, or over-eat for emotional reasons (p 28). So, if you want to use Bacon’s argument about set points, you need to keep in mind that fact that *many people are below or above their set point due to bad eating choices*. \n\nA person who spends all day stuffing their face to address their emotions (lol, like me) cannot be at their set point. Only a healthy eater who pays proper attention to their body’s signals can be at their natural set point. In modern America, such people are a minority. \n\nMy interpretation of a set point, in light of this book, is that we all have different physiques. For example, you might have two ladies who are 5’6. One has delicate bone structure, narrow hips, and a flat chest. Realistically, her body will settle on a lower natural weight than a 5’6 lady with a wide pelvis and a big bust size. Or, you might have two men who are 5’9. One has broad shoulders and stocky legs. The other is slim with a narrow physique. You wouldn’t expect these people to have the same BMI. The naturally larger ones will need to eat a little more to sustain their higher natural set point. Their bodies will give them hormonal signals to help them achieve an appropriate intake specific to their own body. \n\nNow, we are talking a difference here of a few kilos and a few hundred calories. The healthy range on a BMI chart isn’t just a single weight, after all. There’s nothing in Bacon’s text that actually condones the idea that 300 pounds is anyone’s set point. Instead, she makes the fairly reasonable claim that all bodies are different with different dietary needs. \n\nIt’s also clear that people like me who binge are probably quite a bit above our set point, as Bacon herself was before she put HAES in to action. Bacon actually lost 30 pounds following the HAES model. She also stopped her yo-yo dieting and learned how to relax around food and find a stable intake that worked for her (p xxii). She describes her set point as this *lower weight* that she obtained once she got in tune with her body’s signals. \n\n**Some Critiques**\n\nNot everything about the first half of this book is flawless.\n\nThere are areas where I disagree with Bacon. She believes that bariatric surgeons routinely exaggerate the danger of obesity in order to sell very dangerous procedures (pp 62ff). I think obesity is life threatening, and I don’t feel bothered by people who need a surgical solution to it (so long as they’re well informed about the permanent lifestyle changes needed to make it work). \n\nEven more problematic is her occasional promotion of studies that ‘prove’ fat and thin people eat the same amount (p 68). Are we talking about the same volume, but thinner people eating fewer calories? Were the studies undertaken in a closed environment that didn’t rely on self-reporting of intake? It’s not clear. These studies can be very problematic, and I don't think they are used well.\n\nThere are also moments were she doesn’t seem to believe in CICO anymore (pp 70, 143)!\n\nThe chapter titled ‘We’re Victims of Fat Politics’ has some questionable statements. Bacon disagrees with the idea that overweight people are unhealthy or that obesity shortens our life spans. She argues that the data used in these studies is flawed. I think this chapter is really off, so I haven’t included it in my positive observations above. I’m also not the right kind of doctor to really comment on cardiovascular or metabolic studies. Maybe someone else here can jump in. \n\n**Conclusions**\n\nI certainly don't agree with Bacon in on every claim she makes. It’s a book with multiple arguments based on interpretations of different scientific studies and clinical observations. The only books I stand by in full are the two I wrote. (Even then there’s room for argument...). \n\nBut, I think it's important that we get a sense of where fat logic is coming from and how it has developed as an argument if we wish to combat this kind of thinking in our selves and our communities. You don't get anywhere by ignoring the people you disagree with.\n\nI'm very happy to have read *HAES*, and there are some real gems of advice that I will be taking on board. It also showed me that Bacon appeals due to her compassion for her readers. She's an empathetic person who challenges the view that everyone who is fat is an ignorant failure. Maybe that's something we need to consider more.\n\nIf anyone has recommendations for other books you'd like me to read and report back on, I'm happy to do so. I hope you enjoyed this review, and I'd love to hear your thoughts.\n\n^((Page numbers correspond to the BenBella 2010 edition.))", "subreddit": "fatlogic"}
{"post_id": "cdyb3w", "created_utc": 1563289846, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cdze02", "created_utc": 1563294717, "title": "I can't stand being a short guy I need help", "author": "RandomTeen989", "self_text": "I'm about to turn 17 in a month and I'm around 5'6. I have maybe average to above average looks like 6/10 from rateme threads. \n\nI've seen so many people saying that at this height I'm fucked for dating and I don't know what to do. I can't stop thinking about it and in my free time, I'm always looking for people similar to my height who did okay in dating while also not being famous/rich celebrities.\n\nI just don't get it, you have some guys who are like 5'4-5'7 saying that height has never been a problem and others saying that you're screwed at this height. Then you have an entire group of people over on r/shortcels who can't get a single girl because of their height.\n\nI'm so fucked for dating once I get to college, I can only boost my height by around 2 inches to 5'8 with thick shoes but a girl would find out eventually and most want a naturally tall man. \n\nWhy couldn't I just be born a normal height?", "subreddit": "BodyAcceptance"}
{"post_id": "ce41lj", "created_utc": 1563315787, "title": "I fit the smallest size at the stores but don't look like it", "author": "satanscockslut", "self_text": "I lost 15kg almost two years ago now, and therefore dropped about 3-4 clothing sizes and now fit the smallest (32 EU/size 2 US) size sold at most stores. \n\nI've always had wide hips, a smaller waist, big boobs and thick thighs. I do have a thigh gap but I feel my thighs are still an odd shape and very wide.\n\nI always thought people who are the size I am now have the kind of a body I would personally kill for.. yet now that I've supposedly got it, I see no difference in the mirror to how I was when I weighed more, I see no difference between me and my friends who use bigger sizes, and I'm scared to pick clothes to try on in my size because I keep thinking they won't fit and yet they consistently do somehow.\n\nWhat is going on? How do I fit this size and yet look nothing like it, nothing like the other girls who wear it?", "subreddit": "BodyAcceptance"}
{"post_id": "ce510b", "created_utc": 1563320704, "title": "I still dislike my cheeks in general", "author": "eukarythotic", "self_text": "Idk, I have acne marks on my cheeks and they’re incredibly chubby in comparison to the rest of me and I find it very hard to find any kind of positivity for them. I just wanna feel happy about a part of my body that is so noticeable to other people and I have no clue how to get over the worry about them, especially when it comes to the chubbiness. I guess this is kind of a vent but also me hoping for advice on how to deal with the worry and find positivity in my cheeks.", "subreddit": "BodyAcceptance"}
{"post_id": "ce76u9", "created_utc": 1563332732, "title": "I'm so tired of hating my body", "author": "yagurlcharlo", "self_text": "I honestly feel like I'm never going to love my body even though I'm preaching self love to my friends always. \n\n&amp;#x200B;\n\nI was very athletic and played a lot of sport all through high school so staying thin was relatively easy but I did still struggle on and off with binge eating/purging because I never felt slim enough. I did my best to remain active and kept by size 8 body till I was about 20...through a lot of over exercising and not a lot of eating.... \n\n&amp;#x200B;\n\nDuring my third year of university I became extremely depressed and had that \"fuck it\" mentality where I just ate everything. It was no longer a binge and purge but just binging constantly. I gained about 15kgs in 10 months. \n\n&amp;#x200B;\n\nAfter this I moved back home and my best friend got me into lifting. I got really excited because I found an activity I loved doing and it also made me want to eat better so I could lift and perform better. I lost 18kgs and was happier than I had been in a long time, but I still had those thoughts in my head constantly telling me it still wasn't enough, not slim enough. It also pretty difficult when all my friends are a size 6-8 and I'm a very curvy 12... Just shit feeling like the ugly fat friend all the time I guess...\n\n&amp;#x200B;\n\nThree months ago I ruptured my left achilles. I didn't walk for 2 months. I'm still limping and can hardly gym. I've gained 8kgs. \n\n&amp;#x200B;\n\nI don't know what I'm really looking for by posting this to be honest. I just feel so ugly and none of my clothes fit and I feel like I'm back at square one all over again. My injury is going to stop me from doing anything very strenuous for another \\~6 months and I feel like I was relying so heavily on lifting to help my mental health as well as my physical health. I'm gaining every week... I don't want to leave the house... I feel like I had a small window where everything was okay and now I just hate myself again. I hate my body. I hate looking at myself in the mirror. I don't know what to do... \n\nCan someone please tell me how to learn to love my body again? I can't rely on the gym anymore I'm too injured for that and I can't do 6 more months feeling like this.", "subreddit": "BodyAcceptance"}
{"post_id": "cee5ib", "created_utc": 1563376397, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "cem0zb", "created_utc": 1563413909, "title": "Having a meltdown over a bathing suit", "author": "MStrobel22", "self_text": "I’ve always had body issues. My mom kind of is at fault at that. She wanted me to be perfect because she gained weight and always regretted it. “Don’t end up like me” or “be careful i used to look like you and look at me now!” Type thing. I’m 5’8 and 153 lbs which is average. Even at my thinnest  weight I wasn’t thin enough. I hate my body shape I have no curves and no butt. I have love handles that just will never go away. Recently I’ve finally stopped dieting and have just followed normal eating. I was so happy I stopping binging I stopped obsessing over food. I made healthy choices because I wanted to and it was mindless instead of logging every bite down in an app. I was feeling good and felt I looked it. \n\nI can wear between a size L and size M depending. I got a high waisted bathing suit last summer and it hid my side handles but made my flat butt look even flatter so I decided since I’ve lost about 13 pounds to get “hipster bottoms” still a full coverage bathing suit but not droopy in my back side. I ordered a medium and put it on and all those feelings came flooding back. I just looked in the mirror and started crying. I’m so sick of hating my body and criticizing myself. I don’t even have an appetite for dinner now because I’m so disgusted with my feelings.  I KNOW I’m not a big girl.  I should be thankful for what I have but I instead hide my body because of all its flaws. I have no kids but at 27 in the next few years it’s something I will want and I don’t want to fuck up my future kids with body issues like my mom did to me and my siblings. What do people do? Talk to someone?", "subreddit": "BodyAcceptance"}
{"post_id": "cetq4t", "created_utc": 1563462700, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "cetuop", "created_utc": 1563463272, "title": "Struggling with partner’s preferences", "author": "yellowposy2", "self_text": "Hey all, I’m in AN recovery (16 months!) and I’m terrified of gaining weight. I haven’t gained weight in recovery (well I did, but I lost it again) but I’ve lately been struggling with my body image. I know my boyfriend prefers skinny girls, and my body type is slim-average (although my BMI is 18.5, I have a bad frame/build). My bf is amazing and loves me and makes it known he thinks I’m skinny, but I’ve lately been seeing lots of skinnier girls and worrying that he would like me so much better if I lost 10 lbs. \n\n\nDoes anyone have advice for dealing with these insecurities? Thank you for reading and for any comments, I love this community.", "subreddit": "BodyAcceptance"}
{"post_id": "cev66d", "created_utc": 1563469410, "title": "Lost 30 lbs and still feel disgusting", "author": "smpatt611", "self_text": "I have recently lost 30 lbs. I finally got under 200 and I feel better. I get all these compliments, and I still feel HUGE. Like, 30 lbs is such an accomplishment for me. I should be happy, but here I am, looking at my rolls and wondering what I can do to drop another 30.\n\nI also feel like if I’m not getting male attention, I seek it out. \n\nIt has destroyed my marriage and I feel so sad all the time.", "subreddit": "BodyAcceptance"}
{"post_id": "cev72y", "created_utc": 1563469522, "title": "Someone told me I should write about things I cared of so heres an \"articule\" I just finished called: Im fat and also I love me for it. Be kind while rating it. English is not my first language so excuse me for syntax or grammar errors.", "author": "jayharr9", "self_text": "Growing up in a Puerto Rican d conservative household self-love is not the first topic that comes into mind when I reminiscence my family's values.  I come from very strong religion-based values and in my house, it was always better to please God than to look good or to be \"hip” to be honest if that is still an expression these days.  I distinctly remember negative comments about my weight when I was young and at that moment I associated my body as something bad and shameful.  My teen years weren't a cake either being as chubby as I am, middle school was terrible I was constantly bullied for my weight, mannerisms, and manboobs.  Thank heavens for my friends if it weren't for them I would've done much worse or even some crazy stuff. As a boy,  people expect you to be confident.  To be this force of nature that can handle a conversation or even brag about stuff.  That was not me,  I completely hid in books and animation.  All-day looking at cartoons about superheroes because the world of fantasy was always better than to live in a world where you don't feel accepted or even remotely validated.    \nHigh school came and bullying was apparent and very real in my life but there was something different I learned how to make people laugh and that helped get more socially savvy and it gave me lots of good friends and people that to this day we are close in some way shape or form.   People came just to see me crack jokes and have a good time and they were in for a treat.  That moment gave me lots of confidence in myself,  for the first time people weren't making fun of me they were laughing with me. Some witty observation or an absurd comment with a twist.  Glimpses of low self-esteem hit me when no one was around but I still felt that things would get better at some point.   \nThe puberty years were gone and now a totally different dimension opened for me at college which was great because I was finally watching different points of views in topics and society was changing its views on so many levels that I truly had hope and to make it more awesome that were I met one of my dearest friends who was a plus-sized model and through conversation and a lot of patience she made me feel like I was on top.  The best lesson that she gave me was self-confidence.  She pushed me to love myself in a way I never saw myself and not only she was an angel in that way she inspired me to be a better person by showing me that I was talented and that I was enough.  After college, I still struggle in some shape or form with my confidence some days I'm on top and some days I truly feel like garbage but even at those moments I still find ways to validate myself and love myself.  Something that will always stick in my mind is these two phrases:  \"You should always see yourself in the eyes of those who love you.” and “All you have is your body and hating it constantly will only waste your time.   Looking back,  I wish I took more photos, made more memories or connected with more people.  I wish I took my shirt off (I still don't) and loved my essence completely and reflect that self-love I feel inside on the outside.  In the end, things will get better, love finds you.  You start to see yourself as a complete person and not someone that has to try a new diet every week or someone who buys baggier clothes so your body rolls do not show.   You hate yourself less and start to see the good sides of your body because confidence and sexy does not necessarily need to have the perfect body also it isn’t tied to abs of a chiseled jaw.  Sometimes sexy can be a thick body, a nice belly or a smile that can light up a room that's why I constantly decide to love myself and not to listen to my negative thoughts.  Whenever you are in life or whatever your clothes sizes are always looking at the mirror-like you are deserving of love, respect, and acceptance.  Don't let anyone tell you your value.", "subreddit": "BodyAcceptance"}
{"post_id": "cew0gt", "created_utc": 1563473321, "title": "I don't want to wear a bikini", "author": "feliimena", "self_text": "I used to really hate my body when i was younger (I was never overweight, but definitely not skinny either). Now that I'm 18 I worked through it pretty much completely and I am very comfortable in my skin. I accepted that I'll never have a \"perfect body\" and I don't care anymore. I like my body exactly how it is.\n\nNow here's the problem. I'm about to go on vacation with my family and a few friends (including some people I don't know)\nWe have a house directly next to a lake and the weather is perfect so of course we're gonna go swimming.\nAnd I really don't want to wear a bikini (or bathing Suit, I have both)\nIt's not that I desperately want to hide my body, I just have no desire to show it. It seems so weird to me that as soon as you go swimming it's \"required\" to be almost naked in public. It just feels wrong. Being naked or almost naked is such an intimate thing to me, especially in front of complete strangers.\n\nI already thought about wearing a t-shirt in the water but that just seems like making a big deal out of it. And the last thing I want is to draw any unnecessary attention to myself.\nI think it would lead to everyone tip toing (idk how to spell that) around the topic and saying things like \"you don't have to be insecure about your body\". I'm not. I just don't want to show it to you. Why is that considered such a weird thing.\n\nI guess in the end I will just wear a bathing suit, be super uncomfortable the entire time and cry a little bit about it later but I will be okay. I just wish it didn't have to be like this", "subreddit": "BodyAcceptance"}
{"post_id": "cez4so", "created_utc": 1563488240, "title": "Body acceptance is hard.", "author": "buckymart", "self_text": "I've been walking, I've been exercising and eating super healthy... Accepting my body... But it still hurts to hear people calling me fat behind my back or directly at me. And the worst is... Its my family. And I'm not even that fat, you know. They think it doesn't matter because for them it really doesn't matter... But if they knew what I've been through in terms of body acceptance and the things I did they would never speak another word about weight. And sometimes I'm not strong enough to ignore it.", "subreddit": "BodyAcceptance"}
{"post_id": "cezwf8", "created_utc": 1563492168, "title": "Therapy is failing me", "author": "Larsus", "self_text": "Hey, female, 25 here. I have been at therapy for three years now. In tjat timespan I\"ve barely made any progress. I have gone through four therapists on that timespan. now I feel i am receding.\n\nI struggle with extremely poor body image and I have a tendency to punish my body for it not being as I want it through self harm or fasting. I just cannot function well enough anymore. I have been crying for the last week every night.\n\nIts really hard to find something I don't hate about my body. I cannot do much with it either, and am in pain a fair ammunt of time.\n\nHonestly I'm not sure what else i can do but get surgery. I hate just not being attractive or having no feature about myself I genuinely enjoy. I cannot leave the house without hours of preparation. I cry on the train home. I am too scared of my boyfriend's reaction to try and be intimate. I cant buy new clothes because i hate how the things i like look on me. I cant play games or even watch porn because of how i pale compared to the women there. All my friends are prettier than me and i just wish i could fix my body so I would stop wanting to scratch and rip it so much.\n\nPlease help me I can't take this anymore I want it to be over i want to feel pretty and be normal.", "subreddit": "BodyAcceptance"}
{"post_id": "cf7r42", "created_utc": 1563543986, "title": "Misconceptions about thermodynamics in fatlogic", "author": "The_Failord", "self_text": "I’m a physicist by trade, and nothing breaks my heart more than seeing fat acceptance advocates, HAES proponents, fat people and the rest of the usual suspects continually misunderstand the role that thermodynamics plays in how the human body deals with energy. What I’d like to do is outline (and debunk) three misconceptions about thermodynamics that are persistently thrown around in the fat-o-sphere and other places online.\n\n***Thermodynamics applies only to “simple” systems, not ones as complex as the human body***\n\nThis particular misconception is particularly pervasive. It’s not difficult to see why: physics is often thought as a discipline where abstraction is prized over concreteness (you may have heard of the joke about spherical cows in a vacuum). Thermodynamics, however, is unique amongst the branches of physics in that it’s not so much a theory as a manual for theories. By this I mean that in thermodynamics, we really don’t care about the internal workings of the systems we study (that’s generally the job of statistical mechanics). In thermodynamics, you adopt a “black box” approach:  no matter what goes on inside your incredibly complex system (be it the human body, a diesel engine, or even the Earth itself), thermodynamics is essentially a series of consistency checks against which you can check your theory. Your system can be as complicated as you want, but if your description of it doesn’t obey the laws of thermodynamics, something has gone terribly wrong.\n\n***The first law of thermodynamics applies only to closed systems, so it can’t apply to the human body***\n\nThis is flat-out wrong: the first law of thermodynamics applies to every system. In fact, the first law of thermodynamics is one of those consistency checks that I mentioned above:  in simple terms it tells you that you can’t conjure energy out of thin air. It’s an incredibly simple equation:\n\n&gt;dU = dQ - dW\n\n“The chance in internal energy of a system (dU) is equal to the energy you put in (dQ) minus the work the system performs (dW)”. Simple as that. Closed systems are ones which don’t interact with the environment (i.e. you never put energy into them, so dQ = 0), but the first law applies to all systems, no matter how complicated they are. The human body is absolutely fair game.\n\nWe all know that the change in your bank account over, say, a year is equal to the money you deposited minus the money you withdrew. Saying that the first law of thermodynamics only applies to closed systems is like saying that simple accountancy only applies if you never get paid! It makes no sense, and it shows a complete misunderstanding of what the first law of thermodynamics is.\n\nAs a side note, the second law of thermodynamics does only apply to closed systems, but discussing it is far too involved for me to do here. Let me just say that it really doesn’t have much to do with what you’re eating.\n\n***A calorie is not a calorie***\n\nThis isn’t a single misconception, but rather a collection of serious misunderstandings about what the term “calorie” actually means. Many times you hear fat proponents say things like:\n\n“A calorie is just the amount of energy needed to heat a gram of water by one degree Celsius, and this has nothing to do with weight and the human body.”\n\nLet’s lay down some terms: a calorie is a unit of energy. “Energy” is a very difficult term to define, but for our purposes it suffices to view it as the capacity of a system to do work. Now, it’s true that a calorie is defined as in the quote above, but that doesn’t at all mean that “calories” are special in any sort of way. You can measure energy using joules, electron-volts, or foot pound-forces if you want: the laws of nature are completely indifferent to the units you choose to express them in, and as it so happens, the first law of thermodynamics is one of them. Even saying “caloric intake” is ever so slightly misleading: it’s like calling your weight your “poundage” (or electric potential difference “voltage”). It’s just your energy intake: you chose to use calories to measure it. \n\nImagine someone saying “A meter is defined as the length of the path travelled by light in a vacuum in 1/299,792,458 of a second. What does that have to do with my height?” That’s exactly how silly it sounds to say that because the definition of a calorie uses water, it doesn’t apply to the human body. It’s just a standard we have chosen to use, and there are many, many other standards. If you want to use cupcakes to measure how much food energy you consume, be my guest, just be sure to use a standardized cupcake. \n\nOther common sayings are “human bodies process calories differently”, or “a calorie is not always a calorie”. At the risk of being pedantic, this should read “human bodies process energy differently”, but how true is that? It is certainly true that human bodies can process food differently, but energy? The answer is no. Once again, it doesn’t matter what goes on inside your body: you will never be able to generate energy out of thin air (“I eat nothing and I still put on the pounds”), or make energy vanish (“I eat like a pig and never gain weight”), unless somehow the food you're eating isn't actually giving your body any energy (and even then, the energy isn't vanishing, it's just passing through you). Lizzie Velásquez, for example, eats upwards of 5000kcal/day but is emaciated, since her body doesn't absorb most of it. You may even have a tapeworm that steals some of your precious dietary energy. However, if you look at the energy your body *actually takes in* (and in the vast majority of cases, all of the food you eat contributes towards it), you can never go wrong. Instead of saying “a calorie isn’t always a calorie”, we should probably say “a calorie on the nutritional information isn’t always a calorie your body absorbs”, although that’s less pithy (and still misleading, because for the vast majority of people, nutritional information is perfectly accurate).\n\n**ADDENDUM:** This is a note about different metabolic rates in humans, and another justification for \"a calorie is not a calorie\". Though the frequency and magnitude of this effect is often overstated, it is absolutely possible that there is a difference between people of the same build and same activity level in how much energy their bodies spend each day (colloquially, their metabolism). The reason could be a fever (which raises it), hypothyroidism (which lowers it), amputation (whoch *severely* lowers it), or just a natural variance in the metabolic rate. You can never *fully* trust BMR and TDEE calculators, but more often than not, they give you a really good estimate of your caloric needs. Still, these inaccuracies *can* be taken into account: it may require some trial and error by carefully monitoring what you eat and your activity levels, but you will find that the predicted levels of your metabolic rate will very, very rarely vary beyond about 200kcal/day. Nonetheless, at the end of the day, all these complications eventually boil down to a modification of the equation above: if something is causing you not to absorb all the energy in your food that you're eating, dU is a bit lower than it says on your nutritional info, and if your body requires more or less energy than average, dW has to change slightly. The first law of thermodynamics still works: a calorie is still a calorie, much like a pound is still a pound even if your recipe mistakenly calls for less flour than you actually need. The take-home message is just that when *applying* this nifty law, you have to be very aware of how much energy your body is *actually* spending each day, which may just vary a bit from the average.\n\n\nThermodynamics, by design almost, deals in “broad strokes”. It doesn’t say much about the human body, or any other system really. If anything, it says the least: it tells you the absolute minimum of information that is true about a system without knowing anything about its inner workings, and one thing that will never, ever stop being true is that energy is always conserved; or, if you prefer, there’s no such thing as a free lunch.", "subreddit": "fatlogic"}
{"post_id": "cf8rp8", "created_utc": 1563549293, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cfaxre", "created_utc": 1563559551, "title": "The veins in my forehead are always visible and I don't know what to do about it.", "author": "indianspaceship", "self_text": "First of all, I'm glad I found this subreddit.\n\nI'm a 20 year old guy who lives in the US. The veins in my forehead are always visible. Starting above my nose, 2 veins split up in a v that go to my hairline. I can feel indentations in my skull where they are. They are either dark blue if I'm not doing anything, more visible in the shade, or if I'm laughing or something just bulging but as soon as I stop they go back to dark blue lines\n\nI remember thinking about them as a kid, I'm pretty sure they have been at least somewhat visible my whole life, but in the last 8-9 months I have become so self conscious about it. I think I look grotesque. \n\nI've looked around online and I can't even find people talking about having the same thing, pictures of people who have it the same way, or anything to do about it. You've probably seen people with little blue veins on the side of the head by the temples. That is what it looks like for me, but instead 2 massive lines on my forehead.\n\n About 2.5 months ago when I moved back home for the summer from college, I went to the doctor and he suggested a type of plastic surgery that would kill the vein, but I don't think it would do anything because I have actual indentations in my skull, so the indentations would still be there. When I told him that, he suggested antidepressants and therapy. At the time, I was super depressed, but I feel like I have gotten a handle on that by myself. While my depression was directly caused by hating the way that I look, I got a haircut with bangs that covered my forehead and worked as hard as I could to not hate myself and focus on my good qualities. I'm planning on going to therapy when I move back to start school again.\n\nI had long hair for the last few years that I really liked, and I always got a lot of compliments on it. I wasn't worried about how my forehead looked at all. I'm not sure if my appearance or mentality changed. For the last 8-9 months I just wore a beanie or bandana every day to cover up my forehead. Any time I would take them off, I would be hyper self conscious. I went to my friends for help, and they all just said \"don't worry about it, you are who you are\" sort of thing. One day, I went into the food court without a hat on after I decided that they weren't too bad that day. Pretty much as soon as I walk inside, this guy I kinda know says, \"you know you have veins on your forehead right? That's really handsome, really attractive.\" I just said, \"thanks appreciate it.\" \n\nBefore I got a haircut, I thought my hair looked nice and complimented my face. Now with my current haircut i just look like a goofball, but my forehead is covered.\n\nI don't know what to do. I think I would be an attractive guy if I had a decent haircut and my forehead didn't look f**ked up. I think it just looks so weird. I think it's off-putting. Any suggestions? Thanks for taking the time.", "subreddit": "BodyAcceptance"}
{"post_id": "cfd6ld", "created_utc": 1563570432, "title": "I need serious help", "author": "idkwhateveriguess", "self_text": "So this is very hard to write about, but it's taking a serious role on my mental health and every time I talk about it I feel like I sound stupid so I dont know how else to help myself. I have widely spaced relaxed breasts and I absolutely hate them. I've dreamed of a boob job since puberty and I'm currently 25. Since I had my daughter over a year ago my body image has plummeted and I feel worse than I ever have. I've always had this breast shape and I lost over 100lb over two years ago and they didnt look better when I was my skinniest. Between that and my tummy, I cry most days and i worry my low self esteem will begin to take a tole on my relationship. I know theres nothing i can do other than surgery to fix it and theres no way i could afford that even in the next five years. I've tried my entire life to love my body and it just gets worse by the day. Anything and everything that can help is appreciated, please ans thank you for your guidance, criticism and everything inbetween", "subreddit": "BodyAcceptance"}
{"post_id": "cfeans", "created_utc": 1563575860, "title": "I think my daughter has an eating disorder", "author": "ezpezi", "self_text": "I have a 16 nearly 17 year old daughter. About a week ago, I went to her bedroom to let her know I was leaving the house. She wasn’t in there so I went to her bathroom door. Assumed she was taking a shower because the shower water was running until I heard her coughing and vomiting. Figured she was sick, left a note, and didn’t bring it up. 3 days later, I pass by her bathroom again, hearing the same exact thing.\n\nWould’ve asked her if she was sick the first time but had too much on my mind due to work. I would’ve asked her 3 days later until she walked out and I noticed her knuckles were visibly red. It looks as she had scraped them badly.\n\nFirst thought that came to my head; self induced vomiting. Now, I know my daughter, if I bring this up to her right away, she will FLIP. I wanted to make sure I could really help her.\n\nNext night, I offered to take her out for dinner (told her I got a promotion at work.) She refused. I asked her why and she said she wasn’t hungry. I told her I could pick something up for her and she could save it for tomorrow. Told me she wasn’t in the mood.\n\nNow in my head, I figure she has some sort of eating disorder. I’ve connected the facts and I’m assuming it must be bulimia or some sort. I’m not home very much anymore. Her father isn’t around so I’m mostly working.\n\nI love her to death. I wanna help her. I would’ve brought it up to her long ago but when she gets mad, she flips out and threatens to move into a dorm after the summer.\n\nIt’s just me and her. I don’t know what to do. I want to talk to her but I want to make sure whatever I’m doing is effective. I’m very close with her. She usually talks to me about her life but I understand why she chose to keep this hidden away. I love my daughter very much, and all I want do is help her, even if it’s not me during her recovery.\n\nI don’t know how long this has been going on. I heard the same vomiting today, came out with red knuckles and red cheeks. I don’t know if she knows I notice. She has a pale complexion so red on her is noticeable.\n\nSomeone please help me with this.\n\nEDIT: 2nd time around; I assumed if she was self inducing vomit, there was a reason. When I was in my 20’s, I had a horrible stomach virus I didn’t know about. I only felt nauseous and wasn’t able to vomit, so I did it on my own. Haven’t gotten sick like that since, so the details didn’t cross my mind.\n\nShe’s fairly skinny. Not overweight at all so I never thought she’d have a problem with body image. I don’t wanna sound like those oblivious moms. Now thinking back, I remember one time during her senior year, she refused to leave the house because she couldn’t find anything that didn’t make her look “obese.”", "subreddit": "BodyAcceptance"}
{"post_id": "cfefgq", "created_utc": 1563576543, "title": "I want to do something to better myself and stop obsessing over my looks, but I want to know where to start", "author": "EstrogeNitroglycerin", "self_text": "Hi there!\n\nI've recently (very very recently) suffered through a breakup and, in questioning myself about what I want the next stage of my life to be, I've decided that I need to finally start loving my body and stop hating myself so much. It's already ruined this relationship and I'm scared of what this chronic fear of what others think of me might take away from me next.\n\nFor context I'm a transwoman who suffers from hair-related Body Dysmorphic Disorder and from Depression since my teen years. All of my life, I've felt ugly, disgusting and, most importantly, unloveable and undesireable. I've always told myself that no man could ever find me attractive or love me, no matter what my heart or personality may be. In my relationship, I was with an asexual man who was amazing to me and who truly loved me, but knowing that he didn't find me, or anyone, attractive and the fact that he never once desired me have still left me with the thought I've always had, which is that I'm too ugly for affection or romance.\n\nBut I can't live my life like this anymore. I can't sit around telling myself how ugly I am and spending hours cursing my hair in front of a mirror or reminding myself that no one has ever told me that I was pretty in my life.\n\nI've been to therapy for multiple things, but didn't really get to touch up on this issue in depth. I know it would be good to go again but I've already spent so much money on it and I can't keep spending all of my paychecks on it. I still want to do something to help myself find love within me. I want to be able to have confidence in myself and to stop caring so much about those things. I want to feel alive for one.\n\nBut I don't know where to start.", "subreddit": "BodyAcceptance"}
{"post_id": "cfmu84", "created_utc": 1563635465, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cfoe5v", "created_utc": 1563643784, "title": "Diagnosis at 28 years old", "author": "bitingbathsheba", "self_text": "Three days ago I woke up to intense lower back pain. I have struggled with back pain that I knew was not normal for my age, but just measured it up to tight muscles. It normally flared up for a day, but just meant I couldn’t go running that day. This time the pain had taken over my entire lower back and hip. I couldn’t walk. I, who avoids doctors because I always think it will just “go away”,  couldn’t take it and went to the only place that would take me. After x - rays were taken, I was diagnosed with lower back c-shape scoliosis. \n\nNow, I could go into more details, but overall at first I had a sense of relief knowing that the back pain I did carry was not in my head. My running always falling short because of my feet going numb, the days I hobbled around as a 20 year old struggling to get up, all the school pictures with an awkward head tilt. It wasn’t in my head. But now at day three of pain, it’s the first day I finally can stand straight up again. I still have pain but at least I feel that I will soon be able to get back to my lifestyle.\n\nThe issue now is that I think about it all the time. I feel I am in 7th grade trying to relearn my body. How has this limited me already? How will it in the future? How many days of severe back pain do I have? How did everyone miss this while I was growing up getting scoliosis tests in school? Is it obvious? Can people see my deformed back? I keep reaching back and trying to feel up my spine. How could I not have known this?!\n\nI struggled so long to be comfortable with myself. Ive always been over average weight, more pudgy because of my short height really. Had acne since 4th grade. Was one of the first kids in my grade to hit puberty. Made fun of most of my years in elementary school. It took me so long to love myself. Three days ago I was a bad ass independent, rock climbing, muscular woman who finally has accepted most of my “flaws.” Yesterday, I was a crying, embarrassed, frustrated, little girl who had to ask her boyfriend to carry her bag because she couldn’t get out of the car and walk down the hallway without help.\n\nI know my muscles will loosen up soon and I will be right back at it, but I want to feel like I know myself again. I don’t want to worry about what the future holds. I am trying to find a doctor currently, and will be proactive. This won’t define my life, especially since it hasn’t the last 28 years. I am thankful for a body that somehow over compensated and I do not live in chronic pain. I don’t want to sit and complain. I just feel lost, ugly, and broken all again. It will pass, but I think I just needed to write it out. Thank you for reading.", "subreddit": "BodyAcceptance"}
{"post_id": "cfrllp", "created_utc": 1563660690, "title": "I feel like everyone judging because of my weight.", "author": "Sophie6776", "self_text": "Today I was feeling everyone at the grocery store was judging what type of food I put in my shopping cart. Also people casual harass about my weight. People seem to expect to become fit overnight,and this really irrates me. On top of this I suffer from gender dysmorphia.", "subreddit": "BodyImage"}
{"post_id": "cfrmky", "created_utc": 1563660849, "title": "Distorted view of myself", "author": "DitzyLion", "self_text": "I’m a teenager, 15 to be exact. I have been struggling with my body and self esteem for as long as I can remember. It got to points where I tried starvation (didn’t last long, mom caught on) and tried to purge twice but sobbed after nothing came up. I do think about starvation a lot and it honestly feels like it’s the only option. \n\nIt feels like everyone is looking at me but when I look at myself, I’m seeing someone or something different. Like things have gotten distorted over the years. This distorted view has made me feel very uncomfortable in my skin and has made me feel so...so much bigger than people say I am. \n\nI wear baggy clothing to hide my stomach and if clothing is too tight and shows my stomach through the cloth, I wear a huge jacket to cover up. \n\nI went out with my mom to buy a bikini for a party on a yacht (rich friend) and seeing my stomach made me feel so disgusted, so vile, like I was so fat. The yacht party was canceled because the yacht was crashed and I left before bathing suits came out with a water balloon fight. \n\nI take meds for depression and it’s made me lose weight but even then I still feel so uncomfortable in my skin. \n\nLike no matter how I look, I will still feel this way and it makes me feel stuck, I have no clue how to accept this, or how to work out of this. All I know is that I’m telling my therapist about all of this and hopefully things will work out. \n\nI am so sorry for posting here but I felt stuck and no matter how much I’ve tried to voice this, people have been just repeating things or just brush it off by saying they have body issues too. I can never explain much to them.", "subreddit": "BodyAcceptance"}
{"post_id": "cg6nal", "created_utc": 1563757626, "title": "My sister doesn't want to see me because of my body; seeking advice for conversation [trigger warning]", "author": "ThereWolves", "self_text": "Hello there! I'm a 21M, and am currently in a complicated situation. I would consider my sister (who is close to my age) to be a best friend of mine. We text each other all the time and she has always been there for me in the toughest of situations. We both attend colleges in different parts of the US. Recently I've wanted to see her in person, and while we still totally get along very well by text, she doesn't feel comfortable seeing me right now because of my body. She explicitly told me this, I didn't infer it. \n\n&amp;#x200B;\n\nSome context. Back in high school, I used to be a bit overweight, but it didn't effect might health negatively. This is kind of normal in my family, I never felt uncomfortable about my weight growing up. During high school, my sister had an eating disorder that I wasn't made aware of until relatively recently. She later told me that it was in part due to insecurities she had in high school, and to an extent she did it because she felt behind to me academically and socially. I understand why she felt that way because my high school could sometimes have an unforgiving social dynamic and I acknowledged I could have been a better support for her. We were never against each other in high school at all, but there was that hidden tension that I didn't know existed until I went to college.\n\n&amp;#x200B;\n\nOnce we started college, I think being a new environment really helped my sister a lot. She grew a lot academically and became very involved in a lot of activities.  When I went to college, I felt slightly insecure about my weight and got involved in some different athletic activities, so as a result I lost a noticeable amount of weight. When we'd visit for holidays, my sister would be very upset about my weight / eating habits; kind of micro-analyzing everything I did and would often leave the room during meals because it stressed her out. I don't make any comments about the way I eat or exercise, but just being physically around my sister upsets her.\n\n&amp;#x200B;\n\nSo I'm at this point where I'm not really sure what to do. I imagine she needs time and distance to feel better about herself and her relationship with me, so I won't be visiting her this summer because I don't want to force her into an uncomfortable position. However, I would like to see if there are any conversations I could have with her to make her feel better about this situation. I've already told her that I'm taking care of myself and that I always love her no matter what her body is like. I also avoid talking about anything related to health, body image and diet with the exception of mental health because I have gone through some weird stuff lately (that's a whole other story). Anyways, I want to do what is best for my sister and I think the best thing right now is to give her space, but I'd like some advice for anyone who has been in this situation before.\n\n&amp;#x200B;\n\nI don't know if this is the right place to post this, so let me know if there are other subreddits better suited for this. Thank you for your support.", "subreddit": "BodyAcceptance"}
{"post_id": "cg6wd6", "created_utc": 1563759149, "title": "Any recommendations for ideas or anything to help me begin to love my body?", "author": "Coffeepanda09", "self_text": "Last couple years, my bad self talk has become increasingly more frequent. Sometimes to the point that I make myself cry and then I feel like an idiot and ashamed for doing that. I'm not skinny, but I'm not very heavy. I'm not happy with my body or my face and I always compare myself to other women. I never see myself as attractive as others. It's extremely frustrating and I'm just wondering what has worked for many of you to begin to love yourself and gain confidence in who you are.", "subreddit": "BodyAcceptance"}
{"post_id": "cge3si", "created_utc": 1563806738, "title": "Meta Monday: Conversation", "author": "maybesaydie", "self_text": "Take this opportunity to converse among yourselves or to ask the mods any questions you may have. Happy Monday!", "subreddit": "fatlogic"}
{"post_id": "cgt0vs", "created_utc": 1563890706, "title": "Fatlogic in med school", "author": "Dr_Burke", "self_text": "We’re having a lecture on bariatric surgery in adolescents and the lecturer basically premised the talk by saying eat less move more doesn’t work. Granted, we got a slide on the intrinsic and extrinsic factors affecting weight. Any thoughts on how this approach will affect healthcare in the upcoming years?", "subreddit": "fatlogic"}
{"post_id": "cgtufl", "created_utc": 1563894739, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cgxxq2", "created_utc": 1563913427, "title": "Big breast but no hips? Wrong type of chubby?", "author": "Ziggi_diggi_do", "self_text": "(Wrote this very weird but can't articulate myself better) \n\nA lot of the time when I look at my body am I able to admire most things; \nMy face (sometimes), my breasts,  my thighs and legs.  \nBut when it comes to my hips and stomach, I feel very insecure.\n\nMost body positivity is around people being bigger then the \"norm\" and I love that but I feel like I can't be put into that category. \nCurvy is a word my friends and boyfriend has tossed around a lot, but I don't see myself as curvy. \n\nMy hips, can we say are very small, and with a slightly bigger then average stomach, doesn't it look good at all.  (Also my ass is non existent) Most days am I able to gloss over it but days like today makes me feel like crying. \n\nAm I the wrong type of chubby?", "subreddit": "BodyAcceptance"}
{"post_id": "ch4e3k", "created_utc": 1563949051, "title": "Men on YouTube discussing body acceptance", "author": "Sue_a_cider", "self_text": "I’m trying to put together a playlist of different YouTube videos of men discussing their body acceptance or history with eating disorders, but I’ve found it quite difficult to find an extensive group of people who talk about struggle or recovery in a healthy manner. It’s been difficult to find men discuss eating disorders in particular.\n\nMy hope is to be able to create a playlist that can be published that would have a series of people grouped together and hopefully lessen a feeling of isolation, one that I certainly have felt a lot and fought against.\n\nIf there’s someone you watched that inspired you or made you feel comfortable with yourself, I’d love to know.\n\nEDIT: Thanks for the suggestions, really useful. It's nice to see such a positive response :) if I fill out a list of sorts I'll be sure to post again!", "subreddit": "BodyAcceptance"}
{"post_id": "ch6jpn", "created_utc": 1563964899, "title": "i’ve gone back to being bad again", "author": "lunaleif", "self_text": "i’ve just come home from travelling and i lost quite a bit of weight and started to feel more confident in my self and i noticed other people (specifically men) paying more attention to me, which was nice because i’ve never really had that before.\n\nnow i’ve come back home and i’ve put lots of weight on again and i have my family constantly telling me how fat i am and pointing out how much i eat and i tell them to stop but they never do.\n\ni’m 5’11 and about 180 pounds so i’m just a pretty big person. i always try to be small and fade into the background but it never seems to work\n\ni’m so sad and i feel like no one will ever love me when i look like this", "subreddit": "BodyAcceptance"}
{"post_id": "ch9ffx", "created_utc": 1563981133, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
{"post_id": "chp0fw", "created_utc": 1564067596, "title": "Recipe Thursday", "author": "AutoModerator", "self_text": "\nBy popular demand, Thursdays will now have a thread to share recipes or other food-related stuff.\n\nEnjoy.", "subreddit": "fatlogic"}
{"post_id": "chtefn", "created_utc": 1564088066, "title": "New fat positive subreddit: r/fatliberation", "author": "saltierthangoldfish", "self_text": "Hello all! I’ve gotten mod permission to share this; thank you again :)\n\nI’ve created a new sub for fat positivity, acceptance, activism, etc. where you can come and talk about anything related to the fat experience! It’s r/fatliberation\n\nThe goal is to be affirming and inclusive for those who want to find a community on a site that often hates us.\n\nThe remove, ban, and block buttons will be used liberally to remove rule violators as quickly as possible.", "subreddit": "BodyAcceptance"}
{"post_id": "chtm2a", "created_utc": 1564089095, "title": "Is there something wrong with me or am I overreacting?", "author": "yoyohoethefirst", "self_text": "A few years back when I was 13 i was at the library with my step family and when we all went to check out the librarian told my step brother and sister how gorgeous their eyes were (they had light brown eyes, I had dark brown). And when she saw me, I kid you not, she jumped and immediately looked back down to check out our books.\n\nI'm your average black gir (kinky hair, dark eyes, big lips etc) but that moment has always effected me. Especially since that year we moved to Memphis when a lot of bullying started. And I always debate myself on wheather I was overreacting or not. So I would love to hear others thoughts!", "subreddit": "BodyAcceptance"}
{"post_id": "chx97q", "created_utc": 1564109118, "title": "Fat people dont owe the world weight loss", "author": "[deleted]", "self_text": "So I just need to vent with like-minded people.\n\nI deleted most of my social media and a big part of it was that if I show my pics, anything I say - including harmless non-offensive jokes - would sometimes turn into mocking my looks. I already feel better about how I look from not being exposed to that, but Im bitter that I cant be online as freely as some skinny white dude (I am female and also on some other marginalized axises) \n\nbut scrolling for random stuff can be compelling and today I glanced at the Reddit popular page.\n\nA top post from murderedbywords was about how every fat person can lose weight. \n\nThis is not true. Not exactly. Not if you add “long term”, or “safely”, not if you consider disability, pregnancy, illness. Not if what you mean is that we can all become skinny. \n\nBut also - man f that. Sure, I can and have lost weight. BUT I DONT OWE THAT TO YOU. Just because we can focus all our energy on becoming thin doesnt mean we should or have to. It doesnt justify the hate. \n\nAlso, an admin rejected reports of concern by saying he is fat, and Im so fuckin tired of self-hating fat people who cant see we are all different and want to drag us down in self hate. Studies show that self hate makes it harder to lose weight anyway!\n\nWe deserve to move in peace through the world like anyone else!  No one is entitled to mock us!\n\nAlso on reddit I saw a post wherein fat women *dancing* were mocked “bc hEaLth!1!?!” Because the way to encourage health is to mock us when we exercise? Like the guys who yell at us when we bike, the folks who post pics mocking us swimming or at the gym.  We dont owe the world invisibility!\n\nIn fact, my own fatphobic family mocks me for my obsession with healthy food! They try to pressure me to eat crap when I say no, the same people who convinced me to stop eating bread, blaming it for my diabetes. Later, hospitalized for anorexia, two teams of nutritionists worked overtime to deprogram me saying I am skipping important foods with my focus on “junk” like bread.  My mom even tried to discourage me exercising. Im convinced some people just want us to stay fat to mock us.\n\nAfter one doctor fat shamed me after a weight loss the nurses said was too much too fast due to starving myself, I stopped being able to go to doctors for a while. My new doctor hates that shit and discourages me from focusing on weight loss. \n\nPeople say “it’s my business (to bully) bc your health care costs money.” but yet you claim you bully due to health. If I was gonna lose weight I would have to do so under the care of a doctor! I DESERVE HEALTH CARE. No one is saying smokers shouldnt be allowed in public without mockery or allowed health care.  \n\nIt shouldnt matter why Im fat or whether I try to lose weight. I have a right to equal human dignity. I am not on this earth to be a punching bag. I dont owe the world misery, invisibility, or to destroy myself in pursuit of thinness. My life is about so much more than that and my energies belong elsewhere.\n\nI hope this was more helpful than depressing to read, I hope it is appropriate to post. Im so done argueing with haters and I dont feel like venting all this to my friends rn so I was hoping maybe this was relateable, idk. Thanks for listening and for being out there in spaces like this, it’s brave and helpful.", "subreddit": "BodyAcceptance"}
{"post_id": "ci03hf", "created_utc": 1564128592, "title": "Tuberous breasts", "author": "7ammy30", "self_text": "So I just found out that I have tubular boobs. I’m sad and really hopeless. I hate the way they look. I looked it up on google (which has more extreme cases that I don’t have) and I’m pretty sure by the looks of it that’s what I have. Along with excessive body hair and a thinning hairline, it’s safe to say that I’m pretty sure no guy will ever love me. I think I’m never going to love myself. Even if I get plastic surgery I’ll still end up passing all of this down to my children if I ever have any. I hate my life.", "subreddit": "BodyAcceptance"}
{"post_id": "ci3vid", "created_utc": 1564152949, "title": "How do I accept my body", "author": "raun5000", "self_text": "\n👋🏻 \nMy whole life I’ve been kind of small, I’m turning 16 this autumn and right now I’m 5’3 and weight about 115 pounds. \n\nEven though I know that I’m in good shape and all of that was it a long time ago I was happy about my body and didn’t think I could lose some weight. \n\nI’ve always enjoyed working out and I am a active person, but last autumn I started to workout everyday and eating less than before. This led to me losing almost 10 pounds and my period stopped coming. I also started to have anxiety attacks and I stared to cry if I ate to much. \n\nI told some close friends about this and it helped me release that feeling like that about my body isn’t good. So I decided to “only” workout six times a week. \n\nDespite that my period didn’t show up so I had to go to a doctor and they told me to gain weight and workout less. I tried to do as they said even though the thought of gaining weight gave me anxiety I went down to five workouts a week. \n\nNow it’s summer break and I workout around two times a week and am back on my normal weight, my period came back last week. So I guess things are looking up but I still get anxiety about my body quite often and there’s a lot that I’m mad about with my body. \n\nI really want to have a healthy relationship with my body, exercise and food, but I just don’t know how.", "subreddit": "BodyAcceptance"}
{"post_id": "ci446j", "created_utc": 1564154074, "title": "Fat Rant Friday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "cibzk0", "created_utc": 1564194158, "title": "Was anyone else bullied for how they looked?", "author": "gingerdemontor", "self_text": "It’s hard to convince yourself it’s all subjective, in your head, when you’ve been treated different because you look different. \n\nIsn’t it?\n\nIt was really bad in elementary school to the point I retreated and became an introvert. Bad to the point I’d get slapped by the other kids. And sadly it still occurs in the adult world. \n\nBut then I think. Kids will pick on anything. One of my friends who is beautiful was ostracized by our entire grade because... why? We had our reasons, but I think it’s just because in a group of people there will always be a sacrificial goat for everyone to release their frustrations on.\n\nI did look different when I was younger, and I’m not sure if I look different today, but it’s still a deep insecurity of mine. \n\nIm not a victim. I’m strong, have formed calluses. And... hard to admit, but Ive treated others in ways I regret to hurt the way I’ve been hurt, by sheer ignorance, or for reasons that are still mysterious to me. I just wish I wasn’t lonely. I’m lucky to have friends and family, but I wish this insecurity didn’t prevent me from walking into a room and opening up to new people, especially those who look like the type who would have bullied me in the past. \n\nCan anyone relate?", "subreddit": "BodyAcceptance"}
{"post_id": "ciimlb", "created_utc": 1564240321, "title": "Wellness Weekend", "author": "AutoModerator", "self_text": "\nHave some progress pictures you'd like to share?\n\nWant to tell us about the highs and lows of your fitness journey?\n\nJust discovered this sub and you're ready to tell us how awesome we are?\n\nThis is the time and this is the place.", "subreddit": "fatlogic"}
{"post_id": "cizdir", "created_utc": 1564338361, "title": "Loving my stretch marks!", "author": "ali-greene", "self_text": "Anyone else feel empowered and loving their stretch marks?  I’ve recently started working out 6 days a week and running a lot during those workouts.  My body’s been changing in ways that I love, and I’ve started to get stretch marks on my thighs, and I love them!  They’re a nice natural reminder about my ever changing body.", "subreddit": "BodyAcceptance"}
{"post_id": "cj31q6", "created_utc": 1564356105, "title": "we will defeat the body shamers", "author": "HowAboutUthrowMeAway", "self_text": "People, I came here to this group to have a little rant. I am sick of people *still* being so small minded towards other peoples bodies on posts, even if they're only 'having a laugh' it makes me rage. How are people still so arrogant? It may be a joke to them, but what about the people they are making humour from, it hurts and it always will. Our bodies should not be associated with humour at all, why can't we all be accepted for who we are- inside and out. \n\n Body positive campaigning has come a long way though and I don't want us to ever give up. Feel free within your own body and embrace what you have. When you see a body negative post, shut that shit down- tell them that they aren't funny, tell them how arrogant they are. People who shame need to change their mindset so hopefully one day we can live in a world where we are all accepted, no matter how we look.", "subreddit": "BodyAcceptance"}
{"post_id": "cj8dui", "created_utc": 1564388619, "title": "My hatred of my body is ruining my life and I want it to stop, but I don't know how", "author": "superfuckingpuppy", "self_text": "TW: suicide mention\n\nI'm a 24 year old woman. I'm 5'4\". I weigh 200 lbs. I've hated my body since I was a small child. My mom was obsessed with diet culture when I was a kid and she was constantly putting me and my sister on whatever fad diet she was on for the week. She openly did not want me to be fat. Throughout middle and high school I struggled with disordered eating. The only time my mom praised me on my appearance was when I was eating less than 1000 calories a day at 15 and weighed 115 lbs. I've also struggled with anxiety and depression for my entire life (bipolar disorder, anxiety, and ADHD run strong in my family) and I started turning to food. In my later high school years, I started feeling incredibly suicidal and made a couple of attempts when I was 17 and 18. Therapy and meds didn't seem to help. My weight was climbing. I tried working out, but I live in South Florida and I'm extremely sensitive to the heat. Now I'm here, at 24, and I can't look in mirrors. I've never been able to be in a stable relationship. It's hard for me to feel comfortable enough to even leave the house. I hate myself every time I look in the mirror. I don't know what to do. I feel at a loss. \n\nI don't want to feel this way anymore, but I really don't have any friends or people to ask for advice. Am I going to hate myself forever? What's the point? When will this end?", "subreddit": "BodyAcceptance"}
{"post_id": "cjc4f6", "created_utc": 1564411266, "title": "Meta Monday: No Stupid Questions", "author": "maybesaydie", "self_text": "Ask the community any questions you have about weight and fatlogic. **No rants please.**\n\nAsk the mods any questions you may have for them.", "subreddit": "fatlogic"}
{"post_id": "cjcxrv", "created_utc": 1564414908, "title": "I’m just gonna drop this here (Body insecurity)", "author": "Ahlyae", "self_text": "So, hey, I guess. I’m new to this sub. I joined because I wanted to vent my perception of myself somewhere without it being too weird or random.\n\nSo, who is me? I’m known online as Ahlyae, I’m almost 16 years old, around 1.60 cm, and around 55 kg. Aka, I’m not overweight and I don’t see myself as such. I don’t think I’m really that pretty, I sometimes have good moments or photos, but in general I don’t feel pretty. My hair is kinda messed up, because I used to pull hair (trichotillomania) It used to be worse, but I’ve largely quit, though my hair is still recovering from it. Now, that’s not all.\n\nEveryone is born with birthmarks/skinmarks, same for me, though lately I have been getting a lot more. And I mean a lot. The pigmented skinmarks appear close to eachother and mostly on one specific area. My right arm has them at the lower half of the lower arm and at the lower half of the upper arm (on top(the darker skin) not inside (lighter skin) My left arm has little ones all over the lower arm (on top) and I know for a fact they are going to become bigger aswell.\n\nThe thing is, I have been burned more when I was younger, been in the sun more when I was younger. And now randomly they start appearing out of nowhere.\n\nI also have quite some on my shoulders, but they are mostly because of past shoulder burns (when I was younger) and I don’t think they got much bigger, but its hard to check on my own. My legs, belly, back, face, and hands have been spared from the marks, but I really really dislike them and it made me self conscious, my mom doesn’t have anything like this (she had very few marks) my sisters don’t really have anything like it (so far I know) and my “dad”, yeah I don’t know. \n\n\n\nOkay, thank you for reading this odd self conscious perception of my body.", "subreddit": "BodyAcceptance"}
{"post_id": "cjg138", "created_utc": 1564428269, "title": "Co-worker congratulated me for being pregnant", "author": "tahdoton", "self_text": "This just fucked me up. I have had problems with body image my whole adult life, especially with how fat is distributed in my body. I am not overweight; all I eat just goes straight to my tummy area and I am self conscious about it. Soooo Today my co-worker approached me and started to congratulate me for being pregnant. I felt mortified and just shook my head, I did not know what to do. She got really embrassed and apologized multiple times. I know she didn't mean to be rude but I just felt so horrible the whole day and I still can't stop thinking about it. I can't shake the feeling that I have to start losing weight. I don't know, I just feel fucking horrible.", "subreddit": "BodyAcceptance"}
{"post_id": "cjj7mz", "created_utc": 1564442595, "title": "The beauty of a mother's body", "author": "darkoj-", "self_text": "Hey all, I've had something on my mind, and I just felt the need to express is openly. This seemed like an appropriate place to do so. Please, excuse me if I'm mistaken.\n\nI've reacquainted myself with a close childhood friend from 20 years ago, and our renewed relationship is romantic. We are both single parents, with me having two children out of wedlock, and her being divorced with three. At approximately 30 years old for the both of us, we still retain slim and supple builds, but there is a clear difference in our body types.\n\nBeing male, I was never directly affected by the physical toll of carrying children; she, on the other hand, obviously has. Through adulthood, I've maintained a balanced diet, and a strong exercise regimen, with a focus on attaining an ideal form for my own body, best depicted by mainstream male standards. She also eats decently, but doesn't exercise at nearly the same frequency or intensity as I. Of course, the process of multiple pregnancies does much to the female body also.\n\nMy conceptions of beauty for the female form, particularly, those features that arouse most, are confined by my heightened interest in nubile characteristics, and flawlessness, if such a condition exists for the human body. I saw her body, in its entirety, this weekend, as did she see mine. Her body did not match these ideal forms that I've accepted in my mind and imagination.\n\nHer body presented the evidence of bearing three children, in the multitude of ways you would expect it to. The definition of her muscular anatomy gave testimony to her time spent with her children, and not the gym. Scarring from  surgery due to a medical necessity was plainly visible in an area that is otherwise appreciated for its unadulterated form. Bruising acquired during hiccups of rough and tumble children's play presented themselves here and there.\n\nShe presented herself to me, and I love every inch I encountered. I knew every apparent imperfection, was only a perfection of her motherly form. Her reservations in exposing herself, was contrasted with the confidence in which I revealed mine. Yet, it seems to me that a lack of confidence is what drives me to meet physical standards, whereas a deep confidence in her parental commitment gives her the freedom to offer herself, both in body and mind, to what matters most to her. She's beautiful, and I'm so pleased to acknowledge and experience a beauty that I had previously undervalued.", "subreddit": "BodyAcceptance"}
{"post_id": "cjl3dx", "created_utc": 1564452267, "title": "Does anyone else struggle with how they're feeling about themselves based on what others say?", "author": "samvogz_", "self_text": "I've never posted on here and was having a difficult time trying to figure out what sub to post this on so hopefully this isallowed. \n\nlong story kinda short - I've struggled with my body image for some time now. shout out to the man who told me \"I let myself go and needed to lose weight or he'd leave me\" for sending me into a downwards self-hating spiral.    \n\n\nI was x amount of lbs heavier at that time than I am now. I lost weight and still struggled reguardless of people constantly telling me that I'm \"too thin\" etc.  Suffered from serious symptoms of BDD @ my thighs. Would really watch what I was eating bc I didn't \"want to get fat.\" you know the drill. \n\nPast few months I've really been working on loving myself and I've been doing AWESOME, have had minimal negative thoughts about myself and even if I did, I'd correct it with a \"no I look GOOD.\" (this is the first time in years I didn't have a breakdown when I put my bathing suit on for the first time... total change.)\n\nI've felt good about myself even though people at work / home are always saying that I lost weight or I'm too thin. Tonight especially I'm caught thinking the opposite of what I thought for years even though I've finally learned to love myself as I am. I'm sitting here thinking \"wow I think I am too thin\" or \"maybe they're right I lost too much weight.\" \n\nIt's weird. I'm the same as I've been the past few months as I've started to love and embrace myself. Has anyone else dealt with this? Does what others say whether it be negative OR positve affect how you percieve yourself even if it was originally what you were aiming for? (bascially - I always wanted to be \"tiny\" and \"small\" and now I'm sitting here questioning if Im too \"tiny\" or \"small.\")\n\nHow do you deal with not letting what people say about you become intrusive thoughts once you've finally learned to love yourself?", "subreddit": "BodyAcceptance"}
{"post_id": "cjl8m2", "created_utc": 1564453043, "title": "I don't know how to function", "author": "WelliHadAPlan", "self_text": "My body image is so low I honestly don't know how I'm still making it to work.  I manage to pull on my work Polo and go to work for eight hours. Four hours too long because I can only pretend not to hate myself for about four. I can't hear anything anyone says to me through out the day because my head is filled with comments about my body I think is in their mind. I'm so so tired. And I go to bed replaying everyone I work with and How much they must hate me. It's really sad because they're actually really nice. My mind won't let them be though. I don't go out, I don't make friends. I don't really have a resolve statement. I'm just having a hard time.", "subreddit": "BodyImage"}
{"post_id": "cjnqnp", "created_utc": 1564467884, "title": "Toxic fat shamers - aka my family", "author": "thc95", "self_text": "So I keep getting called fat by my family members. Yes fat. It’s starting to get to me and upset me, I know I have a slight weight issue and every time I look in the mirror I feel so shitty and unhappy. I’m 5ft2 and I weight 65kg Asian. I dread going to family events because my aunties poke fun and say cruel things that I’m so fat and undesirable. I’ve started to actively exercise and eat clean but I’m struggling to keep the weight off.\nThe funny things is, it’s not my direct family members like sisters or parents who say mean things, it’s my aunts they’re so damn bitter. The point is I feel trapped in my own body and super isolated, I just moved to the states from the U.K. and I’m hating it, my father is a toxic piece of sh*t who only cares about himself. Rn I hate my life, I need advice on how I can change my mindset and feel happy again. [acceptance] [fatshaming] [weightgain]", "subreddit": "BodyAcceptance"}
{"post_id": "cjt3wy", "created_utc": 1564499506, "title": "Fat Rant Tuesday", "author": "AutoModerator", "self_text": "\nFatlogic in real life getting you down?\n\nIs your family telling you you're looking too thin?\n\nAre people at work bringing you donuts?\n\nDid your beer drinking neighbor pat his belly and tell you \"It's all muscle?\"\n\nIf you hear one more thing about starvation mode will you scream?\n\nLet it all out. We understand.", "subreddit": "fatlogic"}
{"post_id": "ck24r2", "created_utc": 1564540273, "title": "Comparisons make up my whole life", "author": "kittypawprints4me", "self_text": "I have been dealing with some body image issues lately. this past year has been rough, as I lost some weight but I'm at a point of constantly being scared of gaining it back (which I have started to slightly due to a bit of binging).\n\nHowever, I don't feel pressured by media as much as other people are. I'm sure it adds to my anxieties, but the biggest thing pushing me is not the photoshopped people, but the people around me. My family constantly points out if someone gained weight, and my parents have been recently on the \"be fit and healthy\" train, which they don't mean for me to be affected by. My friends are skinny and complain about their weight, which makes me sink in more and more to my negative thoughts. My best friend who is skinnier than me tried her hardest to convince me that her legs are \"bigger than mine\" which she knows is not true, and makes me think she is just pitying me. \n\nSo the question is, how do I stop comparing myself? because I think other people with different body shapes are fine, yet I have a constant fear of being seen as the person who gained a bit of weight, or my friends pity-complimenting me. Is my anxiety disorder a part of it? Probably, but I know there must be a way to tackle it rather than bottle it up with my other mental problems.", "subreddit": "BodyAcceptance"}
{"post_id": "ck2agn", "created_utc": 1564541091, "title": "Scared to see my best friends", "author": "oooookaaayy", "self_text": "I’m going to see my best Friends for the first time in about 2 months (we just graduated university). We are going to be on a beach/ boat the whole time. I haven’t put on any weight but I just feel incredibly insecure, and I’m nervous they’ll judge me for my weight. They have never said anything to me in the past but I am nervous because I don’t like myself very much at the moment. \n\nWhat tips do you guys have about body acceptance, especially when wearing a bathing suit", "subreddit": "BodyAcceptance"}
{"post_id": "ck9sk5", "created_utc": 1564586003, "title": "Wellness Wednesday", "author": "AutoModerator", "self_text": "\nGot recipes, fitness tips, or questions on health and fitness?\n\nDo you love fatlogic and want to tell the world?\n\nHave you lost weight and want to tell us how you did it?\n\nThis is the time and place.", "subreddit": "fatlogic"}
